[
    [
        "1) In a certain code, 37 means which class and 583 means caste class. What is the code for caste ?",
        "a) 3",
        "b) 7",
        "c) 8",
        "d) Either 5 or 8",
        "Answer : d",
        ""
    ],
    [
        "2) In a certain code language CLOCK is written as KCOLC. How will STEPS be written in that code ?",
        "a) SPEST",
        "b) SPETS",
        "c) STESP",
        "d) SPTES",
        "Answer : b",
        ""
    ],
    [
        "3) In a certain code language AYS is written as BAT . How will BYS be written in that code ?",
        "a) CAT",
        "b) RAT",
        "c) MAT",
        "d) AAT",
        "Answer : a",
        ""
    ],
    [
        "4) If RIVER=72 then LAND=?",
        "a) 30",
        "b) 29",
        "c) 31",
        "d) 28",
        "Answer : c",
        ""
    ],
    [
        "5) In a certain code language POLISH is written as MLIFPE . How will BIG be written in that code ?",
        "a) ZFD",
        "b) YFD",
        "c) BGD",
        "d) EHF",
        "Answer : d",
        ""
    ],
    [
        "6) In a certain language , oka peru mens fine cloth, meta lisa means clear water and dona lisa peru means fine clear weather, then which word in that language means weather ?",
        "a) peru",
        "b) oka",
        "c) meta",
        "d) dona",
        "Answer : d",
        ""
    ],
    [
        "7) If in certain language GUARD is coded as FTZQC, how is DRIVER coded in that code?",
        "a) EQHUDS",
        "b) CQHUDQ",
        "c) QEHUDS",
        "d) QCHUQ",
        "Answer : b",
        ""
    ],
    [
        "8) In a certain code, 15789 is written as XTZAL and 2346 is written as NPSU. How is 23549 written in that code ?",
        "a) NPTUL",
        "b) PNTSL",
        "c) NPTSL",
        "d) NBTSL",
        "Answer : c",
        ""
    ],
    [
        "9) In a certain code language POND is written as RSTL. How will HEAR be written in that code ?",
        "a) GHIZ",
        "b) GHIJ",
        "c) JCLZ",
        "d) JIGZ",
        "Answer : d",
        ""
    ],
    [
        "10) If DO is coded as 35 then DONE will be coded as",
        "a) 70",
        "b) 65",
        "c) 72",
        "d) 75",
        "Answer : a",
        ""
    ],
    [
        "11) In a certain code language DOG is written as WTL. How will CAT be written in that code ?",
        "a) XZG",
        "b) XYG",
        "c) XGZ",
        "d) XAZ",
        "Answer : c",
        ""
    ],
    [
        "12) In a certain code language  DLEGYLC is written as ENGLAND. How will HLBDY be written in that code ?",
        "a) INDIA",
        "b) INDFZ",
        "c) NDOIA",
        "d) JNDEA",
        "Answer : b",
        ""
    ],
    [
        "13) If in a certain language PARENTS is coded as QBSFOUT, how is FRIEND coded in that code?",
        "a) GSJFOE",
        "b) EOJFOE",
        "c) GSJFOD",
        "d) EQJDMC",
        "Answer : a",
        ""
    ],
    [
        "14) If SHARP is coded as 58034 and PUSH as $^%*, then RUSH is coded as",
        "a) 3568",
        "b) 3658",
        "c) 3685",
        "d) 3583",
        "Answer : b",
        ""
    ],
    [
        "15) In a certain code language FILE is written as UROV. How will SOUR be written in that code ?",
        "a) IFLT",
        "b) HLFI",
        "c) LIFT",
        "d) IHIF",
        "Answer : b",
        ""
    ],
    [
        "16) If in a certain code DIVERT is written as SCQHDU , how is CONFER written in that code?",
        "a) QBDNEO",
        "b) QDBNEM",
        "c) QBDNEM",
        "d) None of thses",
        "Answer : c",
        ""
    ],
    [
        "17) In a certain code language CAT is written as DDY. How will BIG be written in that code ?",
        "a) CML",
        "b) CJL",
        "c) CLL",
        "d) CNL",
        "Answer : c",
        ""
    ],
    [
        "18) In a certain code language STAMP is written as TVBOQ.How will BRAIN be written in that code ?",
        "a) CTBLO",
        "b) CTCKO",
        "c) CTBKL",
        "d) CTBKO",
        "Answer : d",
        ""
    ],
    [
        "19) If a certain language, PUNJAB is coded as QVOKBC, how is BOMBAY coded in that code?",
        "a) CPNCBX",
        "b) CPNCBZ",
        "c) CPOCBZ",
        "d) CQOCBZ",
        "Answer : b",
        ""
    ],
    [
        "20) In a certain code language CGZ is written as XTA. How will DFP be written in that code ?",
        "a) WHK",
        "b) KUW",
        "c) WUK",
        "d) WUQ",
        "Answer : c",
        ""
    ],
    [
        "21) If DELHi is coded as 73541 and CALCUTTA as 82589662,how will CALICUT be coded ?",
        "a) 5279431",
        "b) 5978213",
        "c) 8251896",
        "d) 8543691",
        "Answer : c",
        ""
    ],
    [
        "22) In a certain code language DEAD is written as FGCF. How READ will be written in the same code language?",
        "a) TCGF",
        "b) FGCF",
        "c) TGCF",
        "d) TGFC",
        "Answer : c",
        ""
    ],
    [
        "23) In a certain code language PUJA is written as CFWJ. How will RUBY be written in that code?",
        "a) AYWL",
        "b) AXWX",
        "c) AXWL",
        "d) AXVL",
        "Answer : c",
        ""
    ],
    [
        "24) In a certain code language PRAMOD is written as SODJRA. How will KESHAV be written in that code ?",
        "a) NBVFDS",
        "b) NBUEDS",
        "c) NBVECS",
        "d) NBVEDS",
        "Answer : d",
        ""
    ],
    [
        "25) In a certain code language ACT is written as BGZ. How will GEL be written in that code ?",
        "a) HTI",
        "b) HIR",
        "c) HSH",
        "d) HTS",
        "Answer : b",
        ""
    ],
    [
        "26) If in a certain code THRASH is coded as UGSZTG, then how will HEAD be coded in that code?",
        "a) IECD",
        "b) GDZC",
        "c) IDBC",
        "d) GDBC",
        "Answer : c",
        ""
    ],
    [
        "27) In a certain code language STEAMER is written as TUFBNFS. How will HOUSE be written in that code ?",
        "a) IPVUF",
        "b) IPUTF",
        "c) IPVTF",
        "d) IPVSF",
        "Answer : c",
        ""
    ],
    [
        "28) In a certain code language JOURNAL is written as MRXUQDO. How will TRAINING be written in that code ?",
        "a) WUDHQLQJ",
        "b) WUDLQLQJ",
        "c) WUDKQLQJ",
        "d) WUCLQLQJ",
        "Answer : "
    ]
]