[
    [
        "Q1. Arjun asked Karan, \"Will you attend the meeting tomorrow\"",
        "(a) Arjun asked Karan will he attend the meeting the day after",
        "(b) Arjun asked Karan will he attend the meeting tomorrow",
        "(c) Arjun asked Karan to attend the meeting tomorrow",
        "(d) Will the meeting attend by Karan, asked by Arjun",
        "Answer: (a) Arjun asked Karan will he attend the meeting the day after ",
        ""
    ],
    [
        "Q2. \"Please don't kill me\" Rajiv said to the attackers",
        "(a) Rajiv begged the attacker to not to killed him",
        "(b) Rajiv begged the attacker not to kill him",
        "(c) Rajiv asked the attacker to not kill him",
        "(d) Rajiv pleaded with the attacker to not to kill him",
        "Answer: (b) Rajiv begged the attacker not to kill him ",
        ""
    ],
    [
        "Q3. \"I don't know the way. Do you ?\" he asked",
        "(a) He said that he didn't know the way and did I know it",
        "(b) He told me that he was not knowing the way, but wondered if I knew",
        "(c) He said that he didn't know the way and asked me if I did",
        "(d) He asked me if I know the way which he didn't",
        "Answer: (c) He said that he didn't know the way and asked me if I did ",
        ""
    ],
    [
        "Q4. My cousin said, \"My room-mate snores throughout the night\"",
        "(a) My cousin said that her room-mate snored throughout the night",
        "(b) My cousin told that her room-mate snored throughout the night",
        "(c) My cousin complained to me that her room-mate is snoring throughout the night",
        "(d) My cousin felt that her room-mate may be snoring throughout the night",
        "Answer: (a) My cousin said that her room-mate snored throughout the night ",
        ""
    ],
    [
        "Q5. The Captain said, \"Hurrah ! we scored a goal.\"",
        "(a) The Captain exclaimed excitedly scoring a goal.",
        "(b) The Captain exclaimed with joy that they had scored a goal.",
        "(c) The Captain express joy that they had scored a goal.",
        "(d) The Captain was jubilant at having score a goal.",
        "Answer: (b) The Captain exclaimed with joy that they had scored a goal. ",
        ""
    ],
    [
        "Q6. He said to them, \"Don't make a noise\"",
        "(a) He told them that don't make a noise",
        "(b) He told them not make a noise",
        "(c) He asked them not to make a noise",
        "(d) He ordered them not to make a noise",
        "Answer: (d) He ordered them not to make a noise ",
        ""
    ],
    [
        "Q7. \"What happened ?\" she said",
        "(a) She questioned on the happening",
        "(b) She asked what happened",
        "(c) She asked what had happened",
        "(d) She asked what was happening",
        "Answer: (c) She asked what had happened ",
        ""
    ],
    [
        "Q8. She said, \"What a man !\"",
        "(a) She exclaimed with surprise what man he is",
        "(b) She exclaimed with surprise at man's peculiarity",
        "(c) She exclaimed with surprise what peculiar man he was",
        "(d) She exclaimed with surprise that he was a peculiar man",
        "Answer: (d) She exclaimed with surprise that he was a peculiar man ",
        ""
    ],
    [
        "Q9. She said, \"Shall I ever get a job ?\"",
        "(a) She wondered that she should ever get a job",
        "(b) She wondered whether she ever get a job",
        "(c) She wondered if she would ever get a job",
        "(d) She wondered would she ever get a job",
        "Answer: (c) She wondered if she would ever get a job ",
        ""
    ],
    [
        "Q10. He said, \"Give me some food, please.\"",
        "(a) He requested me that I shall give him some food",
        "(b) He requested me to give him some food",
        "(c) He requested me that I gave him some food",
        "(d) He requested me that he be given some food ",
        "Answer: (b) He requested me to give him some food ",
        ""
    ],
    [
        "Q11. Pankaj said to me, \"They have never helped me.\"",
        "(a) Pankaj told me that they had never helped him",
        "(b) Pankaj told me that they have never helped him",
        "(c) Pankaj told me that they never helped him",
        "(d) Pankaj told me that they were never helped ",
        "Answer: (a) Pankaj told me that they had never helped him ",
        ""
    ],
    [
        "Q12. \"Where is the bus stop ?\", she asked me",
        "(a) She asked me where the bus stop",
        "(b) She asked me where the bus stop was",
        "(c) She asked me where is the bus stop",
        "(d) She asked me where the bus stop is",
        "Answer: (b) She asked me where the bus stop was ",
        ""
    ],
    [
        "Q13. The old man said, \"Thanks I shall never forget this kindness, Ankit\"",
        "(a) The old man applauded Ankit for his kindness and he shall never forget Ankit",
        "(b) The old man thanked Ankit and assured him that he would never forget his kindness",
        "(c) Ankit was being thanked by the old man for his kindness towards an old man",
        "(d) The old man said thank you to Ankit for his kindness",
        "Answer: (b) The old man thanked Ankit and assured him that he would never forget his kindness ",
        ""
    ],
    [
        "Q14. Anil's mother reminded him to take his wallet",
        "(a) “Are you going to take your wallet or not?” said Anil to his mother",
        "(b) “Don't forget to take your wallet, Anil” said his mother",
        "(c) Anil's mother said, “Remember your wallet, Anil?\"",
        "(d) “Here is your wallet Anil” said his mother",
        "Answer: (b) “Don't forget to take your wallet, Anil” said his mother",
        ""
    ],
    [
        "Q15. The principal said, \"Be quiet, boys.\"",
        "(a) The principal called the boys and ordered them to be quiet.",
        "(b) The principal commanded the boys that they be quiet.",
        "(c) The principal urged the boys to be quiet.",
        "(d) The principal said that the boys should be quiet.",
        "Answer: (c) The principal urged the boys to be quiet.",
        ""
    ],
    [
        "Q16. Mother said, \"Will you tell me what it means, Pritam?\"",
        "(a) Mother asked Pritam if he will tell her what it meant.",
        "(b) Mother asked Pritam that he would tell her what it meant.",
        "(c) Mother asked Pritam if he would tell her what it meant.",
        "(d) Mother asked Pritam that he will tell her what it meant.",
        "Answer: (b) Mother asked Pritam that he would tell her what it meant.",
        ""
    ],
    [
        "Q17. He said to the dentist, \"I have a toothache.\"",
        "(a) He told the dentist that I have a toothache.",
        "(b) He told the dentist that he had gotten a toothache.",
        "(c) He told the dentist that he had a toothache.",
        "(d) He told the dentist that I have a gotten toothache.",
        "Answer: (c) He told the dentist that he had a toothache.",
        ""
    ],
    [
        "Q18. The spectators said, \"Bravo! Good hit, Jay!\"",
        "(a) The spectators applauded Jay for his good hit.",
        "(b) The spectators applauded Jay saying, bravo, good hit Jay.",
        "(c) The spectators applaud Jay for his good hit.",
        "(d) The spectators applaud Jay saying, bravo, good hit Jay.",
        "Answer: (a) The spectators applauded Jay for his good hit.",
        ""
    ],
    [
        "Q19. The accused said to the judge, \"Let me meet my children before I die, sir.\"",
        "(a) The accused requests the judge to let him meet his children before he died.",
        "(b) The accused requested the judge to let him meet his children before he died.",
        "(c) The accused begs the judge to allow him to meet his children before he dies.",
        "(d) The accused begged the judge to let him meet his children before he dies.",
        "Answer: (b) The accused requested the judge to let him meet his children before he died.",
        ""
    ],
    [
        "Q20. Neha said, \"Need I write a letter ?\"",
        "(a) Neha asked if she have to write a letter",
        "(b) Neha asked if she had been writing a letter",
        "(c) Neha asked of writing a letter",
        "(d) Neha asked if she had to write a letter",
        "Answer: (d) Neha asked if she had to write a letter ",
        ""
    ],
    [
        "Q21. She told me that she would do it next month",
        "(a) She said to me, \"I shall do it next month\"",
        "(b) She said to me, \"I shall do it the coing month\"",
        "(c) She said to me, \"I shall be doing it the following month\"",
        "(d) She said to me, \"I shall be doing it the next month\"",
        "Answer: (a) She said to me, \"I shall do it next month\" ",
        ""
    ],
    [
        "Q22. Who is creating this mess ?",
        "(a) Who has created this mess ?",
        "(b) By whom was this mess created ?",
        "(c) Who created this mess ?",
        "(d) By who is this mess being created ?",
        "Answer: (d) By who is this mess being created ? ",
        ""
    ],
    [
        "Q23. Radha ordered Pankaj to go away.",
        "(a) Radha ordered to Pankaj \"Go away\".",
        "(b) Radha said to Pankaj \"Go away.\"",
        "(c) Radha said \"Will you go away Pankaj ?\"",
        "(d) Radha ordered Pankaj \"Please go away\".",
        "Answer: (b) Radha said to Pankaj \"Go away.\" ",
        ""
    ],
    [
        "Q24. He said that he would go as soon as it was possible.",
        "(a) He said, \"I shall go as soon as it is possible.\"",
        "(b) He said to me \"I want to go as soon as it is possible.\"",
        "(c) He said, \"she will go as soon as it is possible.\"",
        "(d) He said that, \"I shall go as soon as it is possible.\"",
        "Answer: (a) He said, \"I shall go as soon as it is possible.\" ",
        ""
    ],
    [
        "Q25. I said to him, \"Do you know my name ?\"",
        "(a) I asked him do you know my name.",
        "(b) I asked him if my name was known to him.",
        "(c) I told him whether he knew my name.",
        "(d) I asked him if he knew my name.",
        "Answer: (d) I asked him if he knew my name. ",
        ""
    ],
    [
        "Q26. He said to him, \"Please wait there till I return\".",
        "(a) He requested him that wait till I return.",
        "(b) He urged him that he wait till he returns.",
        "(c) He urged him that he wait till he returns.",
        "(d) He requested him to wait there till he returned.",
        "Answer: (d) He requested him to wait there till he returned. ",
        ""
    ],
    [
        "Q27. She said, \"I begin my day with a cup of tea.\"",
        "(a) She said that she had began her day with a cup of tea.",
        "(b) She said that she begins her day with a cup of tea.",
        "(c) She said she begins her day with a cup of tea.",
        "(d) She says that she begins her day with a cup of tea.",
        "Answer: (b) She said that she begins her day with a cup of tea."
    ]
]