[
    [
        "Q.1. Author of Around the World in Eighty Days is ",
        "B. Richard C. U.S.Naipaul D. Jules Verne",
        ""
    ],
    [
        "Q.2. The author of Business @ Speed of Thought is ",
        "A. Dick FransisB. John Gray C. Bill Gates D. David Baldexi",
        ""
    ],
    [
        "Q.3. Who among the following is the author of the book India Remembered?  ",
        "A. J K Rowling B. Robert Dallek C. Pamela Mountbatten D. Stephen HawKING",
        ""
    ],
    [
        "Q.4. Who among the following wrote the poem Subh-e-Azadi?  ",
        "A. Sahir Ludhiyanvi B. Faiz Ahmed Faiz C. Muhammad IQbal D. Maulana abul kalam",
        ""
    ],
    [
        "Q.5. Who wrote Devdas?  ",
        "A. Bibhutibhushan Bandopadhyay B. Saratchandra Chattopadhyay C. Kalidasa D. Surdas",
        ""
    ],
    [
        "Q.6. Who said Man is a political animal?  ",
        "A. Socrates B. Plato C. Dante D. Aristotle",
        ""
    ],
    [
        "Q.7. Panchatantra has been written by  ",
        "A. Surdas B. Kalidas C. Vishnu Sharma D. Vishakhadatta",
    ],
    [
        "Q.9. Which of the following books is written by R.N. Tagore?  ",
        "A. Anand Math B. Chidambara C. Rakta Karabi D. Durgesh Nandini",
        ""
    ],
    [
        "Q.10. Who said, Child is the father of Man?  ",
        "A. Lord Byron B. William Wordsworth C. Shakespeare D. John Keats",
        ""
    ],
    [
        "Q.11. Who wrote the book Discovery of India?  ",
        "A. Vikram Seth B. Rabindranath Tagore C. Mahatama Gandhi D. Jawaharlal Nehru",
    ],
    [
        "Q.13. Who among the following wrote the book Bahubivah?  ",
        "A. Raja Ram Mohan Roy B. Ishwar Chandra Vidyasagar C. Pandita Rambai D. Rabindranath Tagore",
        ""
    ],
    [
        "Q.14. The Musalman, the handwritten daily published from which one of the following places?  ",
        "A. Chennai B. Hyderabad C. Mysore D. Lucknow",
        ""
    ],
    [
        "Q.15. Who wrote the book The Story of the Integration of the Indian States?  ",
        "A. BN Rau B. C Rajagopalachari C. Krishna Menon D. VP Menon",
        ""
    ],
    [
        "Q.16. The autobiography Living History has been authored by  ",
        "A. Margaret Atwood B. Benazir Bhutto C. Hilary Clinton D. Monica Lewinsky",
        ""
    ],
    [
        "Q.17. Who has written Shakuntala?  ",
        "A.Kalidasa B.Kabir C.Tulisidas D.none",
    ],
    [
        "Q.19. Who wrote the songs of Kaho naa Pyaar Hai?  ",
        "A. Ibrahim Ashq B. Mehboob C. Anand Bakshi D. Sameer",
        ""
    ],
    [
        "Q.20. Who is the author of Hamlet?  ",
        "A. Christopher Marlowe B. Geoffrey Chaucer C. William Shakespeare D. Edith Wharton",
        ""
    ],
    [
        "Q.21. The song Bande Mataram was originally composed in  ",
        "A. Assamese B. Bengali C. Hindi D. Sanskrit",
    ],
    [
        "Q.23. The Author of India Divided is  ",
        "A. Rajendra Prasad B. V.V.Giri C. F.A.Ahmed D. Zail Singh",
        ""
    ],
    [
        "Q.24. Shakespeares character named Beatrice appears in which play?  ",
        "A. The Tempest B. Othello C. Much Ado About Nothing D. A MidsummerNightsDream",
        ""
    ],
    [
        "Q.25. Who is the Author of The Name Of The Rose?  ",
        "A. John Steinbeck B. William Shakespeare C. Umberto Eco D. J.K. Rowling",
        ""
    ],
    [
        "Q.26. Who is the author of the book Blue Star?  ",
        "A. K.S. Brar B. Prakash Singh Badal C. K.P.S. Gill D. Gurcharan Singh Tohra",
        ""
    ],
    [
        "Q.27. The Book Broken Wings was written by  ",
        "A. Amrita Pritam B. Sarojini Naidu C. R.K. Narayan D. Maithili Sharan Gupta",
    ],
    [
        "Q.29. Who is the author of the book My Experiments with Truth?  ",
        "A. Winston Churchill B. James Morris C. Michael Anderson D. Mahatma Gandhi",
        ""
    ],
    [
        "Q.30. The book Prison Diary was written by  ",
        "A. Jawaharlal Nehru B. Morarji Desai C. Jai Prakash Narayan D. Atal Behari Vajpayee",
        ""
    ],
    [
        "Q.31. Who is the author of the book Kamayani?  ",
        "A. Raja Rao B. Prem Chand C. Mulk Raj Anand D. Jai Shankar Prasad",
    ],
    [
        "Q.33. Gita Govinda is written by  ",
        "A. Tulsidas B. Jaya Dev C. Maithili Sharan Gupta D. Valmiki",
        ""
    ],
    [
        "Q.34. Who is the author of All the Prime Minister Men?  ",
        "A. Janardan Thakur B. Romesh Thapar C. Kamla Chattopadhyaya D. Khushwant Singh",
        ""
    ],
    [
        "Q.35. The Gathering Storm is written by  ",
        "A. Voltaire B. Romain Rolland C. Winston Churchill D. George Washington",
        ""
    ],
    [
        "Q.36. The famous book The Daughter of the East is written by  ",
        "A. Ms. Bandarnaike Sirimavo B. Ms. Taslima Nasreen C. Ms. Aungsan Suru Kyi D. Ms. Benazir Bhutto",
        ""
    ],
    [
        "Q.37. Who is the author of the Book My Presidential Years?  ",
        "A. Neelam Sanjiva Reddy B. R.Venkataraman C. Dr.Rajendra Prasad D. Dr. S. Radhakrishnan",
    ],
    [
        "Q.39. Who is the author of the book Sword And the Sickle?  ",
        "A. R.K. Laxman B. K.P.S. Menon C. R.K. Narayan D. Mulk Raj Anand",
        ""
    ],
    [
        "Q.40. Who is the author of the book Indira Gandhi Returns is  ",
        "A. Vijayalakshmi Pandit B. Khushwant Singh C. Kuldip Nayyar D. Nirad C. Choudhuary",
        ""
    ],
    [
        "Q.41. Who is the author of the famous book Midnights Children?  ",
        "A. Salman Rushdie B. Vikram Seth C. V.S.Naipaul D. Nayantara Sehgal",
    ],
    [
        "Q.43. India of our dreams is a book written by  ",
        "A. Dr.S. Radhakrishnan B. M.V.Kamath C. Dr. Rajendra Prasad D. Dr.C. Subramaniam",
        ""
    ],
    [
        "Q.44. Who is the author of Tom Sawyer?  ",
        "A. John Ruskin B. Leo Tolstoy C. Mark Twain D. William Shakespeare",
        ""
    ],
    [
        "Q.45. Eight Lives is a book written by  ",
        "A. Mahesh Yogi B. Raja Ramanna C. Savita Ambedkar D. Raj Mohan Gandhi",
        ""
    ],
    [
        "Q.46. Mrichchhakatika was written by  ",
        "A. Banabhatta B. Kalhana C. Vikramaditya D. Shudraka",
        ""
    ],
    [
        "Q.47. The book Satanic Verses was written by  ",
        "A. William Golding B. Salman Rushdie C. Gunnar Myrdal D. Gunnar Myrdal",
    ],
    [
        "Q.49. The book Light That Failed was written by  ",
        "A. T.S. Eliot B. Amrita Pritam C. John Ruskin D. Rudyard Kipling",
        ""
    ],
    [
        "Q.50. The first History Book was written by  ",
        "A. Aristotle B. Euclid C. Herodotus D. Julius Caesar",
        ""
    ],
    [
        "Q.51. Who is the Father of English Poetry?  ",
        "A. Charles Dickens B. Milton C. Wordsworth D. Chaucer",
    ],
    [
        "Q.53. Who wrote the original Panchatantra?  ",
        "A. Vishnu Sharma B. Kalidasa C. Tulsi Das D. Samudra Gupta",
        ""
    ],
    [
        "Q.54. The book The Players of the Past has been written by  ",
        "A. David Candena B. M.N.Srinivas C. K.A.Abbas D. Khushwant Singh",
        ""
    ],
    [
        "Q.55. Who are The Little People of the Rocks, who Mowgli uses against the Red Dogs?  ",
        "A. Snakes B. Bees C. A kind of Indian fairy D. A neighbouring wolf pack",
        ""
    ],
    [
        "Q.56. My Music, My Lifes is the autobiography of  ",
        "A. Pt ShivkumarSharma B. Ustad Amjad Ali Khan C. Pt Ravi Shankar D. Ustad Zakir Hussain",
        ""
    ],
    [
        "Q.57. The author of Through the Corridors of Power is  ",
        "A.Kiran Bedi B.PC Alexander C.JN Dixit D.TN Seshan",
    ],
    [
        "Q.59. Who among the following wrote  The Communist Manifesto along with KarlMarx?  ",
        "A. Friedrich Engels B. Emile Durkheim C. Robert Owen D. Max Webers",
        ""
    ],
    [
        "Q.60. Who wrote the book The Origin of Species?  ",
        "A. Sir Alexander Fleming B. Louis Pasteur C. Charles Darwin D. Stephen Hawking",
        ""
    ],
    [
        "Q.61. Who was the Nobel Prize for Literature in 2010?",
        "A. Doris Lessing B. William Golding C. Maria Vangas Lloss D. Harold Printer",
        ""
    ],
    [
        "Q.62. India Discovered was written by",
        "A. John Keats B. T.S.Eliot C. P. D.Tandon D. Jawaharlal Nehru",
        ""
    ],
    [
        "Q.63. An Ordinary Persons Guide to Empire was written by",
        "A. Vikram Seth B. Arundhati Roy C. Shibha De D. Radhakrishnan",
        ""
    ],
    [
        "Q.64. The True History of the Kelly Gang was written by",
        "A. Ibsen B. Immanuel Kerf C. Peter Carey D. Daniel Patric Moynihan",
        ""
    ],
    [
        "Q.65. The Hero Arthus Kipps was created by",
        "A. H.K.Browne B. H.G.Wells C. M.Reynolds D. Marcel Pagnol",
        ""
    ],
    [
        "Q.66. Who is the author of the book India 2020?",
        "A. Nibal Singh B. R.K.Narayan C. Sidney Shelton D. Dr.A.P.J.Abdul Kalam",
        ""
    ],
    [
        "Q.67. Who wrote the Book Gandhi and Stalin?",
        "A. Raj Narayan B. Louis Fisher C. Anita Desai D. V.S.Naipaul",
        ""
    ],
    [
        "Q.68. The book My Nation My Life was written by",
        "A. L.K.Advani B. T.N.Seshan C. Fervez Musharaf D. Manmohan Singh",
        ""
    ],
    [
        "Q.69. The book Infinite Justice was written by",
        "A. Indira Goswami B. Arundhati Roy C. Kushwant Singh D. Jules Verne",
        ""
    ],
    [
        "Q.70. The White Tiger was written by",
        "A. Faust B. Salman Rushdie C. Nibal Singh D. Aravind Adiga",
        ""
    ],
    [
        "Q.71. Dr.S.Radhakrishnan wrote",
        "A. Butterfield B. Sanctuary C. Indian Philosophy D. Invisible Man",
        ""
    ],
    [
        "Q.72. Hinduism was written by",
        "A. R.N.Tagore B. Nirad C.Choudri C. K.M.Munshi D. Dr.Karan Singh",
        ""
    ],
    [
        "Q.73. Prof.Judith Brown wrote",
        "A. Death in Venicle B. Death of a City C. Das Kapital D. NehruA Political Life",
        ""
    ],
    [
        "Q.74. Who has written the book named God and the Bible?",
        "A. L.Ramadas B. Dipendra Singh C. Mathew Arnold D. Savitha Ambedkar",
        ""
    ],
    [
        "Q.75. The book Space Today was written by",
        "A. Morgan B. Naresh Mehta C. Mohan Sundarajan D. K.A.Abbas",
        ""
    ],
    [
        "Q.76. The Book Bread, Beauty and Revolution was written by",
        "A. Milton B. Jules Verne C. K.A.Abbas D. Bernard Shaw",
        ""
    ],
    [
        "Q.77. The Painted Veil was written by",
        "A. J.M.Barrie B. Somerset Maugham C. Charles Dickens D. Thackeray",
        ""
    ],
    [
        "Q.78. The book Letters from a Father to Daughter was written by",
        "A. Rajaji B. Radhakrishnan C. Mahatma Gandhi D. Jawaharlal Nehru",
        ""
    ],
    [
        "Q.79. The book Thus Spake Zarathustra was written by",
        "A. Hegel B. Heidegger C. Nietzsche D. Kierkekard",
        ""
    ],
    [
        "Q.80. Who was composed our National Anthem?",
        "A. Iqbal B. Bharathiar C. Rabindranath Tagore D. Bankim Chandra Chatterji",
        ""
    ],
    [
        "Q.81. The original name of Bharathidasan is",
        "A. Vedachalam B. Kuppuratnam C. Kanaka Subburatnam D. Anbazhagan",
        ""
    ],
    [
        "Q.82. The author of Waiting for Godot is",
        "A. Saul Bellow B. Albert Camus C. Samuel Beckett D. Jean Paul Sartre",
        ""
    ],
    [
        "Q.83. Great Tragedy was written by",
        "A. H.G.Wells B. Z.A.Bhutto C. Emile Zola D. Mohamed Ali Zinna",
        ""
    ],
    [
        "Q.84. Doctor Zhivago was written by",
        "A. Leo Tolstoy B. R.L.Stevenson C. Amrit Wilson D. Boris Pasternak",
        ""
    ],
    [
        "Q.85. Economics of the Third World was written by",
        "A. S.K.Ray B. S.P.Dalvi C. Dr.S.Radhakrishnan D. Dr.Karan Singh",
        ""
    ],
    [
        "Q.86. The novel One Hundred Years of Solitude was written by",
        "A. H.G.Wells B. Salman Rushdie C. Gabriel Garcia Marquez D. Arundhati Roy",
        ""
    ],
    [
        "Q.87. The Character Falstaff was created by",
        "A. Shakespeare B. Bernard Shaw C. Charles Dickness D. Oliver Goldsmith",
        ""
    ],
    [
        "Q.88. Who wrote the novel Pratapa Mudaliyar Charithram?",
        "A. Akilan B. Vedanayagam Pillai C. M.Varadharajan D. Ramalingam Pillai",
        ""
    ],
    [
        "Q.89. Who writes under the penname of Sujatha?",
        "A. Rajesh Kumar B. Kovi.Manisekaran C. Rengarajan D. Parthasarathy",
        ""
    ],
    [
        "Q.90. The novel The Citadel was written by",
        "A. Dr.Karan Singh B. A.J.Cronin C. Charless Dickness D. Dr.Karan Singh",
        ""
    ],
    [
        "Q.91. Who is the author of Six Characters in search of an Author?",
        "A. Henrik Ibsen B. Lugi Pirandello C. Oliver Goldsmith D. Mathew Arnold",
        ""
    ],
    [
        "Q.92. The book Ivanhoe is written by",
        "A. Dickens B. Goldsmith C. Sir Walter Scott D. Thackeray",
        ""
    ],
    [
        "Q.93. Let A Hundred Flowers Bloom is said to be",
        "A. Mao B. Lenin C. Churchill D. Brezhnev",
        ""
    ],
    [
        "Q.94. Who wrote Two Leaves and a Bud?",
        "A. Raja Rao B. Gunther Grass C. R.K.Narayan D. Mulk Raj Anand",
        ""
    ],
    [
        "Q.95. Who wrote the book My Girlhood?",
        "A. H.G.Wells B. John Ruskin C. Taslima Nasreen D. Winston Churchill",
        ""
    ],
    [
        "Q.96. R.K. Narayan wrote",
        "A. Last things B. Death in Venice C. The English Teacher D. India Discovered",
        ""
    ],
    [
        "Q.97. One World and India was written by",
        "A. Ruskin Bond B. J.M.Barrie C. Arnold Toynbee D. Charles Darwin",
        ""
    ],
    [
        "Q.98. Who wrote the book Origin of Species?",
        "A. Charles Darwin B. Morgan C. Malthus D. Mendel",
        ""
    ],
    [
        "Q.99. The author of The Discovery of India is",
        "A. Rajaji B. Motilal Nehru C. Jawaharlal Nehru D. Mahatma Gandhi",
        ""
    ],
    [
        "Q.100. Kautilya was the author of",
        "A. Indica B. Ramayana C. Mahabharatha D. Arthasastra",
        ""
    ],
    [
        "Q.101. Who wrote the book The God Father?",
        "A. Agatha Christic B. V.S.Naipaul C. Ian Fleming D. Mario Puzo",
        ""
    ],
    [
        "Q.102. Who created the character Sancho Pancha?",
        "A. Shelley B. Cerventes C. Kipling D. George Eliot",
        ""
    ],
    [
        "Q.103. Socrates was a",
        "A. Essayist B. Novelist C. Dramatist D. Philosopher",
        ""
    ],
    [
        "Q.104. Original name of Mark Twain is",
        "A. Napoleon B. Samuel Clemens C. Wellington D. Stevension",
        ""
    ],
    [
        "Q.105. The character Emma was written by",
        "A. Jane Austen B. Emily Bronte C. Amrita Pritam D. Emily Dickinson",
        ""
    ],
    [
        "Q.106. Who is the Author of the book One Day Wonders?",
        "A. Clive Lyoyd B. Imran Khan C. Richard D. Sunil Gavaskar",
        ""
    ],
    [
        "Q.107. Who is the author of The Genius of India?",
        "A. S.K.Ray B. Guy Sorman C. Dr.Karan Singh D. Patric White",
        ""
    ],
    [
        "Q.108. In search of Gandhi was written by",
        "A. Dr.S.Radhakrishnan B. Dr.Karnan Singh C. Richard Attenborough D. Taya Zinkin",
        ""
    ],
    [
        "Q.109. The Bionic Man was created by",
        "A. Martin Caidens B. George Winter C. Stephen Martin D. Prior Mordin",
        ""
    ],
    [
        "Q.110. Saiman Rushdie wrote",
        "A. The Sea B. The Accidental C. ShalimarThe Clown D. My Frozen Turbulence in Kashmir"
    ]
]