[
    [
        "Q.1. Who was the first administrator-statesman to attempt planning as a means for economic development?",
        "a) Sir CP Ramaswami Aiyyar b) M Viswesvarayya c) VT Krishnamachari d) C Rajagopalachari",
        " Ans .B",
        ""
    ],
    [
        "Q.2. An economy is at the take off stage on its path to development when it",
        "a) becomes stagnant b) begins steady growth c) is liberalized d) gets maximum foreign aid",
        " Ans .B",
        ""
    ],
    [
        "Q.3. Which of the following is the basic characteristic of Oligopoly?",
        "a) a few sellers, one buyer b) a few sellers, many buyers c) a few sellers, a few buyers d) many sellers, a few buyers",
        " Ans .B",
        ""
    ],
    [
        "Q.4. The aim of which of the Five Year Plans was to correct the disequilibrium in the economy?",
        "a) First Five Year Plan b) Second Five Year Plan c) Third Five Year Plan d) Fourth Five Year Plan",
        " Ans .A",
        ""
    ],
    [
        "Q.5. Which of the following Five Year Plans recognized human development as the core of all developmental efforts?",
        "a) Eighth Five Year Plan b) Seventh Five Year Plan c) Fifth Five Year Plan d) Third Five Year Plan",
        " Ans .A",
        ""
    ],
    [
        "Q.6. Which of the following plans aimed at improving the standard of living?",
        "a) Third Plan b) Fourth Plan c) Fifth Plan d) Sixth Plan",
        " Ans .B",
    ],
    [
        "Q.9. Which Indian state has the largest number of cotton textile mills?",
        "a) Madhya Pradesh b) Maharashtra c) Gujarat d) West Bengal",
        " Ans .B",
        ""
    ],
    [
        "Q.10. Minor ports like Kakinada, Machilipatnam, Bheemunipatnam, and Krishnapatnam are in which of the following states?",
        "a) Tamil Nadu b) Andhra Pradesh c) Maharashtra d) Karnataka",
        " Ans .B",
        ""
    ],
    [
        "Q.11. When, for the first time, did the Prime Minister of India announce the 20-point Economic Programme?",
        "a) 1973 b) 1974 c) 1975 d) 1976",
        " Ans .C",
    ],
    [
        "Q.13. Census in India is being held regularly after every",
        "a) 6 years b) 8 years c) 10 years d) 12 years",
        " Ans .C",
        ""
    ],
    [
        "Q.14. People belonging to what age group are eligible for training under TRYSEM scheme?",
        "a) 18-35 b) 25-40 c) 18-50 d) 18-25",
        " Ans .A",
        ""
    ],
    [
        "Q.15. According to the census in 2001, which city in India has the largest population?",
        "a) Kolkatta b) Mumbai c) Delhi d) Chennai",
        " Ans .B",
        ""
    ],
    [
        "Q.16. In terms of geographical area India occupies what position in the world?",
        "a) Five b) six c) seven d) three",
        " Ans .C",
        ""
    ],
    [
        "Q.17. India does not share its boundary with which of the following countries?",
        "a) China b) Taiwan c) Burma d) Bhutan",
        " Ans .B",
        ""
    ],
    [
        "Q.18. Agriculture employs almost what percent of the Indian population?",
        "a) 90 b) 50 c) 40 d) 70",
        " Ans .D",
        ""
    ],
    [
        "Q.19. Which one of the following is a Kharif crop?",
        "a) bajra b) wheat c) mustard d) barley",
        " Ans .A",
        ""
    ],
    [
        "Q.20. Which one of the following is a rabi crop?",
        "a) rice b) jowar c) cotton d) peas",
        " Ans . D",
        ""
    ],
    [
        "Q.21. Who is known as the Father of White Revolution?",
        "a) V Kurien b) MS Swaminathan c) JP Narayan d) Baba Amte",
        " Ans .A",
        ""
    ],
    [
        "Q.22. Who was the chief architect of Green Revolution that significantly improved the agricultural yield in the country?",
        "a) MS Swaminathan b) VR Krisha Aiyyar c) V Kurien d) Jawaharlal Nehru",
        " Ans .A",
        ""
    ],
    [
        "Q.23. The Chota Nagpur Plateau famous for its mineral deposits is in",
        "a) Uttar Pradesh b) Jharkhand c) Madhya Pradesh d) Bihar",
        " Ans .B",
        ""
    ],
    [
        "Q.24. The Mumbai Stock Exchange was set up in",
        "a) 1875 b) 1900 c) 1922 d) 1947",
        " Ans .A",
        ""
    ],
    [
        "Q.25. What does the term NSDL stands for?",
        "a) National Securities Development Limited b) National Securities Depository Limited c) National Safety Development Limited d) Natural Safety Deployment Limited",
        " Ans .B",
        ""
    ],
    [
        "Q.26. Which one of the following was launched with the objective of helping the poor in rural areas to become self employed?",
        "a) DPAP b) IRDP c) TRYSEM d) DDP",
        " Ans .C",
        ""
    ],
    [
        "Q.27. In Indian economy, the principal means of transportation is",
        "a) airways b) railways c) waterways d) roadways",
        " Ans .B",
        ""
    ],
    [
        "Q.28. Which of the following organizations looks after the credit needs of agriculture and rural development in India?",
        "a) FCI b) IDBI c) NABARD d) ICAR",
        " Ans .C",
        ""
    ],
    [
        "Q.29. Which of the following estimates the National Income in India?",
        "a) Central Statistical Organization b) National Income Committee c) Planning commission d) Reserve Bank of India",
        " Ans .A",
        ""
    ],
    [
        "Q.30. In India which of the following taxes is levied by the state governments?",
        "a) Excise duty on liquor b) Capital gains tax c) Customs tax d) corporation tax",
        " Ans .A",
        ""
    ],
    [
        "Q.31. Which industry employs the largest number of women in India?",
        "a) tea b) textile c) jute d) coal",
        " Ans .A",
        ""
    ],
    [
        "Q.32. Which of the following is not a cash crop?",
        "a) Jute b) groundnut c) jowar d) sugarcane",
        " Ans .C",
        ""
    ],
    [
        "Q.33. An economy is at the take off stage on its path to development when it",
        "a) becomes stagnant b) begins steady growth c) is liberalized d) gets maximum foreign aid",
        " Ans .B",
        ""
    ],
    [
        "Q.34. Which among the following treaties provided for a common currency for the member countries of European Community?",
        "a) Brussels Treaty b) Geneva Convention c) Maastricht Treaty d) Treaty of Versailles",
        " Ans .C",
        ""
    ],
    [
        "Q.35. SEBI stands for",
        "a) Science and Engineering Board of India b) Securities and Exchange Board of India c) Social Equity Bureau of India d) Science and Educational Board of India",
        " Ans .B",
        ""
    ],
    [
        "Q.36. With which of the following lies the basic regulatory authority for mutual funds and stock markets?",
        "a) Reserve bank of India b) Government of India c) SEBI d) Stock Exchanges",
        " Ans .C",
        ""
    ],
    [
        "Q.37. With which aspect of commerce are Bulls and Bears associated?",
        "a) Foreign Trade b) Stock Exchange market c) banking d) international finance",
        " Ans .B",
        ""
    ],
    [
        "Q.38. Which of the following is the basic characteristic of Oligopoly?",
        "a) a few sellers, one buyer b) a few sellers, many buyers c) a few sellers, a few buyers d) many sellers, few buyers",
        " Ans . B",
        ""
    ],
    [
        "Q.39. State Financial Corporations give assistance mainly to develop",
        "a) small and medium scale industries b) agricultural farms c) cotton industry d) large scale industries",
        " Ans .A",
        ""
    ],
    [
        "Q.40. In which of the following fields was the first co-operative movement in India initiated?",
        "a) agricultural credit b) farming activities c) consumer co-operation d) agricultural marketing",
        ""
    ],
    [
        "Q.41. Which of the following taxes is a progressive tax?",
        "a) income tax b) custom tax c) sales tax d) excise duty",
        " Ans .A",
        ""
    ],
    [
        "Q.42. In which year was the policy of population planning adopted by the government of India?",
        "a) 1947 b) 1956 c) 1952 d) 1962",
        " Ans .C",
        ""
    ],
    [
        "Q.43. Which of the following taxes is/are levied by the Union and collected and appropriated by the states?",
        "a) stamp duties b) passenger and good tax c) estate duty d) taxes on newspapers",
        " Ans .A",
        ""
    ],
    [
        "Q.44. The terms TRIPS and TRIMS are related to",
        "a) NAFTA b) SAPTA c) EFTA d) GATT",
        " Ans .D",
        ""
    ],
    [
        "Q.45. In which year was the new liberalized industrial policy announced in India?",
        "a) 1989 b) 1990 c) 1991 d) 1992",
        " Ans .C",
        ""
    ],
    [
        "Q.46. During which Five Year Plan was the annual growth rate of National Income the lowest?",
        "a) second plan b) third plan c) fifth plan d) sixth plan",
        " Ans .B",
        ""
    ],
    [
        "Q.47. Chelliah Committee of 1992 deals with the overhauling of our",
        "a) public sector undertakings b) financial system c) tax system d) patents and copyrights",
        " Ans .C",
        ""
    ],
    [
        "Q.48. Economic planning is an essential feature of",
        "a) capitalist economy b) socialist economy c) mixed economy d) dual economy",
        " Ans .B",
        ""
    ],
    [
        "Q.49. Which among the following is an essential characteristic of mixed economy?",
        "a) co-existence of small scale and large scale industries b) co-existence of private and public sectors c) assigning equal importance to both agriculture and heavy industries d) co-existence of the rich and the poor",
        " Ans .B",
        ""
    ],
    [
        "Q.50. What is the value of goods and services produced in a country within a year called?",
        "a) National income at factor cost b) net national output c) net national product at market prices d) gross national product at market prices",
        " Ans .D",
        ""
    ],
    [
        "Q.51. Which of the following deals with economic offences?",
        "a) MISA b) NSA c) TADA d) COFEPOSA",
        " Ans .D",
        ""
    ],
    [
        "Q.52. In India, inflation is measured by",
        "a) wholesale price index number b) consumer price index for urban non-manual workers c) consumer price index for agricultural workers d) national income deflation",
        " Ans .D",
        ""
    ],
    [
        "Q.53. Which of the following programs meets the credit needs of poor women?",
        "a) Mahila Samriddhi Yojna b) Rashtriya Mahila Kosh c) Indira Mahila Yojna d) Mahila Samakhya Programme",
        " Ans .B",
        ""
    ],
    [
        "Q.54. National income is the",
        "a) Net National Product at Market price b) Net National product at factor coast c) net domestic product at market price d) net domestic product at factor cost",
        " Ans .C",
        ""
    ],
    [
        "Q.55. Which of the following programs aims at the promotion of savings among rural women?",
        "a) Rashtriya Mahila Kosh b) Mahila Samriddhi Yojna c) Indira Mahila Yojna d) Javhar Rozgar Yojna",
        " Ans .B",
        ""
    ],
    [
        "Q.56. Which is the largest commercial bank in India?",
        "a) Reserve Bank of India b) State Bank of India c) ICICI Bank d) Bank of India",
        " Ans .B",
        ""
    ],
    [
        "Q.57. Bank of Hindustan is the oldest bank in India. When did it start functioning?",
        "a) 1990 b) 1770 c) 1885 d) 1892",
        " Ans .B",
        ""
    ],
    [
        "Q.58. The Bank of Calcutta, Bank of Bombay and Bank of Madras were merged in 1921 to form",
        "a) Reserve Bank of India b) Imperial Bank of India c) Bank of India d) Union Bank of India",
        " Ans .B",
        ""
    ],
    [
        "Q.59. When was the Reserve Bank of India established?",
        "a) 1935 b) 1920 c) 1928 d) 1947",
        " Ans .A",
        ""
    ],
    [
        "Q.60. When was the Imperial Bank of India nationalized to form the State Bank of India?",
        "a) 1947 b) 1949 c) 1951 d) 1955",
        " Ans .D",
        ""
    ],
    [
        "Q.61. The Reserve Bank of India was nationalized in?",
        "a) 1947 b) 1948 c) 1950 d) 1956",
        " Ans .B",
        ""
    ],
    [
        "Q.62. What is a Bank which has capital and reserves of over Rs. 5 lakhs called?",
        "a) National Bank b) Cooperative Bank c) Scheduled Bank d) Unscheduled Bank",
        " Ans .C",
        ""
    ],
    [
        "Q.63. The Export-Import (EXIM) Bank was set up in",
        "a) 1982 b) 1983 c) 1987 d) 1985",
        " Ans .A",
        ""
    ],
    [
        "Q.64. Which of the following has the sole right of issuing paper notes in India?",
        "a) Union Government b) Reserve Bank of India c) Ministry of Finance d) Supreme Court",
        " Ans .B",
        ""
    ],
    [
        "Q.65. In India, coins and subsidiary coins are issued by",
        "a) Union Government b) Reserve Bank of India c) Ministry of Finance d) Supreme Court",
        " Ans .C",
        ""
    ],
    [
        "Q.66. Which of the following is entrusted with the task of receiving all money on behalf of the Government as also with the task of making payments on their behalf?",
        "a) State Bank of India b) Reserve Bank of India c) Ministry of Finance d) Union Parliament",
        " Ans .B",
        ""
    ],
    [
        "Q.67. When was the International Monetary Fund (IMF) established?",
        "a) 1944 b) 1945 c) 1948 d) 1950",
        " Ans .A",
        ""
    ],
    [
        "Q.68. Decision taken at Bretton Woods Conference led to the formation of",
        "a) IDA b) IMF c) ADB d) IFC",
        " Ans .B",
        ""
    ],
    [
        "Q.69. The International Bank for Reconstruction and Development (IBRD) is better known as",
        "a) World Bank b) Asian Development Bank c) IMF d) It is known by its name",
        " Ans .A",
        ""
    ],
    [
        "Q.70. Which sister organization of the World Bank provides long term loans at zero interest to the poorest developing countries?",
        "a) Asian Development Bank b) IMF c) International Developmental Association d) International Finance Corporation",
        " Ans .C",
        ""
    ],
    [
        "Q.71. The International Finance Corporation (IFC) was established in?",
        "a) 1956 b) 1972 c) 1985 d) 1960",
        " Ans .A",
        ""
    ],
    [
        "Q.72. Where is the headquarters of Asian Development Bank (ADB) situated?",
        "a) Manila b) Delhi c) Bangkok d) Hong Kong",
        " Ans .A",
        ""
    ],
    [
        "Q.73. Which sister organization of the World Bank helps private activity in developing countries by financing projects with long-term capital in the form of equity and loans?",
        "a) Asian Development Bank b) IMF c) International Developmental Association d) International Finance Corporation",
        " Ans .D",
        ""
    ],
    [
        "Q.74. Who is known as the Father of Economics?",
        "a) Adam Smith b) Chanakya c) Machiavelli d) None of these",
        " Ans .A",
        ""
    ],
    [
        "Q.75. Which was the first Indian Bank to introduce credit card?",
        "a) Central Bank of India d) ICICI",
        " Ans .A",
        ""
    ],
    [
        "Q.76. When did India become a member of the IMF?",
        "a) 1947 b) 1956 c) 1960 d) 1951",
        " Ans .A",
        ""
    ],
    [
        "Q.77. Euro is the currency of European Union. When did it come into being?",
        "a) 1999 b) 1995 c) 2000 d) 2001",
        " Ans .A",
        ""
    ],
    [
        "Q.78. When did the Foreign Exchange Regulation Act (FERA) come into being?",
        "a) 1973 b) 1975 c) 1980 d) 1981",
        " Ans .A",
        ""
    ],
    [
        "Q.79. When did Regional Rural Banks start functioning in India?",
        "a) 1975 b) 1947 c) 1956 d) 1960",
        " Ans .A",
        ""
    ],
    [
        "Q.80. In India, income tax is levied by",
        "a) Union Government b) State Governments c) Ministry of Finance d) RBI",
        " Ans .A"
    ]
]