[
    [
        "Q.1 Distribution of power between Union and state govt policy borrowed from which nation?",
        "Ans: - Canada",
        ""
    ],
    [
        "Q.2 The idea of Single Citizenshiptaken from which country?",
        "Ans: -Britain",
        ""
    ],
    [
        "Q.3 By whichlegislationIndia and Pakistan were divided into two independent nations?",
        "Answer: Indian Independence Act of 1947",
        ""
    ],
    [
        "Q.4 Currently there are how many fundamental rights are recognized by the Indian constitution?",
        "Answer: There are six fundamental rights-",
        ""
    ],
    [
        "Q.5 Indian constitutional rights were inspired by which historical documents?",
        "Answer: Frances Declaration of the Rights of Man and the United States Bill of Rights",
        ""
    ],
    [
        "Q.6 Why 26 November is observed as Indian Constitution Day or Samvidhan Divas?",
        "Answer: Constitution Day which is also known as Samvidhan Divas is celebrated on 26 November each year to commemorate the adoption of Indian Constitution. On this day in 1949 the Constituent Assembly of India adopted the Constitution of India that came into effect on 26 January 1950. Government of India declared 26 November as Constitution Day on November 2015 on an occasion of B. R. Ambedkars birth anniversary.",
        ""
    ],
    [
        "Q.7Who is empowered by the Indian Constitution to appoint the Attorney General of India?",
        "Answer: President of India",
        ""
    ],
    [
        "Q.8 Who is the only person holding the right of appointment of Chief Justice of India?",
        "Answer: President of India",
        ""
    ],
    [
        "Q.9 By which procedure the President of India may be removed before the expiry of the term?",
        "Answer: Impeachment",
        ""
    ],
    [
        "Q.10 Who appoints the Chief Election Commissioner of India?",
        "Answer: President of India",
        ""
    ],
    [
        "Q.11 Who appoints Vice President of India?",
        "Answer: The Electoral College of India",
        ""
    ],
    [
        "Q.12 Who is the inaugural Prime Minister of India?",
        "Answer: Jawaharlal Nehru (1947-1964)",
        ""
    ],
    [
        "Q.13 Who is the first Deputy Prime Minister of India?",
        "Answer: Sardar Vallabhbhai Patel (1947-1950)",
        ""
    ],
    [
        "Q.14 Who is the first President of India?",
        "Answer: Dr. Rajendra Prasad",
        ""
    ],
    [
        "Q.15 Who is the famous writer of Introduction to the Constitution of India?",
        "Answer: Durga Das Basu",
        ""
    ],
    [
        "Q.16 Who said this famous quote that Constitution is not a mere lawyers document, it is a vehicle of Life, and its spirit is always the spirit of Age.?",
        "Answer: Dr. Bhima Rao Ambedkar",
        ""
    ],
    [
        "Q.17 Who was the British Prime Minister during Indias Independence?",
        "Answer: Clement Atlee",
        ""
    ],
    [
        "Q.18 What was the Mountbatten Plan?",
        "Answer: The Mountbatten Plan was an agreement between Lord Mountbatten and Indian National Congress, Muslim League and Sikh community",
        ""
    ],
    [
        "Q.19 Who was the Governor-General during Indias Independence?",
        "Answer: Lord Mountbatten",
        ""
    ],
    [
        "Q.20 Who is empowered to appoint the Judges of Supreme Court?",
        "Answer: President on the advice of the Chief Justice",
        ""
    ],
    [
        "Q.21 Who appoints the members of Council of Ministers?",
        "Answer:President on the advice of the Prime Minister",
        ""
    ],
    [
        "Q.22 Who appoints the Comptroller and Auditor General(CAG)?",
        "Answer:President appoints the Comptroller and Auditor General of India",
        ""
    ],
    [
        "Q.23 Who appoints the Chairman and other members of the UPSC (Union Public Service Commission)?",
        "Answer: President",
        ""
    ],
    [
        "Q.24 Who can proclaim aFinancial Emergency?",
        "Answer:President can proclaim a financial emergency",
        ""
    ],
    [
        "Q.25 How long the National Emergency can be imposed?",
        "Answer:Six months. May be extended by six months on Parliamentary approval.",
        ""
    ],
    [
        "Q.26 When the Preamble of Constitution of India adopted by theconstituent assembly?",
        "Ans: -26th Nov 1949",
        ""
    ],
    [
        "Q.27 How long it took todraftingthe Constitution of India?",
        "Ans: - 2 years 11 months 18 days",
        ""
    ],
    [
        "Q.28 When the last session of the constituent assembly was held?",
        "Answer: 24 January 1950",
        ""
    ],
    [
        "Q.29 Who was the legal advisor to the constitutions Drafting Committee?",
        "Answer: B. N. Rau",
        ""
    ],
    [
        "Q.30 Under which commission the first constituent assembly election was held?",
        "Answer: Cabinet Mission Plan 1946",
        ""
    ],
    [
        "Q.31 How many members were there in Constituent Assembly?",
        "Answer: 389",
        ""
    ],
    [
        "Q.32 Constituent Assembly is based on which structure?",
        "Answer: Unicameral",
        ""
    ],
    [
        "Q.33 Who is regarded as the chief architect of the Indian Constitution?",
        "Ans: B.R.Ambedkar",   
          ],
    [
        "Q.34 When the Constitution of India came into effect on?",
        "Ans:26th Jan 1950",
    ],
    [
        "Q.35 Which day is observed as Republic Day every year?",
        "Ans:26th January",
        ""
    ],
    [
        "Q.36 How long earlier World War II had ended before the Indian Constitution came into effect in 1950?",
        "Answer: World War II had ended 5 years earlier in 1945",
        ""
    ],
    [
        "Q.37 Who was the chairman of the Minorities Committee?",
        "Ans:Harendra Kumar Mukherjee",
        ""
    ],
    [
        "Q.38 Who was elected the president of Constituent Assembly after Sachchidanand Sinha?",
        "Ans:Dr. Rajendra Prasad",
        ""
    ],
    [
        "Q.39 What are the two major languages, the original constitution written in?",
        "Ans: The original constitution written inHindi and English",
           ""
    ],
    [
        "Q.41 Which most important feature made the Indian Constitution unique to any constitution of the world?",
        "Answer: Indian constitution is the only longest written constitution in the world ever",
        ""
    ],
    [
        "Q.42 When Hindi became the Official Language of India?",
        "Answer: The Indian Constitution declared Hindi as the official language in 1950",
        ""
    ],
    [
        "Q.43 When English became the official language of India across Hindi?",
        "Answer: According to the Official Language Act 1963, English became the official language of India in 1965 along with Hindi",
        ""
    ],
    [
        "Q.44 What was the basic structure of the Indian constitution during the time of commencement?",
        "Ans: During the time of commencement there were395 articles, 22 parts, and 8 schedules. The present structure is448 articles, 12 schedules, 5 appendices, and 100 amendmentstill 2015",
        ""
    ],
    [
        "Q.45 Who is the constitutional head of the Indian union?",
        "Answer: President of India",
        ""
    ],
    [
        "Q.46 Constitutionally who is the second powerful person in India?",
        "Answer: Vice-President",
        ""
    ],
    [
        "Q.47 One of thebasic character of the Indian Constitutionis ",
        "Answer: Judicial Review",
        ""
    ],
    [
        "Q.48 What is themajor basic feature of the Indian Constitution?",
        "Answer: Fundamental rights",
        ""
    ],
    [
        "Q.49 When the Sarkaria Commission was set up?",
        "Answer: 1983",
        ""
    ],
    [
        "Q.50 How the Sarkaria Commission is related to Indian Constitution?",
        "Answer: Sarkaria Commission can supervise the required changes of the constitution and the balance of power between state and central governments.Ranjit Singh Sarkaria is the head of this commission",
        ""
    ],
    [
        "Q.51 Directive principles of state policy in the Indian Constitutionhas been adopted from which country?",
        "Ans:Ireland",
        ""
    ],
    [
        "Q.52 What is the objective of Directive Principles of State Policy of the constitution?",
        "Answer: Directive Principles are the guideline to making laws by the government. In part IV of the Indian Constitution, these provisions can be enforced by the courts.",
        ""
    ],
    [
        "Q.53 What is theconstitutional name of India?",
        "Answer: Republic of India",
        ""
    ],
    [
        "Q.54 Which famous Bengali artists have a great contribution indesigning of Indian constitution?",
        "Ans:Nandalal Boseincluding Biochar Rammanohar Sinha",
        ""
    ],
    [
        "Q.55 Thefundamental rights featureborrowed from which nation?",
        "Ans:United States of America",
        ""
    ],
    [
        "Q.56 Who said this famous constitutional quote that Law and order are the medicine of the body politic and when the body politic gets sick, medicine must be administered.",
        "Answer: Dr. Bhima Rao Ambedkar",
        ""
    ],
    [
        "Q.61 Which of the following is not a fundamental right in the Constitution of India?",
        " Ans . Right to work ",
        ""
    ],
    [
        "Q.62 The Panchayath Raj system came in existence by the ____ ?",
        " Ans . 73rd Constitutional Amendment ",
        ""
    ],
    [
        "Q.63 Fundamental Rights have no value without?",
        " Ans . Right to Constitutional Remedies ",
        ""
    ],
    [
        "Q.64 Who certifies a bill as a money bill when it goes to other house or for President's assent?",
        " Ans . Speaker of the House of People ",
        ""
    ],
    [
        "Q.65 Indian citizenship can be acquired by?",
        " Ans . Any of the above ",
        ""
    ],
    [
        "Q.66 District Judges in a State are appointed by the ",
        " Ans . Governor",
        ""
    ],
    [
        "Q.67 According to the provisions of the Constitution, the administrative control (posting, promotion, leave etc.) over the district courts and other subordinate courts, shall be vested in the",
        " Ans . High Court ",
        ""
    ],
    [
        "Q.68 If a stay order has been granted by the High Court in a case, the application of the affected party by such an order shall be disposed of by the High Court within a period of",
        " Ans . Two weeks ",
        ""
    ],
    [
        "Q.69 The power to make rules for the transaction of the business of the Government of Indian and for the allocation of business among Ministers lies with the",
        " Ans . President",
        ""
    ],
    [
        "Q.70 Which Union territory send their members to the Council of States?",
        " Ans . Pondicherry and Delhi "
    ]
]