[
    [
        "Q.1. The National Game of India is",
        "A. Cricket B. Football C. Tennis D. Hockey",
        " Answer:D",
        ""
    ],
    [
        "Q.2. The National Game of Japan is",
        "A. Tennis B. Base ball C. Ice Hockey D. Jujutsu",
        " Answer:D",
        ""
    ],
    [
        "Q.3. Boat race is a famous festival game of",
        "A. Tamil Nadu B. Kerala C. Goa D. Assam",
        " Answer:B",
        ""
    ],
    [
        "Q.4. Famous Tennis player Stefan Edberg belongs to",
        "A. U.K. B. Norway C. Sweden D. Italy",
        " Answer:C",
        ""
    ],
    [
        "Q.5. In the game of Volley ball, the number of players on each side is",
        "A. 8 B. 11 C. 7 D. 6",
        " Answer:D",
        ""
    ],
    [
        "Q.6. Oval stadium in England is associated with",
        "A. polo B. Cricket C. Hockey D. Football",
        " Answer:B",
        ""
    ],
    [
        "Q.7. Karnam Malleswari is associated with",
        "A. Football B. Cricket C. Hockey D. Weight Lifting",
        " Answer:D",
        ""
    ],
    [
        "Q.8. Aparna Popet is associated with",
        "A. Cricket B. Hockey C. Badminton D. Boxing",
        " Answer:C",
        ""
    ],
    [
        "Q.9. 2010 World Cup football tournament was held in",
        "A. Austria B. Germany C. South Africa D. Turin",
        " Answer:C",
        ""
    ],
    [
        "Q.10. Mithir Sen is associated with",
        "A. Hockey B. Swimming C. Volley ball D. Weighlifting",
        " Answer:B",
        ""
    ],
    [
        "Q.11. Worlds most ancient game is",
        "A. Boxing B. Running C. Wrestling D. Swimming",
        " Answer:C",
        ""
    ],
    [
        "Q.12. The first man to swim across the Palk straits is",
        "A. Roger Benister B. Arthur Ashe C. Milkha Singh D. Mihir Sen",
        " Answer:D",
        ""
    ],
    [
        "Q.13. Beighton cup is associated with",
        "A. Foot ball B. Hockey C. Volley ball D. Basket ball",
        " Answer:B",
        ""
    ],
    [
        "Q.14. National stadium is in",
        "A. Kolkata B. Bombay C. Delhi D. Patiala",
        " Answer:B",
        ""
    ],
    [
        "Q.15. The game of hockey originated in",
        "A. France B. Canada C. England D. Germany",
        " Answer:A",
        ""
    ],
    [
        "Q.16. 2010 Commonwealth Games held in",
        "A. Canada B. India C. Britian D. Malaysia",
        " Answer:B",
        ""
    ],
    [
        "Q.17. The termGoogly is associated with",
        "A. Cricket B. Football C. Badminton D. Hockey",
        " Answer:A",
        ""
    ],
    [
        "Q.18. Krishna Poonia is associated with",
        "A. Football B. Hockey C. Chess D. Athletics",
        " Answer:C",
        ""
    ],
    [
        "Q.19. Aga Khan Cup is awarded to",
        "A. International Hockey B. Asian Hockey C. National Hockey in India D. None of these",
        " Answer:C",
        ""
    ],
    [
        "Q.20. In 1924 the first winter Olympics was held in",
        "A. Italy B. France C. Austria D. Canada",
        " Answer:B",
        ""
    ],
    [
        "Q.21. Subroto cup is associated with",
        "A. Cricket B. Football C. Chess D. Golf",
        " Answer:B",
        ""
    ],
    [
        "Q.22. 2014 FIFA World Cup will be held in",
        "A. India B. Brazil C. Germany D. London",
        " Answer:D",
        ""
    ],
    [
        "Q.23. 2010 winter Olympic was held in",
        "A. USA B. Russia C. Vancouver D. Australia",
        " Answer:C",
        ""
    ],
    [
        "Q.24. Wilson Jones is associated with",
        "A. Hockey B. Golf C. Billiards D. Airrace",
        " Answer:C",
        ""
    ],
    [
        "Q.25. The term Slam is associated with",
        "A. Cricket B. Tennis C. Boxing D. Football",
        " Answer:B",
        ""
    ],
    [
        "Q.26. Ranji Trophy is associated with",
        "A. Hockey B. Cricket C. Tennis D. Football",
        " Answer:B",
        ""
    ],
    [
        "Q.27. Iccs 2007, the World Cup Cricket was held in",
        "A. Australia B. West Indies C. New Zealand D. South Africa",
        " Answer:B",
        ""
    ],
    [
        "Q.28. Yankee Stadium in Newyork is associated with",
        "A. Cricket B. Tennis C. Boxing D. Hockey",
        " Answer:C",
        ""
    ],
    [
        "Q.29. The 2008 Olympics was held at",
        "A. London B. Calgary C. Albertville D. Beijing",
        " Answer:D",
        ""
    ],
    [
        "Q.30. Wankhede Stadium is at",
        "A. New Delhi B. Chennai C. Mumbai D. Kolkata",
        " Answer:C",
        ""
    ],
    [
        "Q.31. India first took part in the olympic games in the year?",
        "A. 1920 B. 1928 C. 1972 D. 1974",
        " Answer:A",
        ""
    ],
    [
        "Q.32. Pullela Gopichand is associated with",
        "A. Hockey B. Badminton C. Football D. Cricket",
        " Answer:B",
        ""
    ],
    [
        "Q.33. Sundarrajan Kidambi is associated with",
        "A. Chess B. Cricket C. Athletics D. Hockey",
        " Answer:A",
        ""
    ],
    [
        "Q.34. The ASIAD is held every",
        "A. 3 years B. 4 years C. 5 years D. 6 years",
        " Answer:B",
        ""
    ],
    [
        "Q.35. Who are Kangaroos?",
        "A. Bangladesh B. Kenya C. South Africa D. Australia",
        " Answer:D",
        ""
    ],
    [
        "Q.36. In 2011 India won the World Cup. Who was adjudicated as the man of the series in the tournament?",
        "A. Rahul Dravid B. Zaheer Khan C. Yuvaraj Singh D. Sachin Tendulkar",
        " Answer:C",
        ""
    ],
    [
        "Q.37. The maximum number of Gold medals in Olympics 2008 was won by",
        "A. China B. France C. U.S.A. D. S.Korea",
        " Answer:C",
        ""
    ],
    [
        "Q.38. Viswanath Anand is associated with",
        "A. Chess B. Hockey C. Volley ball D. Carrom",
        " Answer:A",
        ""
    ],
    [
        "Q.39. Kunjarani Devi is associated with",
        "A. Cricket B. Hockey C. Football D. Weight Lifting",
        " Answer:D",
        ""
    ],
    [
        "Q.40. Eden Gardens in Kolkata is  stadium.",
        "A. Tennis B. Cricket C. Polo D. Hockey",
        " Answer:B",
        ""
    ],
    [
        "Q.41. Who is Master Blaster?",
        "A. Rahul Dravid B. Sourav Ganguly C. Irfan Pathan D. Sachin Tendulkar",
        " Answer:D",
        ""
    ],
    [
        "Q.42. The head quarters of International Olympic Committee is at",
        "A. Los Angles B. New York C. Moscow D. Lausanne(Switzerland)",
        " Answer:D",
        ""
    ],
    [
        "Q.43. The term Smasher is associated with",
        "A. Volley ball B. Hockey C. Foot ball D. Boxing",
        " Answer:A",
        ""
    ],
    [
        "Q.44. Santhosh Trophy is associated with",
        "A. Cricket B. Hockey C. Football D. Weightlifting",
        " Answer:C",
        ""
    ],
    [
        "Q.45. First Indian woman to win WTA singles title is",
        "A. Rooth George B. Saina Nehwal C. Saniya Mirza D. Gayathri Krishna",
        " Answer:C",
        ""
    ],
    [
        "Q.46. The 2014 football world cup is scheduled to be held in",
        "A. China B. Brazil C. Japan D. Australia",
        " Answer:B",
        ""
    ],
    [
        "Q.47. How many gold medals won by India in 2010 Commonwealth Games?",
        "A. 30 B. 32 C. 36 D. 38",
        " Answer:D",
        ""
    ],
    [
        "Q.48. Mahesh Bhupathi is associated with",
        "A. Chess B. Cricket C. Lawn Tennis D. Table Tennis",
        " Answer:C",
        ""
    ],
    [
        "Q.49. Ronaldo is associated with",
        "A. Cricket B. Football C. Hockey D. Tennis",
        " Answer:B",
        ""
    ],
    [
        "Q.50. 2009 Davis cup was won by",
        "A. France B. Spain C. US D. Czech Republic",
        " Answer:B "
    ]
]