[
    [
        "Q.1. The National Game of India is",
        "A. Cricket B. Football C. Tennis D. Hockey",
        ""
    ],
    [
        "Q.2. The National Game of Japan is",
        "A. Tennis B. Base ball C. Ice HockeyD. Jujutsu",
        ""
    ],
    [
        "Q.3. Boat race is a famous festival game of",
        "A. Tamil Nadu B. Kerala C. Goa D. Assam",
        ""
    ],
    [
        "Q.4. Famous Tennis player Stefan Edberg belongs to",
        "A. U.K. B. Norway C. Sweden D. Italy",
        ""
    ],
    [
        "Q.5. In the game of Volley ball, the number of players on each side is",
        "A. 8 B. 11 C. 7 D. 6",
        ""
    ],
    [
        "Q.6. Oval stadium in England is associated with",
        "A. polo B. Cricket C. Hockey D. Football",
        ""
    ],
    [
        "Q.7. Karnam Malleswari is associated with",
        "A. Football B. Cricket C. Hockey D. Weight Lifting",
        ""
    ],
    [
        "Q.8. Aparna Popet is associated with",
        "A. Cricket B. Hockey C. Badminton D. Boxing",
        ""
    ],
    [
        "Q.9. 2010 World Cup football tournament was held in",
        "A. Austria B. Germany C. South Africa D. Turin",
        ""
    ],
    [
        "Q.10. Mithir Sen is associated with",
        "A. Hockey B. Swimming C. Volley ball D. Weighlifting",
        ""
    ],
    [
        "Q.11. Worlds most ancient game is",
        "A. Boxing B. Running C. Wrestling D. Swimming",
        ""
    ],
    [
        "Q.12. The first man to swim across the Palk straits is",
        "A. Roger Benister B. Arthur Ashe C. Milkha Singh D. Mihir Sen",
        ""
    ],
    [
        "Q.13. Beighton cup is associated with",
        "A. Foot ball B. Hockey C. Volley ball D. Basket ball",
        ""
    ],
    [
        "Q.14. National stadium is in",
        "A. Kolkata B. Bombay C. Delhi D. Patiala",
        ""
    ],
    [
        "Q.15. The game of hockey originated in",
        "A. France B. Canada C. England D. Germany",
        ""
    ],
    [
        "Q.16. 2010 Commonwealth Games held in",
        "A. Canada B. India C. Britian D. Malaysia",
        ""
    ],
    [
        "Q.17. The termGoogly is associated with",
        "A. Cricket B. Football C. Badminton D. Hockey",
        ""
    ],
    [
        "Q.18. Krishna Poonia is associated with",
        "A. Football B. Hockey C. Chess D. Athletics",
        " Ans . D",
        ""
    ],
    [
        "Q.19. Aga Khan Cup is awarded to",
        "A. International Hockey B. Asian Hockey C. National Hockey in India D. None of these",
        ""
    ],
    [
        "Q.20. In 1924 the first winter Olympics was held in",
        "A. Italy B. France C. Austria D. Canada",
        ""
    ],
    [
        "Q.21. Subroto cup is associated with",
        "A. Cricket B. Football C. Chess D. Golf",
        ""
    ],
    [
        "Q.22. 2014 FIFA World Cup will be held in",
        "A. India B. Brazil C. Germany D. London",
        ""
    ],
    [
        "Q.23. 2010 winter Olympic was held in",
        "A. USA B. Russia C. Vancouver D. Australia",
        ""
    ],
    [
        "Q.24. Wilson Jones is associated with",
        "A. Hockey B. Golf C. Billiards D. Airrace",
        ""
    ],
    [
        "Q.25. The term Slam is associated with",
        "A. Cricket B. Tennis C. Boxing D. Football",
        ""
    ],
    [
        "Q.26. Ranji Trophy is associated with",
        "A. Hockey B. Cricket C. Tennis D. Football",
        ""
    ],
    [
        "Q.27. Iccs 2007, the World Cup Cricket was held in",
        "A. Australia B. West Indies C. New Zealand D. South Africa",
        ""
    ],
    [
        "Q.28. Yankee Stadium in Newyork is associated with",
        "A. Cricket B. Tennis C. Boxing D. Hockey",
        ""
    ],
    [
        "Q.29. The 2008 Olympics was held at",
        "A. London B. Calgary C. Albertville D. Beijing",
        ""
    ],
    [
        "Q.30. Wankhede Stadium is at",
        "A. New Delhi B. Chennai C. Mumbai D. Kolkata",
        ""
    ],
    [
        "Q.31. India first took part in the olympic games in the year?",
        "A. 1920 B. 1928 C. 1972 D. 1974",
        ""
    ],
    [
        "Q.32. Pullela Gopichand is associated with",
        "A. Hockey B. Badminton C. Football D. Cricket",
        ""
    ],
    [
        "Q.33. Sundarrajan Kidambi is associated with",
        "A. Chess B. Cricket C. Athletics D. Hockey",
        ""
    ],
    [
        "Q.34. The ASIAD is held every",
        "A. 3 years B. 4 years C. 5 years D. 6 years",
        ""
    ],
    [
        "Q.35. Who are Kangaroos?",
        "A. Bangladesh B. Kenya C. South Africa D. Australia",
        ""
    ],
    [
        "Q.36. In 2011 India won the World Cup. Who was adjudicated as the man of the series in the tournament?",
        "A. Rahul Dravid B. Zaheer Khan C. Yuvaraj Singh D. Sachin Tendulkar",
        ""
    ],
    [
        "Q.37. The maximum number of Gold medals in Olympics 2008 was won by",
        "A. China B. France C. U.S.A. D. S.Korea",
        ""
    ],
    [
        "Q.38. Viswanath Anand is associated with",
        "A. Chess B. Hockey C. Volley ball D. Carrom",
        ""
    ],
    [
        "Q.39. Kunjarani Devi is associated with",
        "A. Cricket B. Hockey C. Football D. Weight Lifting",
        ""
    ],
    [
        "Q.40. Eden Gardens in Kolkata is  stadium.",
        "A. Tennis B. Cricket C. Polo D. Hockey",
        ""
    ],
    [
        "Q.41. Who is Master Blaster?",
        "A. Rahul Dravid B. Sourav Ganguly C. Irfan Pathan D. Sachin Tendulkar",
        ""
    ],
    [
        "Q.42. The head quarters of International Olympic Committee is at",
        "A. Los Angles B. New York C. Moscow D. Lausanne(Switzerland)",
        ""
    ],
    [
        "Q.43. The term Smasher is associated with",
        "A. Volley ball B. Hockey C. Foot ball D. Boxing",
        ""
    ],
    [
        "Q.44. Santhosh Trophy is associated with",
        "A. Cricket B. Hockey C. Football D. Weightlifting",
        ""
    ],
    [
        "Q.45. First Indian woman to win WTA singles title is",
        "A. Rooth George B. Saina Nehwal C. Saniya Mirza D. Gayathri Krishna",
        ""
    ],
    [
        "Q.46. The 2014 football world cup is scheduled to be held in",
        "A. China B. Brazil C. Japan D. Australia",
        ""
    ],
    [
        "Q.47. How many gold medals won by India in 2010 Commonwealth Games?",
        "A. 30 B. 32 C. 36 D. 38",
        ""
    ],
    [
        "Q.48. Mahesh Bhupathi is associated with",
        "A. Chess B. Cricket C. Lawn Tennis D. Table Tennis",
        ""
    ],
    [
        "Q.49. Ronaldo is associated with",
        "A. Cricket B. Football C. Hockey D. Tennis",
        ""
    ],
    [
        "Q.50. 2009 Davis cup was won by",
        "A. France B. Spain C. US D. Czech Republic",
        ""
    ],
    [
        "Q.51. The Commonwealth completed its 50 years in  ",
        "A. September 1999  B. Octomber 1999  C. November 1999  D. December 1999",
],
    [
        "Q.53. Anita Sood is associated with which of the following games/sport?  ",
        "A. Hockey  B. Swimming  C. Table Tennis  D. Badminton",
        ""
    ],
    [
        "Q.54. Which of the following is a pair of names of the same game?  ",
        "A. BilliardsSnooker  B. Golfpolo  C. SoccerFootball  D. VolleyballSquash",
    ],
    [
        "Q.56. Who among the following is known as Best Asian Woman Athlete?  ",
        "A. K. Saramma  B. Vandana Rao  C. Mercy Kuttan  D. P.T. Usha",
        ""
    ],
    [
        "Q.57. How many players are there in a water polo team?  ",
        "A. 5  B. 6  C. 7  D. 9",
    ],
    [
        "Q.59. The Asian Games have been held in NewDelhi?  ",
        "A. Once  B. Twice  C. Thrice  D. Four Times",
        ""
    ],
    [
        "Q.60. 13th Asian Games were held in  ",
        "A. Singapore  B. Manila  C. Hong Kong  D. Bangkok",
        ""
    ],
    [
        "Q.61. The 19th Commonwealth Games will be held in 2010 in  ",
        "A. Jaipur  B. Kolkata  C. New Delhi  D. Mumbai",
    ],
    [
        "Q.63. When was first International test match organized?  ",
        "A. 1877  B. 1885  C. 1890  D. 1895",
        ""
    ],
    [
        "Q.64. Parimarjan Negi has excelled in which one of the following games?  ",
        "A. Billiards  B. Swimming  C. Chess  D. Weightlifting",
        ""
    ],
    [
        "Q.65. The first Asian Games were held in  ",
        "A. China  B. India  C. Pakistan  D. Iran",
        ""
    ],
    [
        "Q.66. When was first International One Day match organized?  ",
        "A. 1877  B. 1871  C. 1888  D. 1890",
    ],
    [
        "Q.69. In how many ways can a batsman be out in cricket?  ",
        "A. 10  B. 7  C. 9  D. 8",
        ""
    ],
    [
        "Q.70. What is the middle name of the world class batsman Sachin Tendulkar?  ",
        "A. Rohan  B. Ramesh  C. Rahul  D. Ravi",
    ],
    [
        "Q.72. India won the last Hockey Olympic Gold in?  ",
        "A. 2000, Sydney  B. 1996, Atlanta  C. 1980, Moscow  D. 1972, Munich",
        ""
    ],
    [
        "Q.73. For which sports is the Val Barker Cup awarded in the Olympic games?  ",
        "A. Swimming  B. Boxing  C. Long Jump  D. High Jump",
        ""
    ],
    [
        "Q.74. Which Indian batsman made three consecutive centures in his first three test matches?  ",
        "A. Vinoo Mankad  B. GR Vishwanath  C. Mohd. Azharuddin  D. Sm Gavaskar",
        ""
    ],
    [
        "Q.75. What is the total no. of the teams taking part in Ranji Trophy?  ",
        "A.25  B.22  C.28  D.29",
    ],
    [
        "Q.77. Which team did Sachin Tendulkar play for in the Ranji Trophy when he made his debut in first class cricket?  ",
        "A. Karnataka  B. Delhi  C. Mumbai  D. Kerala",
        ""
    ],
    [
        "Q.78. How many power play are used in One Day International Cricket?  ",
        "A. 2  B. 1  C. 3  D. 4",
        ""
    ],
    [
        "Q.79. The number of umpires required conducting a international cricket match?  ",
        "A. 2  B. 3  C. 4  D. 5",
    ],
    [
        "Q.81. What can be the maximum length of a cricket bat? ",
        "A. 32  B. 34  C. 36  D. 38",
        ""
    ],
    [
        "Q.82. Which of these international tennis events is palyed on a grass court?  ",
        "A. US Open  B. FrenchOpen  C. Wimbeldon  D. AustralianOpen",
        ""
    ],
    [
        "Q.83. How many players are there in a Kabbadi Team?  ",
        "A. 5  B. 7  C. 9  D. 11",
        ""
    ],
    [
        "Q.84. Which of the following countries has never been the venue of Asian games?  ",
        "A. China  B. Iran  C. Pakistan  D. Indonesia",
    ],
    [
        "Q.86. The winter Olympics came into being in  ",
        "A. 1924  B. 1920  C. 1916  D. 1912",
        ""
    ],
    [
        "Q.87. Which Indian Cricketer was given the title Tiger?  ",
        "A. Sachin Tendulukar  B. Sunil Gavaskar  C. B.S. Bedi  D. Mansur Ali Khan Pataudi",
        ""
    ],
    [
        "Q.88. The 1996 Olympics are proposed to be held at  ",
        "A. Atlanta  B. Tokyo  C. Melbourne  D. Manchester",
    ],
    [
        "Q.90. Leander Paes is associated with  ",
        "A. Cricket  B. Tennis  C. Badminton  D. Football",
        ""
    ],
    [
        "Q.91. The term Tee is connected with  ",
        "A. Bridge  B. Polo  C. Golf  D. Billiards",
        ""
    ],
    [
        "Q.92. In which city the Asian Games first took place?  ",
        "A. Tokyo  B. New Delhi  C. Beijing  D. Kuala Lumpur",
        ""
    ],
    [
        "Q.93. Who was the first captain of Indian Test team?  ",
        "A. Vijay Hazare  B. C K Nayudu  C. Lala Amarnath  D. Vijay Merchant",
        ""
    ],
    [
        "Q.94. Which player has scored the most runs in a single Test innings  ",
        "A. Graham Gooch  B. Matthew Hayden  C. Brian Lara  D. Agarkar",
    ],
    [
        "Q.96. Length of cricket pitch is  ",
        "A. 22 yards  B. 21 yards  C. 20 yards  D. 12 yards",
        ""
    ],
    [
        "Q.97. What was the name of first world cup?  ",
        "A. Wills world cup  B. ICC world cup  C. Pepsi world cup  D. Prudential cup",
    ],
    [
        "Q.99. Who has taken maximum wickets in one day internationals ?  ",
        "A. Shane Warne  B. Mutthiah Muralitharan  C. Kapil Dev  D. Wasim Akram",
        ""
    ],
    [
        "Q.100. Who is the Prince of Calcutta?  ",
        "A. Pankaj Roy  B. Ambar Roy  C. Sourav Ganguly  D. Rohan Gavaskar",
        ""
    ],
    [
        "Q.101. Who are Kangaroos?  ",
        "A. Australia  B. Bangladesh  C. Kenya  D. Namibia",
        ""
    ],
    [
        "Q.102. Which of these countries won the first world cup tounnament in 1975?  ",
        "A. England  B. Australia  C. West Indies  D. Pakistan",
        ""
    ],
    [
        "Q.103. The first Asian Games were held in  ",
        "A. China  B. India  C. Pakistan  D. Iran",
    ],
    [
        "Q.105. The winter olympic came into being in  ",
        "A. 1912  B. 1916  C. 1920  D. 1924",
        ""
    ],
    [
        "Q.106. Who was the captain of the Indian team for Twenty20 World Cup 2007?  ",
        "A. Sachin Tendulekar  B. M.S. Dhoni  C. Saurav Gangully  D. Rahul Dravid",
        ""
    ],
    [
        "Q.107. The term Auxiliary point system upper cut and punch are associated with  ",
        "A. Cricket  B. Football  C. Hockey  D. Boxing",
    ],
    [
        "Q.109. Which of the following terms is associated with chess?  ",
        "A. Pitcher  B. Deuce  C. Vulnerable  D. Gambit",
        ""
    ],
    [
        "Q.110. Tripping is associated with  ",
        "A. Hockey  B. Foot ball  C. Snooker  D. Cricket",
        ""
    ],
    [
        "Q.111. The Asian Games are organized after every  ",
        "A. 3 years  B. 4 years  C. 5 years  D. 6 years",
        ""
    ],
    [
        "Q.112. Which one of the following is full form of ICC?  ",
        "A. International Cricket Council  B. Indian Cricket Council  C. International Cost Camp  D. Indian Coast Cup",
        ""
    ],
    [
        "Q.113. The 2014 football world cup is scheduled to be held in  ",
        "A.China  B.Australia  C.Japan  D.Brazil",
    ],
    [
        "Q.115. Who was the first president of BCCI ?  ",
        "A. R.E. Grant Govan  B. Dr.Maharajkumar Sir Vijaya Ananda  C. Sikandar Hyat Khan  D. Anthony S. DMello",
        ""
    ],
    [
        "Q.116. The first World Cup in cricket was held in  ",
        "A. 1975  B. 1976  C. 1983  D. 1980",
        ""
    ],
    [
        "Q.117. What is the middle name of Sourav Ganguly?  ",
        "A. Chandidas  B. Mohandas  C. Chandradas  D. Tarwadi",
        ""
    ],
    [
        "Q.118. Which country won the World Cup in 2007?  ",
        "A. Australia  B. South Africa  C. Pakistan  D. India",
        ""
    ],
    [
        "Q.119. Which Indian batsman was the first to hit 44 fours in a test match innings?  ",
        "A. Tendulkar  B. Gavaskar  C. Ganguly  D. Laxman",
        ""
    ],
    [
        "Q.120. India first won the Olympic hockey gold at  ",
        "A. London  B. Berlin  C. Amsterdam  D. Los Angeles"
    ]
]