[
    [
        "Q.1 Which is claimed to be the coldest place in Asia?",
        " Ans .Dras",
        ""
    ],
    [
        "Q.2 The oldest functioning hotel in Asia?",
        " Ans .The Great Eastern Hotel, Kolkata.",
        ""
    ],
    [
        "Q.3 Where is Asias longest and highest ropeway?.",
        " Ans .Auli, Garhwal, Himalayas",
        ""
    ],
    [
        "Q.4 What is the river Ganga called in Bangladesh?",
        " Ans .Padma",
        ""
    ],
    [
        "Q.5 Pakistan has borders with two countries of Asia. Which are they?",
        " Ans .Afghanistan and India",
        ""
    ],
    [
        "Q.6 Most of which country is occupied by the Anatolian plateau/",
        " Ans .Turkey",
        ""
    ],
    [
        "Q.7 In which important city is Jeddah the port?",
        " Ans .Mecca",
        ""
    ],
    [
        "Q.8 Most of the Russian Republics in Asia comprise which well-known geographical area?",
        " Ans .Siberia",
        ""
    ],
    [
        "Q.9 Which is the legendary Pass which links pakistan with Afganistan?",
        " Ans .Khyber Pass",
        ""
    ],
    [
        "Q.10 The largest republic of Russia in Asia:",
        " Ans .Kazakh Republic",
        ""
    ],
    [
        "Q.11 in which country is Nagev Dessert located?",
        " Ans .Israel.",
        ""
    ],
    [
        "Q.12 The Mesapotamua is now clled",
        " Ans .Iraq",
        ""
    ],
    [
        "Q.13 Which Mediterranean island is considered an independent Asian country?",
        " Ans .Cyprus",
        ""
    ],
    [
        "Q.14 The famous island in the Arabian Sea is a part of yeman. Which island?",
        " Ans .Sacotra",
        ""
    ],
    [
        "Q.15 The UAE separates two parts of a country. Which country?",
        " Ans .Oman",
        ""
    ],
    [
        "Q.16 Mangolias great desert is called",
        " Ans .Gopi Desert",
        ""
    ],
    [
        "Q.17 Which is the longest river in Asia?",
        " Ans .yangtse",
        ""
    ],
    [
        "Q.18 Which rivers fertile delta in south China is known as the land of fish, rice and fruit?",
        " Ans .The pearl river",
        ""
    ],
    [
        "Q.19 What is continental shelf?",
        " Ans . It is a region at the edge of a continent extending from the shore line to the first steeping of the continental slope.",
        ""
    ],
    [
        "Q.20 What is Continental rise?",
        " Ans . It is the gently sloping region that lies on the seaward side of the continental slope and extends down to the Abyssal plain.",
        ""
    ],
    [
        "Q.21 What is continental divide?",
        " Ans . It is the high region of a continent which separate streams flowing to opposite sides of the continent and ultimately, in some cases, into separate oceans.",
        ""
    ],
    [
        "Q.22 Who published the Theory of continental Drift?",
        " Ans . German meterologist Alfred Wegener in 1915.",
        ""
    ],
    [
        "Q.23 What divides Asia from North America?",
        " Ans . Berring Strait.",
        ""
    ],
    [
        "Q.24 Which is the longest river in Asia?",
        " Ans . The Yangtze (4345 km) in China",
        ""
    ],
    [
        "Q.25 Which is the second largest country in terms of population?",
        " Ans . India",
        ""
    ],
    [
        "Q.26 Worlds most destructive earthquake occurred in which country?.",
        " Ans . Japan in 1923",
        ""
    ],
    [
        "Q.27 Which country is the third largest producer of electric energy?",
        " Ans . japan",
        ""
    ],
    [
        "Q.28 Where is the worlds largest Sea port?",
        " Ans .Singapore",
        ""
    ],
    [
        "Q.29 What is erosion?.",
        " Ans . Gradual wearing away of portions of earths surface by rain, snow and wind",
        ""
    ],
    [
        "Q.30 What is horizon?",
        " Ans . The circular line where the sky and the earth or sea appear to meet.",
        ""
    ],
    [
        "Q.31 What is the difference between Isobars and Isotherms?",
        " Ans . Isobars are lines on a map joining those places whch have the same barometric pressure. Isothrms are lines on a map joining those places which have the same mean temperature.",
        ""
    ],
    [
        "Q.32 What is a Continent?.",
        " Ans . A Continent is a major land mass including both the region of dry land abovve sea level and the continental shelf. 29% of the surface of the Earth is made up of continents"
    ]
]