[
    [
        "1. The main purpose of Brahmo Samaj for which it was set up are",
        "A. Purify Hinduism and to preach monotheism",
        "B. Criticize social evils, oppose idolatry and emphasize human dignity",
        "C. Both A and B",
        "D. None of the above",
        "Answer: Option C ",
        ""
    ],
    [
        "2. Maharishi Dayanand Saraswati was an important Hindu religious scholar, reformer, and founder of the __________",
        "A. Arya Samaj",
        "B. Brahma Samaj",
        "C. Ramakrishna Mission",
        "D. Theosophical society",
        "Answer: Option A ",
        ""
    ],
    [
        "3. I. Raja Ram Mohan Roy established the \"Calcutta Unitarian Committee\".II. Social Service League was established by Mahadeo Govind Ranade.III. Deccan Education Society was founded by Gopal Krishna Gokhale.IV. Annie Besant started the Central Hindu School.Which of the above statement(s) is/are correct with reference to the reformers & leaders of India's Struggle for Independence?",
        "A. I, II &amp; IV",
        "B. I &amp; IV",
        "C. II &amp; III",
        "D. III Only",
        "Answer: Option B ",
        ""
    ],
    [
        "4. Where was the Devdasi System prevailed in India?",
        "A. Southern India",
        "B. Northern India",
        "C. East India",
        "D. WestIndia",
        "Answer: Option A ",
        ""
    ],
    [
        "5. Swami Dayananda had translated the __________ into Hindi",
        "A. Rig Veda and Yajur Veda",
        "B. Four Vedas",
        "C. Sama Veda and Atharva Veda",
        "D. Sama Veda and Yajur Veda",
        "Answer: Option A ",
        ""
    ],
    [
        "6. Shree Narayana Guru was a great socio-religious reformer of",
        "A. Kerala",
        "B. Tamil Nadu",
        "C. Andhra Pradesh",
        "D. Karnataka",
        "Answer: Option A ",
        ""
    ],
    [
        "7. Who founded the Sri Narayana Dharma Paripalana Yogam?",
        "A. Daya Nand Saraswati",
        "B. Periyar Swami",
        "C. Narayan Guru",
        "D. Gopal Hari Deshmukh",
        "Answer: Option C ",
        ""
    ],
    [
        "8. What was the main inspiration for establishing Theosophical Society?",
        "A. Tackling zamindars issue",
        "B. Women's education and their upliftment",
        "C. Propagate Indian thought and culture there by revival of ancient religions of Hinduism, Zoroastrianism and Buddhism",
        "D. Work for depressed classes",
        "Answer: Option C ",
        ""
    ],
    [
        "9. Who wrote the book 'A Gift to monotheists'?",
        "A. David Hare",
        "B. Raja Ram Mohan Roy",
        "C. Mahadev Govind Ranade",
        "D. Ramkrishna Bhandarkar",
        "Answer: Option B ",
        ""
    ],
    [
        "10. Sri Narayana Guru was born into an __________ family",
        "A. Ezhava",
        "B. Nayar",
        "C. Pulaya",
        "D. Vannan",
        "Answer: Option A",
        ""
    ],
    [
        "11. Theosophical society was started by whom and where, initially?",
        "A. A.O Hume in India",
        "B. Blavatsky and Olcott in united states",
        "C. M.G Ranade in India",
        "D. Mahatma Gandhi in South Africa",
        "Answer: Option B ",
        ""
    ],
    [
        "12. Which of the contributions of Ishwar Chandra Vidya Sagar made him true follower of Raja Rammohan Roy and in a way most common aspects in both of themI. Protest against child marriageII. Advocacy of widow remarriageIII. Campaign against polygamy",
        "A. I and II",
        "B. I and III",
        "C. II and III",
        "D. I, II and III",
        "Answer: Option D ",
        ""
    ],
    [
        "13. Which of the following were the main aims of Satyashodhak Samaj?I. Social serviceII. Spread of education among women and lower casteIII. Complete abolition of caste system and inequalities",
        "A. Only II",
        "B. I and II",
        "C. II and III",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "14. Sathya Shodak Samaj also called truth seekers society was started by which of the following reformers?",
        "A. Gopal Krishna Gokhale",
        "B. Jyotiba Phule",
        "C. Dayananda Saraswathi",
        "D. Shiv Narain Agnihotri",
        "Answer: Option B ",
        ""
    ],
    [
        "15. When was the Hindu College, Calcutta established?",
        "A. 1829",
        "B. 1817",
        "C. 1858",
        "D. 1853",
        "Answer: Option B",
        ""
    ],
    [
        "16. Social reforms were a major task of the theosophical society. With respect to Indian traditions and culture, which one does not find its occurrence in the societal activities?I. Resistance to child marriage.II. Resistance to widow remarriage.III. Spread of education.IV. Abolition of caste and Untouchability.V. Accommodation of conversion in religious faith.",
        "A. I and III",
        "B. II and IV",
        "C. II, V",
        "D. Only V",
        "Answer: Option C ",
        ""
    ],
    [
        "17. Which of the following is not correct about Prarthana Samaj?",
        "A. The Prarthana Samaj was founded in Bombay in1867",
        "B. ThePrarthana Samaj was founded by Athmaram panduranga (with the help of Keshav Chandra Sen)",
        "C. The main aim behind the establishment of the Prarthana Samaj was to make people believe in one God and worship only one God",
        "D. This society was against the widow remarriage",
        "Answer: Option D ",
        ""
    ],
    [
        "18. Which of the following statements regarding Ahmadiya Movement is/are correct?I. Founded by Mirza Ghulam AhmedII. It described itself as standard bearer of Mohammedan RenaissanceIII. Based itself on the principles of Brahmo SamajIV. Opposed jihad and worked for spreading western liberal education among Indian Muslims",
        "A. Only I and II",
        "B. Only I and IV",
        "C. Only I, II and IV",
        "D. All of the above are correct",
        "Answer: Option D ",
        ""
    ],
    [
        "19. Gurudevan participated in the anniversary of the Sree Narayana Dharma Paripalana Yogam held at Palluruthy in__________",
        "A. 1913",
        "B. 1917",
        "C. 1927",
        "D. 1948",
        "Answer: Option C ",
        ""
    ],
    [
        "20. The following are the lessons taught to masses i.e. Muslim women in particular",
        "A. Urged the Muslims to give up medieval customs and ways of thought and behavior",
        "B. Removal of purdah and spread of education",
        "C. Both A and B",
        "D. None of the above",
        "Answer: Option C ",
        ""
    ],
    [
        "21. Consider the following statements related to the cause of 1857 revolt.I. It was a great disparity in salaries between the Indian and European soldiers.II. The Indian sepoys were treated with contempt by their European officers.III. The sepoys were sent to distant parts of the empire, but were not paid any extra allowance.",
        "A. Only I",
        "B. Only II",
        "C. Both I and II",
        "D. I, II and III",
        "Answer: Option D ",
        ""
    ],
    [
        "22. Which of the following ideas propagated through Ramakrishna Mission?I. Social and religious reformII. Women educationIII. Doctrine of serviceIV. Service of jiva and worship of Shiva",
        "A. Both I and II",
        "B. II, III and IV",
        "C. III and IV",
        "D. I, III and IV",
        "Answer: Option D ",
        ""
    ],
    [
        "23. Consider the following statement (s) related to the administrative causes of 1857 revolt.I. Deprivation of the traditional ruling classes of their luxury due to the establishment of the company's suzerainty over the Indian states.II. Introduction of new and revenue system which snatched the land from cultivator and gave it to the moneylender or traitor.III. Lord Canning's announcement to that Mughals would lose the title of King and be mere Princess.",
        "A. Only I",
        "B. Only II",
        "C. Both I and II",
        "D. Both I and III",
        "Answer: Option C ",
        ""
    ],
    [
        "24. Which of the following cannot be said to be a cardinal principle of the theosophical society?",
        "A. It questioned the ancient philosophies that dominated the Indian thinking",
        "B. Aimed Hindu spiritual wisdom through western enlightenment",
        "C. It believed in the existence of unique connections between god and every being",
        "D. It believed in the possibility of reincarnation and karma",
        "Answer: Option A ",
        ""
    ],
    [
        "25. Which of the following is called \"Magna Carta of English Education in India\"?",
        "A. Wood's Dispatch",
        "B. Macaulay Commission",
        "C. Vernacular Act",
        "D. Both A &amp; B",
        "Answer: Option A ",
        ""
    ],
    [
        "26. Which of the following is considered as the main reason for division of Brahmo Samaj?",
        "A. Resolutely opposing Christian missionaries and their work against Hinduism",
        "B. Internal conflicts among Debendranath Tagore and Keshub Chandra Sen for including teachings of all religions",
        "C. Lack of strong propagator of views",
        "D. Opposition by people for disturbing traditional caste practices like abolition of sati, widow remarriage and women education",
        "Answer: Option B ",
        ""
    ],
    [
        "27. Who among the following is the great disciple of Ramakrishna Paramahamsa and helped in spreading the message that there are many roads to god and salvation and service of god for man was embodiment of god?",
        "A. Raja Rammohan Roy",
        "B. Swami Vivekananda",
        "C. Swami Dayananda Saraswati",
        "D. Annie Besant",
        "Answer: Option B ",
        ""
    ],
    [
        "28. Who was the founder of Satyashodhak Samaj?",
        "A. Jyotiba Phule",
        "B. Gopal Hari Deshmukh",
        "C. Mahadew Govind Ranade",
        "D. Ramakrishna Bhandarkar",
        "Answer: Option A ",
        ""
    ],
    [
        "29. The actual name of Dayanand Saraawati, the founder of the Arya Samaj was",
        "A. Daya Shankar",
        "B. Mula Shankar",
        "C. Virjanand",
        "D. Mool Chandra",
        "Answer: Option B ",
        ""
    ],
    [
        "30. Wahabi movement aimed to organize Muslims around two fold ideas, which of the following forms the ideas among them?I. Harmony among 4 schools of Muslim which were divided at that timeII. Recognition of the role of individual conscience in religion as conflicting interpretations were derived from quran and other practices",
        "A. Only I",
        "B. Only II",
        "C. Both I and II",
        "D. None of the above stated",
        "Answer: Option C ",
        ""
    ],
    [
        "31. Who is the author of the book \"Satyarth Prakash\"?",
        "A. Dayanand Saraswati",
        "B. Rajaram Mohan Ray",
        "C. Mahadev Govind Ranade",
        "D. Ramakrishna Bhandarkar",
        "Answer: Option A ",
        ""
    ],
    [
        "32. Satyashodhak Samaj was founded by whom?",
        "A. Mahatma Gandhi",
        "B. Jyotibha Phule",
        "C. Dr. B. R. Ambedkar",
        "D. Swami Vivekanand",
        "Answer: Option B ",
        ""
    ],
    [
        "33. What was the role of Tatia Tope in 1857 mutiny?I. He was commander-in-chief of the army of Nana SahebII. He organized Bhils of Panchamahal region against the BritishIII. He helped Begum Hazrat Mahal to capture Awadh",
        "A. II only",
        "B. I and II only",
        "C. II and III only",
        "D. All of the above",
        "Answer: Option B ",
        ""
    ],
    [
        "34. The first lawful Hindu widow remarriage among upper castes in our country was celebrated under which of the following reformer",
        "A. Raja Rammohan Roy",
        "B. Keshub Chandra Sen",
        "C. Ishwar Chandra Vidyasagar",
        "D. Gopal Krishna Gokhale",
        "Answer: Option C ",
        ""
    ],
    [
        "35. Faraizi Movement which aimed at removing social reforms in muslims started in which of the following regions?",
        "A. East Bengal",
        "B. Madhya Pradesh",
        "C. Kerala",
        "D. Delhi",
        "Answer: Option A ",
        ""
    ],
    [
        "36. Titu mir's movement considered one of the Muslim reform movement mainly aimed at eradicating which of the following systems?",
        "A. Polygamy",
        "B. Against Hindu landlords and British indigo planters",
        "C. Easy divorce",
        "D. Working against Indian national movement",
        "Answer: Option B ",
        ""
    ],
    [
        "37. The \"Arya Samaj\" was founded by",
        "A. Swami Dayananda Saraswati",
        "B. Swami Vivekananda",
        "C. Keshav Chandra Sen",
        "D. Ishwar Chandra VidyaSagar",
        "Answer: Option A ",
        ""
    ],
    [
        "38. Dayananda was born on February 12 in 1824, in the town of Tankara, near Morvi (Morbi) in the Kathiawar region of the princely state of__________",
        "A. Assam",
        "B. Uttar Pradesh",
        "C. Bihar",
        "D. Gujarat",
        "Answer: Option D ",
        ""
    ],
    [
        "39. Which of the following act was the revision of Vernacular Act?",
        "A. Indian Press act, 1910",
        "B. Newspaper Act, 1908",
        "C. Both A &amp; B",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "40. Who established Prarthna Samaj?",
        "A. Ishwar Chandra Vidya Sagar",
        "B. Derozio",
        "C. David Hare",
        "D. Athmaram Panduranga with the help of Keshav Chandra Sen",
        "Answer: Option D ",
        ""
    ],
    [
        "41. The Servants of Indian Society started by Gopal Krishna Gokhale was set up with which of the following objectives?",
        "A. Prepare masses for selfless cause of country and devote their lives if needed",
        "B. Train national missionaries for the service of country",
        "C. Both the above statement",
        "D. Reorganization of Indian society on rational principles",
        "Answer: Option C ",
        ""
    ],
    [
        "42. Who is called the \"Lokhitwadi\"?",
        "A. Dayanand saraswati",
        "B. Gopal Hari Deshmukh",
        "C. Mahadev Govend Ranade",
        "D. Mul Sankara",
        "Answer: Option B ",
        ""
    ],
    [
        "43. Raja Rammohan Roy organised a historic agitation against the",
        "A. Caste system",
        "B. Evil custom of sati",
        "C. Degrading position of women in society",
        "D. Practice of superfluous religious rituals",
        "Answer: Option B ",
        ""
    ],
    [
        "44. What did Jyotiba Phule's Satyashodhak Samaj attempt in the last century?",
        "A. Saving the lower castes from hypocriticalBrahmans and their opportunistic scriptures",
        "B. Attacking the caste system",
        "C. Led an antilandlord and antimahajan upsurgein Satara",
        "D. Seperate representation for untouchables",
        "Answer: Option A ",
        ""
    ],
    [
        "45. The Arya Samaj Movement had been started by",
        "A. Swami Dayanand",
        "B. Devendranath Tagore",
        "C. Swami Vivekananda",
        "D. Keshub Chandra Sen",
        "Answer: Option A",
        ""
    ],
    [
        "46. Which of the following are the reasons for which Wahabi / Walliullah movement was started?",
        "A. Spreading education among Muslim women",
        "B. Encouraging to give up puradh system",
        "C. Reviving Muslim principles in response to western influences",
        "D. Propagating Quran as the only source",
        "Answer: Option C ",
        ""
    ],
    [
        "47. What was the original name of Dayananda Saraswati?",
        "A. Malku das",
        "B. Mul Shankara",
        "C. Narendra",
        "D. Dadu",
        "Answer: Option B ",
        ""
    ],
    [
        "48. Which of the following is/are the main aim/s of Young Bengal Movement?",
        "A. Inspire pupil to think freely and rationally",
        "B. Question all authority and oppose decadent customs and traditions",
        "C. Love liberty, equality and freedom",
        "D. All the above",
        "Answer: Option D ",
        ""
    ],
    [
        "49. Temple entry movement started mainly in Kerala aimed at which of the following",
        "A. Allowing untouchables to Hindu temples and roads",
        "B. Keeping the monopoly of temples to Brahmin class",
        "C. Allowing women to enter temple",
        "D. Sanskrit lessons to be imparted only to Brahmin family members and others to be devoid of it in order to preserve its purity",
        "Answer: Option A ",
        ""
    ],
    [
        "50. Sir Huge Rose described whom as 'the best and bravest military leader of the rebel'?",
        "A. Begum Hazrat Mahal",
        "B. Rani Laxmi Bai",
        "C. Kunwar Singh",
        "D. Bahadur Shah Zafar",
        "Answer: Option B",
        ""
    ],
    [
        "51. Raja Ram Mohan Roy was the founder of",
        "A. Arya Samaj",
        "B. Ram Krishna Mission",
        "C. Brahmo Samaj",
        "D. Prathna Samaj",
        "Answer: Option C ",
        ""
    ],
    [
        "52. Who founded the 'All India Harijan Samaj' in 1932?",
        "A. B R Ambedkar",
        "B. Acharya Narendra Dev",
        "C. Mahatma Gandhi",
        "D. Jagjivan Ram",
        "Answer: Option C ",
        ""
    ],
    [
        "53. __________ a notable disciple of Sree Narayana Guru introduced Guru's visions and ideals to the western world",
        "A. Nataraja Guru",
        "B. Kumaranasan",
        "C. Chattambi Swamikal",
        "D. K.Madhavan",
        "Answer: Option A ",
        ""
    ],
    [
        "54. The founder of the 'Brahmo Samaj' was",
        "A. Dayanand Saraswati",
        "B. Ishwar Chandra Vidyasagar",
        "C. Raja Ram Mohan Roy",
        "D. Swami Vivekananda",
        "Answer: Option C ",
        ""
    ],
    [
        "55. Which of the means adopted under Self Respect Movement?I. Violent protests against upper classesII. Undermine position of Brahmin priests by formalizing weddings without themIII. Boycott of temples and places of Brahmin residence",
        "A. I and III",
        "B. Only II",
        "C. Only III",
        "D. All the above",
        "Answer: Option B ",
        ""
    ],
    [
        "56. Which of the following are the innovative means used by Ishwar Chandra Vidya Sagar to bring Sanskrit education to all?",
        "A. Devised new Bengali primer",
        "B. Brought new prose style",
        "C. Both A &amp; B",
        "D. Continued the same method without any new innovation",
        "Answer: Option C ",
        ""
    ],
    [
        "57. The sepoy mutiny of 1857 occurred during the Governor Generalship to",
        "A. Break priestly monopoly of scriptural knowledge(Sanskrit) and opening to non- Brahmins",
        "B. Charles wood dispatch on education, influenced it towards female education",
        "C. Lady Hardinge medical college at Delhi",
        "D. Both A and B",
        "Answer: Option D ",
        ""
    ],
    [
        "58. Which of the following is not correct about Arya Samaj?",
        "A. The Arya Samajists opposed child marriages and encouraged remarriage of widows",
        "B. It was founded in 1875",
        "C. Its main motive was to promote faith in one God",
        "D. None of the above is correct",
        "Answer: Option A ",
        ""
    ],
    [
        "59. Which of the following are the main reasons for failure of Young Bengal Movement?I. Suppression by British new lawII. Did not involve peasant causeIII. Radicalism was bookish in character and did not develop links with masses",
        "A. Only I",
        "B. Only II",
        "C. Both II and III",
        "D. All the above",
        "Answer: Option C ",
        ""
    ],
    [
        "60. Who was the prominent leader in Lucknow during the Revolt of 1857?",
        "A. Begum Hazrat Mahal",
        "B. Rani Laxmi Bai",
        "C. Kuar Singh",
        "D. Bahadur Shah Zafar",
        "Answer: Option A ",
        ""
    ],
    [
        "61. Swami Vivekananda's contribution to society and educating masses is through following ways:I. Condemned caste system and current rituals and superstitionsII. Criticized for having lost touch with rest of world and for becoming stagnant and mummifiedIII. Subscribed to Vedanta which he considered fully rational system",
        "A. Only I",
        "B. Only II",
        "C. Only III",
        "D. All the above",
        "Answer: Option D ",
        ""
    ],
    [
        "62. Raja Rammohan Roy's contribution to education are:I. Assisted David Hare in setting Hindu collegeII. English school at Calcutta was maintained at his own costIII. Established Vedanta College which taught only western social and physical sciences",
        "A. Only III",
        "B. Both II and III",
        "C. Only I and II",
        "D. All the above",
        "Answer: Option C ",
        ""
    ],
    [
        "63. Aligarh Movement towards the end revented its followers from joining the national movement. Which of the following reasons made it to take this decision though it initially propagated for unity?",
        "A. It felt that immediate political progress was not possible and British Government couldn't be easily dislodged",
        "B. Indians are educationally forward so in order to suppress them their activities need to discouraged",
        "C. Gain support of British officials",
        "D. National movement is waste of time so should concentrate on other works",
        "Answer: Option A ",
        ""
    ],
    [
        "64. What was the greatest contribution of Ishwar Chand Vidyasagar in the social reforms in India?",
        "A. He ensured the widow's marriage and girl's education",
        "B. Help in the abolition of Sati Pratha",
        "C. Established the Brahma Samaj",
        "D. He adopted 100 villages to relocate them from Andhra Pradesh to Bengal for better life",
        "Answer: Option A ",
        ""
    ],
    [
        "65. In __________, a man named Raja Ram Mohan Roy founded an organization called 'Brahma Samaj'",
        "A. 1628",
        "B. 1728",
        "C. 1828",
        "D. 1928",
        "Answer: Option C",
        ""
    ],
    [
        "66. Which of the following is one of the social reasons for 1857 revolt?",
        "A. The English could not establish any social relationship with the Indians",
        "B. The racial arrogance of the British created a difference between the rulers and the ruled",
        "C. Both A &amp; B",
        "D. The company's trade policy destroyed Indian handicrafts",
        "Answer: Option C ",
        ""
    ],
    [
        "67. Who of the following leaders is not associated with the Brahma Samaj?",
        "A. Debendranath Tagore",
        "B. Keshab Chandra Sen",
        "C. Raja ram Mohan Rai",
        "D. Atma Ram Pandurang",
        "Answer: Option D ",
        ""
    ],
    [
        "68. Henry Vivian Derozio started young Bengal movement with the inspiration of which revolutionary ideas?",
        "A. Industrial revolution",
        "B. French revolution",
        "C. American Revolution",
        "D. Marxian theory",
        "Answer: Option B ",
        ""
    ],
    [
        "69. Which of the following were the ideas popularized through theosophical societyI. Doctrine of trans-migration of soulsII. Universal brotherhood of manIII. Reincarnation and Karma, and drew inspiration from philosophy of Upanishads and samkhya, yoga and Vedanta schoolIV. Against foreign rule",
        "A. Only III",
        "B. Only I and III",
        "C. Only I, II and III",
        "D. All the four are correct",
        "Answer: Option C ",
        ""
    ],
    [
        "70. The theosophical society was marked by the close understanding of the cosmos and the mundane life. Which among the listed options is not a part of their curriculum?",
        "A. Divinity",
        "B. Salvation",
        "C. Means of enlightenment",
        "D. Mystic superstition",
        "Answer: Option "
    ]
]