[
    [
        "1. In which century Bhakti movement began?",
        "A. 6th century",
        "B. 7th century",
        "C. 8th century",
        "D. 9th century",
        "Answer: Option B ",
        ""
    ],
    [
        "2. The concept of Sagunabrahmana was the outcome of which concept of Bhakti Movement?",
        "A. Nirgunabraman",
        "B. Vaishanavism",
        "C. Shaivism",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "3. Where was saint kabir born?",
        "A. Delhi",
        "B. Varanasi",
        "C. Mathura",
        "D. Hyderabad",
        "Answer: Option B ",
        ""
    ],
    [
        "4. Who preaches Visishtadvaita?",
        "A. Tulsidas",
        "B. Saivaite Nayanmars",
        "C. Sankara",
        "D. Ramanuja",
        "Answer: Option D ",
        ""
    ],
    [
        "5. Who was the Guru of Kabir?",
        "A. Ramanuja",
        "B. Ramananda",
        "C. Vallabhacharya",
        "D. Namadeva",
        "Answer: Option B ",
        ""
    ],
    [
        "6. Which Sufi's dargah is at Ajmer?",
        "A. Baba Farid",
        "B. Qutbdin Bakhtiyar Kaki",
        "C. Moinuddin Chisti",
        "D. Khwaja Bahuddin",
        "Answer: Option C ",
        ""
    ],
    [
        "7. Which of the following statement is correct definition of Nirguna?",
        "A. It is the concept of a formless God",
        "B. It is the concept of a formless Guru",
        "C. It is the concept of spirituality",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "8. Which of the following was the basic premise of Bhakti Movement?",
        "A. Bhakti or Single minded, uninterrupted and extreme devotion to God with the help of Brahmins was the only means of Salvation",
        "B. Bhakti or Single minded, uninterrupted and extreme devotion to God was the only means of Salvation",
        "C. Both A &amp; B",
        "D. None of the above",
        "Answer: Option B ",
        ""
    ],
    [
        "9. Sufism the liberal and mystic movement of Islam, reached India in the __________ century?",
        "A. 11th",
        "B. 12th",
        "C. 14th",
        "D. 13 th",
        "Answer: Option A ",
        ""
    ],
    [
        "10. Which of the following statement(s) is/are correct about the early traditions of Bhakti?I. In the course of the evolution of forms of worship, in many instances, poet-saints emerged as leaders around whom there developed a community of devotees.II. Brahmanas remained important intermediaries between gods and devotees in several forms of bhakti.III. At a different level, historians of religion often classify bhakti traditions into two broad categories: saguna (with attributes) and nirguna (without attributes)",
        "A. Only I",
        "B. I and II",
        "C. I and III",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "11. Who was among the following Bhakti saints gave a new orientation of Hinduism through his doctrine of Advaita or Monism?",
        "A. Ramanuja",
        "B. Sankara",
        "C. Guru Nanak",
        "D. Chaitanya",
        "Answer: Option B ",
        ""
    ],
    [
        "12. Who among the following had given the doctrine of Advaita or Monism?",
        "A. Sankara",
        "B. Saivaite Nayanmars",
        "C. Vashnavaite Alwars",
        "D. Tukaram",
        "Answer: Option A ",
        ""
    ],
    [
        "13. Which Bhakti saint preached the concept of Visitadvaita?",
        "A. Sankara",
        "B. Ramanuja",
        "C. Madhava",
        "D. Nimbarka",
        "Answer: Option B ",
        ""
    ],
    [
        "14. The most important saint of the Bhakti Movement in Maharashtra who was born at Satara and is said to have died in Punjab, was",
        "A. Jnanesvar",
        "B. Namadeva",
        "C. Tukaram",
        "D. Guru Ramdas",
        "Answer: Option B ",
        ""
    ],
    [
        "15. The Pandharpur Movement is associated with the Bhakti Movement of",
        "A. Assam",
        "B. Maharashtra",
        "C. Bengal",
        "D. Both (a) and (c)",
        "Answer: Option B ",
        ""
    ],
    [
        "16. Who was the writer of Rukmini Swayamwar Hastamalak, which was comprised 764 owees and based on a 14-shlok Sanskrit hymn with the same name by Shankaracharya?",
        "A. Ramananda",
        "B. Eknath",
        "C. Mirabai",
        "D. Tukaram",
        "Answer: Option B ",
        ""
    ],
    [
        "17. Which statement (s) is/are correct related to the Ramananda?I. He worshipped Ram and Sita but preached the oneness of God and the doctrine of Bhakti for everyoneII. Dismissed the caste system and untouchability, simplified rules of worship and made rigidity of the Varnashrama tradition milder",
        "A. I only",
        "B. II only",
        "C. Both I and II",
        "D. Neither I nor II",
        "Answer: Option C ",
        ""
    ],
    [
        "18. Who among the following was the reformer and philosopher from Ramanandi Sampradaya in the lineage of Jagadguru Ramanandacharya renowned for his devotion to the Lord Shri Rama?",
        "A. Ramananda",
        "B. Tukaram",
        "C. Valmiki",
        "D. Tulsidas",
        "Answer: Option D ",
        ""
    ],
    [
        "19. Which of the following statement (s) is/are correct related to the cardinal principle of Bhakti Cult?I. It was influencing devotion to a personal God, whose grace was the only means of attaining salvation or Mukti.II. It stressed the idea of a personal God and pointed out the absurdity of the caste system in the presence of God and the futility of external rites and ceremonies.",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option C ",
        ""
    ],
    [
        "20. Select the correct statement (s) with reference to the Bhakti Movement",
        "A. Collection of Alvar Saints hymns is known as Divya Prabandha",
        "B. Compilation of Alvar Saints poetry / literature Tirumurai is called \"Tamil Veda\"",
        "C. Both A &amp; B",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "21. Who exhorted people to give up selfishness, falsehood and hypocrisy and to lead a life of truth, honesty and kindness?",
        "A. Vallabhacharya",
        "B. Guru Nanak",
        "C. Kabir",
        "D. Nimbarka",
        "Answer: Option B ",
        ""
    ],
    [
        "22. Who wrote a commentry of Bhagvat Gita called Gnaneswari?",
        "A. Gnandeva",
        "B. Namadev",
        "C. Ekanath",
        "D. Both A &amp; B",
        "Answer: Option A ",
        ""
    ],
    [
        "23. Which statement (s) is/are correct related to the Kabir.I. He was the disciple of Ramananda and the most liberal among medieval Indian reformers.II. He was possibly a contemporary of Sultan Muhammad Bin Tughlaq (1489-1517)",
        "A. I only",
        "B. II only",
        "C. Both I and II",
        "D. Neither I nor II",
        "Answer: Option A ",
        ""
    ],
    [
        "24. The Bhakti cult spread in Maharashtra with the teaching of",
        "A. Sant Tukaram",
        "B. Sant Jnanesvar",
        "C. Samarth Guru Ramdas",
        "D. Chaitanya Mahaprabhu",
        "Answer: Option A ",
        ""
    ],
    [
        "25. Which of the following statement (s) is/are correct related to the Bhakti Saint Ramanuja? I. He preached Visishtadvaita. II. He said that the 'God is Sagunabrahman'",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option C",
        ""
    ],
    [
        "26. Which statement is not the advocacy of Nirguna Saints?",
        "A. It advocated the worshiped the anthropomorphic manifestations of the divine being, particularly Rama and Krishna",
        "B. It is the concept of a formless God, which has no attributes or quality",
        "C. It conceived as Ishvara, the personal and purely spiritual aspect of godhead, beyond all names and forms (nama-rupa), and is to be apprehended only by inner (mystical) experience",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "27. Who began the Achintayabhedabhedavada School of theology?",
        "A. Chaitanya",
        "B. Mirabai",
        "C. Tulsidas",
        "D. Surdas",
        "Answer: Option A ",
        ""
    ],
    [
        "28. Which of the following statement(s) is/are correct about Alvars and Nayanars?I. Some of the earliest bhakti movements (c. sixth century) were led by the Alvars (literally, those who are \"immersed\" in devotion to Vishnu) and Nayanars (literally, leaders who were devotees of Shiva).II. They travelled from place to place singing hymns in Tamil in praise of their gods.III. During their travels the Alvars and Nayanars identified certain shrines as abodes of their chosen deities",
        "A. Only I",
        "B. I and II",
        "C. I and III",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "29. Which was the language adopted by the Bhakti saints to preach their ideas to the masses?",
        "A. Hindi",
        "B. Sanskrit",
        "C. Ardh-Magadhi",
        "D. Regional vernacular languages",
        "Answer: Option D ",
        ""
    ],
    [
        "30. Which of the following Bhakti Saints poem is compiled in Sur Sagar, Sahitva Ratna and Sur Sarawali?",
        "A. Sur Das",
        "B. Kabirdas",
        "C. Tulsidas",
        "D. Kalidasa",
        "Answer: Option A ",
        ""
    ],
    [
        "31. The first Bhakti Movement was organised by",
        "A. Nanak",
        "B. Meera",
        "C. Ramdas",
        "D. Ramanujacharya",
        "Answer: Option D ",
        ""
    ],
    [
        "32. Which Bhakti Saints known as Sri Gauranga, was a popular Vaishnava saint and reformer from Bengal?",
        "A. Chaitanya",
        "B. Mirabai",
        "C. Sankaracharya",
        "D. Kabir",
        "Answer: Option A ",
        ""
    ],
    [
        "33. Who was the the founder of the Ramanandi Sampradaya, the largest monastic Hindu renunciant community in modern times?",
        "A. Ramananda",
        "B. Tukaram",
        "C. Mirabai",
        "D. Kabir",
        "Answer: Option A ",
        ""
    ],
    [
        "34. What is meant by a 'Pir' in the Sufi tradition?",
        "A. The Supreme God",
        "B. The Guru of the Sufis",
        "C. The greatest of all Sufi saints",
        "D. The orthodox teacher who contests the Sufibeliefs",
        "Answer: Option B ",
        ""
    ],
    [
        "35. Which of the following is/are the compositions of Kabir?",
        "A. Bijak &amp; Sakhi Granth",
        "B. Kabir Granthawali&amp; Anurag Sagar",
        "C. Only B",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "36. The Sufi Saint, contemporary of Prithviraj Chauhan, was",
        "A. Khwaja Muinuddin Chisti",
        "B. Sheikh Salim Chisti",
        "C. Sheikh Nizamuddin Auliya",
        "D. Baba Farid",
        "Answer: Option A ",
        ""
    ],
    [
        "37. Who wrote Shiksha Ashtak which was called as the cream of the Shastras?",
        "A. Mirabai",
        "B. Tulsidas",
        "C. Kabir",
        "D. Chaitanya",
        "Answer: Option D ",
        ""
    ],
    [
        "38. Sri Ramanuja Acharya was an Indian philosopher and is recognized as the most important saint of",
        "A. Sri Vaishnavism",
        "B. Sri Vaishavism",
        "C. Nirguna",
        "D. Sikkhism",
        "Answer: Option A ",
        ""
    ],
    [
        "39. Which of the following concept the Bhakti movement of Hinduism saw two ways of imaging the nature of the divine (Brahman)?",
        "A. Nirguna and Saguna",
        "B. Shaivism",
        "C. Sikkhism",
        "D. Jainism",
        "Answer: Option A ",
        ""
    ],
    [
        "40. The Sufi saint who maintained that devotional music was one way of moving closer to God was",
        "A. Muin-ud-din-Chisti",
        "B. Baba Farid",
        "C. Saiyid Mummed",
        "D. Shah Alam Bukhari",
        "Answer: Option B ",
        ""
    ],
    [
        "41. Which Bhakti saint believes that through love and devotion, song and dance, a devotee can feel the presence of God?",
        "A. Gnanadev",
        "B. Chaitanya",
        "C. Namadeva",
        "D. Ekanatha",
        "Answer: Option B ",
        ""
    ],
    [
        "42. Which of the following statement (s) is/are correct related to the Bhakti Saint Chaitanya? I. He popularised the Krishna Cult in Bengal. II. He believes that through love and devotion, song and dance, a devotee can feel the presence of God?",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option C ",
        ""
    ],
    [
        "43. Who was the disciple of Vallabhacharya?",
        "A. Tulsidas",
        "B. Surdas",
        "C. Tukaram",
        "D. Ramanuja",
        "Answer: Option B ",
        ""
    ],
    [
        "44. Which of the following Bhakti Reformers influenced by the preaching of Sufi teachers?",
        "A. Ramananda",
        "B. Kabir",
        "C. Nanak",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "45. Who among the following was the first Bhakti saint to use Hindi for the propagation of his message?",
        "A. Dadu",
        "B. Kabir",
        "C. Ramananda",
        "D. Tulsidas",
        "Answer: Option C ",
        ""
    ],
    [
        "46. Who wrote Vedanta-Parijatasourabha, a commentary on the Brahma Sutra, in simple language?",
        "A. Nimbarka",
        "B. Ramanuja",
        "C. Madhva",
        "D. Vallabhacharya",
        "Answer: Option A ",
        ""
    ],
    [
        "47. Bhakti Saint who was contemporary of Sivaji?",
        "A. Namadev",
        "B. Ekanatha",
        "C. Tukaram",
        "D. Gnanadeva",
        "Answer: Option C ",
        ""
    ],
    [
        "48. Kabir was a disciple of",
        "A. Ramananda",
        "B. Ramanujana",
        "C. Shakracharya",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "49. Kabir was contemporary of",
        "A. Guru Nanak",
        "B. Sultan Sikandar Lodi",
        "C. Both (a) and (b) above",
        "D. Babur",
        "Answer: Option C ",
        ""
    ],
    [
        "50. Which Bhakti Saints writings influenced Hinduism's Bhakti movement and his verses are found in Sikhism's scripture Adi Granth?",
        "A. Ramananda",
        "B. Kabir",
        "C. Mirabai",
        "D. Tukaram",
        "Answer: Option B ",
        ""
    ],
    [
        "51. Which of the following Bhakti sect founded by Birbhan and their religious granth is revered like the Granth of the Sikhs?",
        "A. Pothi",
        "B. Satnamis",
        "C. Vaishanavism",
        "D. Shaivism",
        "Answer: Option B ",
        ""
    ],
    [
        "52. Select the incorrect statement (s) about Bhakti Saint Ramananda. I. He advocated prabattimarga or path of self-surrender to God. II. He propagated 'Dvaita or dualism of Jivatma and Paramatma'.",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option D ",
        ""
    ],
    [
        "53. Who among the following propagated Dvaita or dualism of Jivatma and Paramatma?",
        "A. Vallabhacharya",
        "B. Madhava",
        "C. Merabai",
        "D. Nimbarka",
        "Answer: Option B ",
        ""
    ],
    [
        "54. Rudra Sampradaya School was founded by",
        "A. Ramananda",
        "B. Vallabhacharya",
        "C. Narasi",
        "D. Chaitanya",
        "Answer: Option B ",
        ""
    ],
    [
        "55. Who among the following Bhakti Saint emphasised the essential oneness of all religion by describing Hindus and Muslims 'as pots of the same clay'?",
        "A. Kabir",
        "B. Tulsidas",
        "C. Ramananda",
        "D. Raidasa",
        "Answer: Option A ",
        ""
    ],
    [
        "56. Who wrote a commentary on the Brahma sutras refuted Shari Kara and offered an interpretation based on the theistic ideas?",
        "A. Nimbarka",
        "B. Ramanuja",
        "C. Madhva",
        "D. Vallabhacharya",
        "Answer: Option B ",
        ""
    ],
    [
        "57. Which of the following is an intensely emotional form of Hinduism that flourished from the sixteenth century, mainly in Bengal and eastern Orissa?",
        "A. Gaudiya Sampradaya",
        "B. Krishna cult of Vallabhacharya",
        "C. Shiva cult of Vallabhacharya",
        "D. None of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "58. Which Bhakti Saints venerated in Sikhism, as well as Hindu warrior-ascetic traditions such as the Dadupanthis and the Niranjani Sampraday that emerged in north India during the Islamic rule?",
        "A. Ramananda",
        "B. Eknath",
        "C. Mirabai",
        "D. Namdeva",
        "Answer: Option D ",
        ""
    ],
    [
        "59. Who among the following propagated Dvaita or dualism of Jivatma and Pramatma in Kannada region?",
        "A. Mirabai",
        "B. Nimbarka",
        "C. Vallabhacharya",
        "D. Madhav",
        "Answer: Option D ",
        ""
    ],
    [
        "60. Which of the following sect is emphasised on nirguni Bhakti - devotion to a divine without Gunas (qualities or form), but it accepts both nirguni and saguni forms of the divine?",
        "A. Sikhism",
        "B. Shaivism",
        "C. Vaishanvism",
        "D. All of the above",
        "Answer: Option A ",
        ""
    ],
    [
        "61. Who among the following Bhakti Saints was responsible for founding many punyakshetras along the length and breadth of India, by taming avatars of Parvati and imprisoning her essence in Sri Chakras?",
        "A. Shankaracharya",
        "B. Ramanada Saraswati",
        "C. Tulsidas",
        "D. Valmiki",
        "Answer: Option A ",
        ""
    ],
    [
        "62. Find out the correct statement (s) related to the features of Bhakti Movement?I. Its proponents preached the 'unity of the god-head' and emphasized that 'devotion to God' and faith in him led to salvation.II. It laid stress on equality of all human beings and universal brotherhood",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option C ",
        ""
    ],
    [
        "63. Select the correct statement (s) related to the Vallabhacharya: I. His doctrine came to be known as \"Pushti Marga\" for his successors laid stress on the physical side of Krishna's sports. II. He is the founder of the International Society for Krishna Consciousness or ISKCON, commonly called the \"Hare Krishnas\"",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option A ",
        ""
    ],
    [
        "64. Which Bhakti Saint did not believe in the qualified monism of Ramanuja and emphasised the doctrine of duality, based mainly upon the Bhagavata Purana?",
        "A. Madhava",
        "B. Ramananda",
        "C. Vallabhacharya",
        "D. Chaitnaya",
        "Answer: Option A ",
        ""
    ],
    [
        "65. Who was the founder of the Bhakti Movement in Maharashtra in 13th Century?",
        "A. Namadev",
        "B. Ekanatha",
        "C. Tukaram",
        "D. Gnanadeva",
        "Answer: Option D",
        ""
    ],
    [
        "66. Which of the following statement is not correct about Andal?",
        "A. Andal was a woman Alvar, the most striking features of her compositions were widely sung (and continue to be sung to date)",
        "B. Andal was a woman Nayanar, she incorporated the prevailing caste system in the society",
        "C. Andal saw herself as the beloved of Vishnu; her verses express her love for the deity",
        "D. Andal saw herself as the beloved of Krishna; her verses express her love for the deity",
        "Answer: Option B ",
        ""
    ],
    [
        "67. Which of the following statement (s) is/are correct related to the Bhakti Movement?I. Originated as a reaction against caste division, untouchability and ritualism in India.II. Devotion was the pivotal point in the Bhakti cult in uniting human soul with god",
        "A. I only",
        "B. II only",
        "C. Both I and II",
        "D. Neither I nor II",
        "Answer: Option C ",
        ""
    ],
    [
        "68. Who among the following was born into a Rathore royal family of Kudki district of Pali, Rajasthan and was a 16th-century Hindu mystic poet and devotee of Krishna?",
        "A. Ramananda",
        "B. Mirabai",
        "C. Tukaram",
        "D. Kabir",
        "Answer: Option B ",
        ""
    ],
    [
        "69. Consider the following statement (s) is/are correct related to the impact of Bhakti Movement?I. Bhakti Movement resulted in a surge in Hindu literature in regional / vernacular languages mainly in the form of devotional poems and music.II. Bhakti Movement resulted in a surge in Buddhist text in regional / vernacular languages mainly in the form of devotional poems and music",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option A ",
        ""
    ],
    [
        "70. Which of the following statement (s) is/are correct related to the features of Bhakti Movement?I. Condemnation of rituals, ceremonies and blind faithII. Rejection of idol worship by many saints",
        "A. I only",
        "B. II only",
        "C. Both I and II",
        "D. Neither I nor II",
        "Answer: Option "
    ]
]