[
    [
        "1. The roots of the 1857 revolt lay in",
        "A. Blatantly discriminatory policies",
        "B. Exploitative land revenue policy",
        "C. The policy of greased cartridges",
        "D. All of the above",
        "Answer: Option D ",
        ""
    ],
    [
        "2. The Revolt of 1857 was started by",
        "A. The sepoys",
        "B. The zamindars",
        "C. The peasants",
        "D. The plantations workers",
        "Answer: Option A ",
        ""
    ],
    [
        "3. The revolt of 1857 had its beginning in",
        "A. Meerut",
        "B. Plassey",
        "C. Madras",
        "D. Bombay",
        "Answer: Option A ",
        ""
    ],
    [
        "4. An effect of the 1857 revolt was that",
        "A. The spirit of rebellion in Indian was crushed",
        "B. The British became totally demoralized",
        "C. The British abandoned their repressive policies",
        "D. Unity was forged between the Hindus and Muslims",
        "Answer: Option D ",
        ""
    ],
    [
        "5. The Revolt of 1857 failed mainly because",
        "A. of superior resources of the British empire",
        "B. it was poorly organised and the rebels had no common ideal",
        "C. it had very little nationalist sentiment",
        "D. it was localised, restricted and scattered",
        "Answer: Option B ",
        ""
    ],
    [
        "6. The Ghadar Party was founded (November 1913) at San Francisco USA by",
        "A. Madam Bhikaji Cama",
        "B. Lala Har Dayal",
        "C. Shyamji Krishana Verma",
        "D. Both (a) and (b) above",
        "Answer: Option B ",
        ""
    ],
    [
        "7. Which of the following pair leader associated with the Revolt of 1857 is not correctly matched?",
        "A. Hazrat Mahal : Kanpur",
        "B. Khan Bahadur Khan : Bareilly",
        "C. Kunwar Singh : Bihar",
        "D. Bakht Khan : Delhi",
        "Answer: Option A ",
        ""
    ],
    [
        "8. The administrative consequence of the Revolt of 1857 was transfered to power from",
        "A. East India Company to the British Crown",
        "B. British Crown to the East India Company",
        "C. East India Company to the Governor General",
        "D. British Crown to the Board of Directors",
        "Answer: Option A ",
        ""
    ],
    [
        "9. After the initial success of the Revolt of 1857, the objective for which the leaders of the revolt worked was",
        "A. to restore the former glory to the Mughal empire",
        "B. to form a Federation of Indian States under the aegis of Bhadur Shah II",
        "C. elimination of foreign rule and return of the old order",
        "D. each leader wanted to establish his own power in his respective region",
        "Answer: Option C ",
        ""
    ],
    [
        "10. Govind Dhondu Pant, popularly known was Nanasaheb, and one of the principal leaders of the Revolt of 1857, was the adopted heir and successor of",
        "A. Peshwa Baji Rao II",
        "B. King of Jhansi",
        "C. Madhav Rao Sindhia",
        "D. Malhar Rao Holkar",
        "Answer: Option A ",
        ""
    ],
    [
        "11. Who was the author of the Book, the Indian War of Independence, 1857?",
        "A. Sir Syed Ahmad Khan",
        "B. V.D. Savarkar",
        "C. R.S Sharma",
        "D. R.C. Majumdar",
        "Answer: Option B ",
        ""
    ],
    [
        "12. One of the earliest and the best known mutinies before the Revolt of 1857 was",
        "A. the Native Infantry Mutiny (1824)",
        "B. Indian Soldiers Mutiny at Vellore (1806)",
        "C. Sholapur Mutiny (1838)",
        "D. Assam Soldiers Mutiny (1824)",
        "Answer: Option B ",
        ""
    ],
    [
        "13. Which among the following place, was not an important centre of the Revolt of 1857 ?",
        "A. Agra",
        "B. Kanpur",
        "C. Jhansi",
        "D. Lucknow",
        "Answer: Option A ",
        ""
    ],
    [
        "14. I. The rebels lacked effective leadership.II. They did not get the support of the civilian people anywhere in the country.III. There was no central organisation to guide them.IV. Their military equipment was inferior to that of the English.Which of these statements is/are correct related the causes for the failure of the Great Revolt of 1857?",
        "A. I, III &amp; IV",
        "B. I, II &amp; III",
        "C. III &amp; IV",
        "D. II, III &amp; IV",
        "Answer: Option A ",
        ""
    ],
    [
        "15. Who are among the following leaders of the Revolt of 1857 managed to escape to Nepal? I. Kunwar SinghII. Nana SahabIII. Begum of AwadhIV. Bakht Khan",
        "A. I and II",
        "B. I and IV",
        "C. II and IV",
        "D. II and III",
        "Answer: Option D ",
        ""
    ],
    [
        "16. The Revolt of 1857 in Awadh and Lucknow was led by",
        "A. Wajid Ali Shah",
        "B. Begum Hazrat Mahal",
        "C. Asaf-ud-daula",
        "D. Begum Zeenat Mahal",
        "Answer: Option B ",
        ""
    ],
    [
        "17. The 1857 revolt did not acquire much intensity in",
        "A. Delhi",
        "B. Awadh",
        "C. Bombay",
        "D. The Chambal Region",
        "Answer: Option C ",
        ""
    ],
    [
        "18. Which of the following statements best explains the nature of revolt of 1857?",
        "A. The last effort of the old political order to regainpower",
        "B. Mutiny of a section of sepoys of the British Army",
        "C. A struggle of the common people to overthrowcommon rule",
        "D. An effort to establish a limited Indian nation",
        "Answer: Option A ",
        ""
    ],
    [
        "19. Name the Mughal emperor occupying the throne of Delhi when the revolt of 1857 took place",
        "A. Shah Alam II",
        "B. Jahandar Shah",
        "C. Bahadur Shah Zafar",
        "D. Humayun",
        "Answer: Option C ",
        ""
    ],
    [
        "20. Which of the following upheavals took place In Bengal immediately after the revolt of 1857?",
        "A. Santhal rebellion",
        "B. Indigo disturbances",
        "C. Sanyasi rebellion",
        "D. Pabna disturbances",
        "Answer: Option B",
        ""
    ],
    [
        "21. What was the main objective of the Wahabi movement which during 1852-70 was particularly active in the Punjab, Bengal, Bihar and the NWFP?",
        "A. To oust the British from India",
        "B. To overthrow the Sikhs in the Punjab and the British in Bengal and to restore Muslim power in India",
        "C. To eradicate religious corruption from Muslim society",
        "D. To organise the Muslims into a nationalist community",
        "Answer: Option B ",
        ""
    ],
    [
        "22. As per the Act of Indian Independence, the boundaries of East Bengal, West Bengal and Assam would be determined by",
        "A. The National Congress",
        "B. The Muslim League",
        "C. The Award of a Boundary Commission",
        "D. The People living in those boundary areas",
        "Answer: Option C ",
        ""
    ],
    [
        "23. The spark for the Swadeshi Movement was the __________ decision to partition Bengal",
        "A. French",
        "B. British",
        "C. Dutch",
        "D. Portuguese",
        "Answer: Option B ",
        ""
    ],
    [
        "24. Arrange the following historical events in the chronological order of their occurrence.",
        "A. I, II, III",
        "B. II, III, I",
        "C. II, I, III",
        "D. I, III, II",
        "Answer: Option C ",
        ""
    ],
    [
        "25. The swadeshi movement in Bengal started on __________",
        "A. 1902",
        "B. 1905",
        "C. 1908",
        "D. 1909",
        "Answer: Option B",
        ""
    ],
    [
        "26. Arrange the following events in a correct sequence of Indian National Movement  I. Foundation of Indian National Congress II. Simon Commission III. Home Rule MovementIV. Cabinet Mission",
        "A. I, III, II, IV",
        "B. III, I, IV, II",
        "C. I, II, IV, III",
        "D. I, IV, III, II",
        "Answer: Option A ",
        ""
    ],
    [
        "27. When was the Non-Cooperation Movement got momentum under the leadership of Mahatma Gandhi and the Indian National Congress?",
        "A. 1920-1922",
        "B. 1922-1924",
        "C. 1987-1989",
        "D. 1990-1992",
        "Answer: Option A ",
        ""
    ],
    [
        "28. Eminent Tamil Poet C Subramania Bharati was associated with which of the following movements of the Indian National Congress?",
        "A. Extremist",
        "B. Non-Cooperation",
        "C. Civil Disobedience",
        "D. Quit India",
        "Answer: Option A ",
        ""
    ],
    [
        "29. During the freedom struggle a parallel movement launched in the Indian states (in the states ruled by the Indian rulers such as Kashmir, Nizam's Hyderabad, Travancore, etc.) was/were",
        "A. State People's Movement",
        "B. Praja Mandal Movement",
        "C. Both (a) and (b) above",
        "D. Swaraj Movement",
        "Answer: Option C ",
        ""
    ],
    [
        "30. Khilafat Movement was organised by",
        "A. Jinnah",
        "B. Maulana Abul Kalam Azad",
        "C. Ali Brothers",
        "D. Agha Khan",
        "Answer: Option C",
        ""
    ],
    [
        "31. Khilafat Movement was organised to protest against the injustice done to",
        "A. Persia",
        "B. Turkey",
        "C. Arabia",
        "D. Egypt",
        "Answer: Option B ",
        ""
    ],
    [
        "32. After the failure of the Civil Disobedience Movement, Mahatma Gandhi laid emphasis on",
        "A. compromise with the British",
        "B. limited use of Violence",
        "C. constructive programme",
        "D. None of the above",
        "Answer: Option C ",
        ""
    ],
    [
        "33. The peasant movements, revolts, riots, struggles, etc. in 19th century, India remained mainly localised because",
        "A. they were mainly directed against enhancement in rent, evictions, usurious practices of moneylenders, etc.",
        "B. the peasants had no leadership and organisation",
        "C. they grew out of local grievances",
        "D. the big landlords were allies of the British",
        "Answer: Option C ",
        ""
    ],
    [
        "34. Mahatma Gandhi launched the Civil Disobedience Movement in 1930 from",
        "A. Sabarmati Ashram",
        "B. Ahmedabad",
        "C. Porbandar",
        "D. Dandi",
        "Answer: Option A ",
        ""
    ],
    [
        "35. When was the 'Quit India Movement' launched by Mohandas Karamchand Gandhi?",
        "A. 1946",
        "B. 1939",
        "C. 1942",
        "D. 1940",
        "Answer: Option C",
        ""
    ],
    [
        "36. Sir Syed Ahmed Khan had started a reform movement among the Muslim, called the __________ Movement",
        "A. Sufi",
        "B. Aligarh",
        "C. Jaipur",
        "D. Wahabi",
        "Answer: Option B ",
        ""
    ],
    [
        "37. The Namdhari, or Kuka, movement had its origin in the __________ corner of the Sikh kingdom, away from the places of royal pomp and grandeur",
        "A. North-west",
        "B. North-south",
        "C. North-east",
        "D. South",
        "Answer: Option A ",
        ""
    ],
    [
        "38. Which of the following was the achieved milestone of the Non-Cooperation Movement of 1921?",
        "A. It stopped the injustice done to the Khilafat",
        "B. Indian obtains some political rights",
        "C. The Hindus and the Muslims came closer in political pursuit",
        "D. It avenged the Punjab atrocities",
        "Answer: Option B ",
        ""
    ],
    [
        "39. __________ was the Founder Father of Aligarh movement",
        "A. Sir Syed Ahmed Khan",
        "B. Maqsud Ali",
        "C. Abul kalam Azad",
        "D. Karim Ali",
        "Answer: Option A ",
        ""
    ],
    [
        "40. The members of Khan Abdul Ghaffar Khan's Red Shirt Movement were known as",
        "A. Khidmatgars (Servants)",
        "B. Insan-i-Khidmatgar (Servants of the people)",
        "C. Khuda-i-Khidamatgar (Servants of God)",
        "D. Angels of Freedom",
        "Answer: Option C",
        ""
    ],
    [
        "41. Gandhi gave the call to reject all foreign goods during the __________ Movement",
        "A. Khilafat",
        "B. Non-cooperation",
        "C. Swadeshi",
        "D. Civil Disobedience",
        "Answer: Option C ",
        ""
    ],
    [
        "42. Gandhi had given out the stirring call of 'Do or Die' during the __________ Movement",
        "A. Non-cooperation",
        "B. Khilafat",
        "C. Civil Disobedience",
        "D. Quit India",
        "Answer: Option D ",
        ""
    ],
    [
        "43. Vivian Derozio had been associated with the __________ movement",
        "A. Swadeshi",
        "B. Back to the Vedas",
        "C. Young Bengal",
        "D. Young India",
        "Answer: Option C ",
        ""
    ],
    [
        "44. In which year Lala Lajpat Rai was deported to Mandalay for organising the agrarian movement in Punjab?",
        "A. 1905",
        "B. 1907",
        "C. 1909",
        "D. 1911",
        "Answer: Option B ",
        ""
    ],
    [
        "45. Who was in command of the nationalist movement before Gandhi had assumed leadership of the Congress?",
        "A. C R Das",
        "B. Motilal Nehru",
        "C. Lala Lajpat Rai",
        "D. Lokmanya Tilak",
        "Answer: Option D",
        ""
    ],
    [
        "46. The Kuka movement started in mid-nineteenth century in",
        "A. Western Punjab",
        "B. Maharashtra",
        "C. Bengal",
        "D. Madhya Bharat",
        "Answer: Option A ",
        ""
    ],
    [
        "47. The issue on which the Civil disobedience movement of 1930 was launched was",
        "A. Equal employment opportunities for Indians",
        "B. The proposed execution of Bhagat Singh",
        "C. Salt monopoly exercised by the British Government",
        "D. Complete freedom",
        "Answer: Option C ",
        ""
    ],
    [
        "48. Assertion (A): The introduction of 'Western Education' and English language as medium of instruction led the foundation for the rise and growth of nationalism in India. Reason (R): The Indian National Movement would not have been possible without the English language as the medium",
        "A. Both A and R is true and R is the correct explanation of A",
        "B. Both A and R is true but R is not a correct explanation of A",
        "C. A is true but R is false",
        "D. A is false but R is true",
        "Answer: Option A ",
        ""
    ],
    [
        "49. The Khilafat Movement was launched to protest against the humiliation of",
        "A. The Turkish Caliph",
        "B. Aga Khan",
        "C. Muhammad Ali Jinnah",
        "D. Abdul Kalam Azad",
        "Answer: Option A ",
        ""
    ],
    [
        "50. Which of the following reform movements was the first to be started in the 19th Century?",
        "A. Prathana Samaj",
        "B. Brahmo Samaj",
        "C. Arya Samaj",
        "D. Rama Krishna Mission",
        "Answer: Option B ",
        ""
    ],
    [
        "51. The father of extremist movement in India is",
        "A. Motilal Nehru",
        "B. Gopal Krishna Gokhale",
        "C. Vallabh Bhai Patel",
        "D. Bal Gangadhar Tilak",
        "Answer: Option D ",
        ""
    ],
    [
        "52. Two socio-religious reform movements founded in India in 1875 were",
        "A. Brahmo Samaj and Prarthana Samaj",
        "B. Arya Samaj and Ramakrishna Mission",
        "C. Theosophical Society and Arya Samaj",
        "D. Aligarh Movement and Servants of Indian Society",
        "Answer: Option C ",
        ""
    ],
    [
        "53. Which movement got the support from both Hindus and Muslims?",
        "A. Non-Cooperation Movement",
        "B. Quit India Movement",
        "C. Champaran Stayagraha",
        "D. Anti-Partition Movement",
        "Answer: Option A ",
        ""
    ],
    [
        "54. Apart from the Quit India Movement which started on 9th August 1942,  what other sensational activity of the freedom fighters was done on 9th August?",
        "A. Salt Satyagraha",
        "B. Boycott of Simon Commission",
        "C. Champaran Satyagraha",
        "D. Kakori Mail train robbery",
        "Answer: Option D ",
        ""
    ],
    [
        "55. During Quit India Movement,'Parallel Government' was constituted at",
        "A. Varanasi",
        "B. Allahabad",
        "C. Lucknow",
        "D. Ballia",
        "Answer: Option D ",
        ""
    ],
    [
        "56. 'Do or Die' (Karenge ya Marenge) Gandhiji gave this Mantra to the nation on the eve of which mass movement?",
        "A. Rowlatt Satyagraha",
        "B. Salt Satyagraha",
        "C. Quit India Movement",
        "D. Non-Cooperation Movement",
        "Answer: Option C ",
        ""
    ],
    [
        "57. In violation of the Salt Laws, Gandhiji started a movement called",
        "A. Non-Cooperation movement",
        "B. Swadeshi Movement",
        "C. Civil Disobedience movement",
        "D. None of the above",
        "Answer: Option C ",
        ""
    ],
    [
        "58. Which of the following was not one of the points stressed by Mahatma Gandhi while exhorting the people to join the Quit India Movement?",
        "A. Forget the differences between the Hindus and Muslims and think of yourselves as Indians only.",
        "B. our quarrel is not with British people, we fight their imperialism and we must purge ourselves of hatred.",
        "C. Feel from today that you are a free man and pot a dependent. Do or die. Either free India or die in the the attempt.",
        "D. Freedom of India is an end that will purify all means employed to achieve it.",
        "Answer: Option D ",
        ""
    ],
    [
        "59. In which years did Gandhiji start Satyagraha Movement?",
        "A. 1919",
        "B. 1917",
        "C. 1934",
        "D. 1909",
        "Answer: Option B ",
        ""
    ],
    [
        "60. The Non-Cooperation movement had been launched by Gandhi in the year",
        "A. 1916",
        "B. 1919",
        "C. 1920",
        "D. 1923",
        "Answer: Option C",
        ""
    ],
    [
        "61. All India State's Peoples Conference formed in 1927 launched popular movements in",
        "A. Princely States",
        "B. British Provinces",
        "C. Hill Regions",
        "D. Tribal Areas",
        "Answer: Option A ",
        ""
    ],
    [
        "62. Who among the following freedom fighter opposes the Annie Besant's idea of launching Home Rule Movement?",
        "A. G. K. Gokhale",
        "B. Mahatma Gandhi",
        "C. Aurobindo Ghosh",
        "D. B. G. Tilak",
        "Answer: Option A ",
        ""
    ],
    [
        "63. Which of the following trio leaders referred to as Lal, Bal and Pal during the freedom movement?",
        "A. Lala Lajpat Rai, Bal Gangadhar Tilak and Bipin Chandra Pal",
        "B. Lal Bahadur Shastri, Bal Gangadhar Tilak and Bipin Chandra Pal",
        "C. Lal Bahadur Shastri, Bal Gangadhar Tilak and Gopala Krishna Gokhale",
        "D. Lala Lajpat Rai, Bal Gangadhar Tilak and C. Rajagopalachari",
        "Answer: Option A ",
        ""
    ],
    [
        "64. In India, the Wahabi movement was started by __________",
        "A. 1901",
        "B. 1906",
        "C. 1915",
        "D. None of these",
        "Answer: Option D ",
        ""
    ],
    [
        "65. Which of the following statement(s) is/are correct related to the Non-cooperation Movement?I. It aimed to resist British rule in India through non violent means. Protestors would refuse to buy British goods, adopt the use of local handicrafts and picket liquor shops. II. The ideas of Ahimsa and nonviolence, and Gandhi's ability to rally hundreds of thousands of common citizens towards the cause of Indian independence, were first seen on a large scale in this movement through the summer 1920, they feared that the movement might lead to popular violence",
        "A. Only I",
        "B. Only II",
        "C. Both I &amp; II",
        "D. Neither I nor II",
        "Answer: Option C",
        ""
    ],
    [
        "66. Mahatma Gandhi launched the Civil Disobedience Movement on March 12, 1930 by",
        "A. asking the Viceroy through a letter containing Eleven Points Programme to remove the evils of the British rule",
        "B. Dandi March to break the Salt Laws",
        "C. asking the people to take Poorna Swaraj Pledge",
        "D. launching the non-payment of taxes campaign",
        "Answer: Option B ",
        ""
    ],
    [
        "67. The non cooperation movement was called off due to",
        "A. Jallianwalla Bagh Tragedy",
        "B. Chauri Chaura Incident",
        "C. Poona pact",
        "D. Gandhi-Irwin pact",
        "Answer: Option B ",
        ""
    ],
    [
        "68. Socialism is essentially a movement of",
        "A. Intellectuals",
        "B. The poor people",
        "C. The middle classes",
        "D. The workers",
        "Answer: Option C ",
        ""
    ],
    [
        "69. What was the another name of 'Quit India movement'?",
        "A. Khilafat Movement",
        "B. Swadeshi Movement",
        "C. Home Rule Movement",
        "D. August Kranti",
        "Answer: Option D ",
        ""
    ],
    [
        "70. Which one is the correct chronological order of the following vents?",
        "A. II, IV, I, III",
        "B. III, IV,II, I",
        "C. III, I, II, IV",
        "D. IV, II, III, I",
        "Answer: Option "
    ]
]