[
    [
        "Q1. Find the area of the triangle whose sides are 9cm, 10cm and 11cm respectively",
        "(a) 22√2 cm2",
        "(b) 25√3 cm2",
        "(c) 27√3 cm2",
        "(d) 30√2 cm2",
        "Answer: (d) 30√2 cm2 ",
        ""
    ],
    [
        "Q2. Find the area of the square whose diagonals is 3.2 cm long ?",
        "(a) 4.98 cm2",
        "(b) 5.12 cm2",
        "(c) 5.23 cm2",
        "(d) 6.15 cm2",
        "Answer: (b) 5.12 cm2 ",
        ""
    ],
    [
        "Q3. A wheel makes 1000 rotation in covering a distance of 44 km. Find the radius of the wheel ?",
        "(a) 5.5 m",
        "(b) 6 m",
        "(c) 7 m",
        "(d) 7.5 m",
        "Answer: (c) 7 m ",
        ""
    ],
    [
        "Q4. The perimeter of a rectangle is 60 m. If its length is twice its breadth, then its area is",
        "(a) 185 m2",
        "(b) 190 m2",
        "(c) 200 m2",
        "(d) 220 m2",
        "Answer: (c) 200 m2 ",
        ""
    ],
    [
        "Q5. The diagonal of a square is 4√2 cm. The diagonal of another square whose area is double that of the first square is",
        "(a) 7 cm",
        "(b) 8 cm",
        "(c) 10 cm",
        "(d) 11 cm",
        "Answer: (b) 8 cm ",
        ""
    ],
    [
        "Q6. The area of a square plot is 5000 m2. The length of its diagonal is",
        "(a) 75 m",
        "(b) 90 m",
        "(c) 100 m",
        "(d) 120 m",
        "Answer: (c) 100 m ",
        ""
    ],
    [
        "Q7. If each side of a square is increased by 50%, the ratio of the area of the resulting square to the area of the given square is",
        "(a) 8 : 5",
        "(b) 8 : 3",
        "(c) 9 : 4",
        "(d) 10 : 3",
        "Answer: (c) 9 : 4 ",
        ""
    ],
    [
        "Q8. The sides of a triangle are in the ratio ½ : 1/3 : ¼ . If the perimeter is 52 cm then the length of the smallest side is",
        "(a) 8 cm",
        "(b) 10 cm",
        "(c) 11 cm",
        "(d) 12 cm",
        "Answer: (d) 12 cm ",
        ""
    ],
    [
        "Q9. The area of a circle is increased by 22 cm2 when its radius is increased by 1 cm. The original radius of the circle is",
        "(a) 3 cm",
        "(b) 4 cm",
        "(c) 6 cm",
        "(d) 7 cm",
        "Answer: (a) 3 cm ",
        ""
    ],
    [
        "Q10. The length of a rectangular plot is twice its breadth. If the length of its diagonal is 5√5 m, the area of the rectangle is",
        "(a) 38 m2",
        "(b) 46 m2",
        "(c) 50 m2",
        "(d) 53 m2",
        "Answer: (c) 50 m2 ",
        ""
    ],
    [
        "Q11. Area of four walls of a room is 66 m2 and its length and bredth are 7.5 m and 3.5 m respectively. The height of the room is",
        "(a) 3 m",
        "(b) 5 m",
        "(c) 6 m",
        "(d) 7 m",
        "Answer: (a) 3 m ",
        ""
    ],
    [
        "Q12. A wheel makes 1000 revolutions in covering a distance of 88 km. The diameter of the wheel is",
        "(a) 20 m",
        "(b) 22 m",
        "(c) 25 m",
        "(d) 28 m",
        "Answer: (d) 28 m ",
        ""
    ],
    [
        "Q13. The length of minute hand of a wall clock is 7 cm. The area swept by it in 15 minutes is",
        "(a) 23.5 cm2",
        "(b) 32.5 cm2",
        "(c) 38.5 cm2",
        "(d) 47.5 cm2",
        "Answer: (c) 38.5 cm2 ",
        ""
    ],
    [
        "Q14. The radius of a wheel is 0.21 m. How many times does it revolve during a journey of 0.792 km ?",
        "(a) 550",
        "(b) 600",
        "(c) 650",
        "(d) 675",
        "Answer: (b) 600 ",
        ""
    ],
    [
        "Q15. In a circle of radius 14 cm, an arc subtends an angle of 60°at the center. The length of the arc is",
        "(a) 12 1/3 cm",
        "(b) 14 2/3 cm",
        "(c) 15 1/3 cm",
        "(d) 19 1/3 cm",
        "Answer: (b) 14 2/3 cm ",
        ""
    ],
    [
        "Q16. The radius of the wheel of a vehicle is 70 cm. The wheel makes 100 revolutions in 50 seconds. The speed of the vehicle is",
        "(a) 8.8 m/sec",
        "(b) 9.2 m/sec",
        "(c) 10.5 m/sec",
        "(d) 11.2 m/sec",
        "Answer: (a) 8.8 m/sec ",
        ""
    ],
    [
        "Q17. The area of a rhombus is 72 cm2. One of its diagonals is thrice the other. The length of the shorter diagonal is",
        "(a) 2√3 cm",
        "(b) 3√3 cm",
        "(c) 4√3 cm",
        "(d) 5√3 cm",
        "Answer: (c) 4√3 cm ",
        ""
    ],
    [
        "Q18. If a square and a rhombus stand on the same base, then the ratio of the areas of the square and rhombus is",
        "(a) 1",
        "(b) 2",
        "(c) 4",
        "(d) 5",
        "Answer: (a) 1 ",
        ""
    ],
    [
        "Q19. A triangle has sides of length 3 cm, 4 cm and 5 cm. What is the area of the circle inscribed in the triangle ?",
        "(a) π cm2",
        "(b) r cm2",
        "(c) 1 cm2",
        "(d) ½ cm2",
        "Answer: (a) π cm2 ",
        ""
    ],
    [
        "Q20. What is the diameter of a wheel that makes 113 revolutions to go 2 km 26 decameters ?",
        "(a) 60/11 m",
        "(b) 67/11 m",
        "(c) 70/11 m",
        "(d) 75/11 m",
        "Answer: (c) 70/11 m ",
        ""
    ],
    [
        "Q21. Each side of an equilateral triangle is 42 cm. What is the area of the circle inscribed in it ?",
        "(a) 332 cm2",
        "(b) 359 cm2",
        "(c) 423 cm2",
        "(d) 462 cm2",
        "Answer: (d) 462 cm2 ",
        ""
    ],
    [
        "Q22. The length of a rectangular plot is 4½ times that of its breadth. If the area of the plot is 200 square meter, then what is its length ?",
        "(a) 24 m",
        "(b) 25 m",
        "(c) 27 m",
        "(d) 30 m",
        "Answer: (d) 30 m ",
        ""
    ],
    [
        "Q23. The area of a rectangle is 12 sq meters and its length is 3 times that of its breadth. What is the perimeter of the rectangle ?",
        "(a) 16 m",
        "(b) 19 m",
        "(c) 21 m",
        "(d) 24 m",
        "Answer: (a) 16 m ",
        ""
    ],
    [
        "Q24. A road of uniform width runs round the inside of a rectangular field 38 m long and 32 m wide. If the road occupies 600 m2, the width of the road is",
        "(a) 4 m",
        "(b) 5 m",
        "(c) 6 m",
        "(d) 8 m",
        "Answer: (b) 5 m ",
        ""
    ],
    [
        "Q25. The area of a triangle is x square cm. and its base is y cm. What is the height of the triangle ?",
        "(a) x/y cm",
        "(b) x/2y cm",
        "(c) 2x/y cm",
        "(d) 2x2/y cm",
        "Answer: (c) 2x/y cm ",
        ""
    ],
    [
        "Q26. The two parallel sides of a trapezium are 2 cm and 4 cm respectively and the perpendicular distance between them is 3 cm. The area of the trapezium is",
        "(a) 6 cm2",
        "(b) 7 cm2",
        "(c) 8 cm2",
        "(d) 9 cm2",
        "Answer: (d) 9 cm2 ",
        ""
    ],
    [
        "Q27. What is the area of an equilateral triangle inscribed in a circle of unit radius ?",
        "(a) 2√2/3 sq unit",
        "(b) 3√3/4 sq unit",
        "(c) 3√2/4 sq unit",
        "(d) 4√3/3 sq unit",
        "Answer: (b) 3√3/4 sq unit ",
        ""
    ],
    [
        "Q28. A rectangular courtyard 3.78 m long and 5.25 m broad is to be paved exactly with square tiles, all of the same size. The minimum number of such tiles is",
        "(a) 402",
        "(b) 415",
        "(c) 425",
        "(d) 450",
        "Answer: (d) 450 ",
        ""
    ],
    [
        "Q29. The perimeter of a rectangle and a square are 160 m each. The area of the recctangle is less than that of the square by 100 sq meters. The length of the rectangle is",
        "(a) 50 m",
        "(b) 65 m",
        "(c) 72 m",
        "(d) 76 m",
        "Answer: (a) 50 m ",
        ""
    ],
    [
        "Q30. If the ratio of the areas of two squares is 16 : 1, then the ratio of their perimeter is",
        "(a) 2:1",
        "(b) 3:1",
        "(c) 4:1",
        "(d) 5:1",
        "Answer: (c) 4:1"
    ]
]