[
    [
        "Q1. The present worth of a sum due sometime hence is Rs. 1600 and the true discount is Rs. 160. The banker's gain is",
        "(a) Rs. 16",
        "(b) Rs. 21",
        "(c) Rs. 24",
        "(d) Rs. 29",
        "Answer: (a) Rs. 16 ",
        ""
    ],
    [
        "Q2. The banker's gain of a sum due 4 years hence at 5% per annum is Rs. 25. The present worth is",
        "(a) Rs. 595",
        "(b) Rs. 610",
        "(c) Rs. 625",
        "(d) Rs. 640",
        "Answer: (c) Rs. 625 ",
        ""
    ],
    [
        "Q3. The banker's gain on a sum due 4 years hence at 5% per annum is Rs. 250. The banker's discount is",
        "(a) Rs. 1175",
        "(b) Rs. 1200",
        "(c) Rs. 1350",
        "(d) Rs. 1500",
        "Answer: (d) Rs. 1500 ",
        ""
    ],
    [
        "Q4. The banker's discount on a certain sum due 2 years hence is 11/10 of the true discount. The rate percent per annum is",
        "(a) 5%",
        "(b) 6%",
        "(c) 8%",
        "(d) 9%",
        "Answer: (a) 5% ",
        ""
    ],
    [
        "Q5. The banker's discount on Rs. 1500 at 10% per annum is the same as the true discount of Rs. 1550 for the same time and at the same rate. The time is",
        "(a) 15/4 months",
        "(b) 15/4 months",
        "(c) 15/4 months",
        "(d) 15/4 months",
        "Answer: (c) 15/4 months ",
        ""
    ],
    [
        "Q6. The true discount on bill of Rs. 640 is Rs. 80. The banker's discount is",
        "(a) Rs. 91.42",
        "(b) Rs. 94.49",
        "(c) Rs. 97.52",
        "(d) Rs. 102.65",
        "Answer: (a) Rs. 91.42 ",
        ""
    ],
    [
        "Q7. The present worth of a bill due sometime hence is Rs. 1200 and the True discount on the bill is Rs. 120. Find B.D and B.G is",
        "(a) Rs. 112",
        "(b) Rs. 121",
        "(c) Rs. 127",
        "(d) Rs. 132",
        "Answer: (b) Rs. 121 ",
        ""
    ],
    [
        "Q8. The present worth of a sum due sometime hence is Rs. 625 and the banker's gain is Rs. 25. The true discount is",
        "(a) Rs. 111",
        "(b) Rs. 119",
        "(c) Rs. 125",
        "(d) Rs. 133",
        "Answer: (c) Rs. 125 ",
        ""
    ],
    [
        "Q9. The B.D and T.D on a sum due 8 months hence are Rs. 110 and Rs. 100 respectively. Find the sum and the rate percent.",
        "(a) 11%",
        "(b) 15%",
        "(c) 19%",
        "(d) 21%",
        "Answer: (b) 15% ",
        ""
    ],
    [
        "Q10. The banker's discount on a sum of money is Rs. 72 and the true discount on the same sum for the same time is Rs. 60. The sum due is",
        "(a) Rs. 260",
        "(b) Rs. 285",
        "(c) Rs. 330",
        "(d) Rs. 360",
        "Answer: (d) Rs. 360"
    ]
]