[
    [
        "Q1. A man can row upstream at 10 km/hr and downstream at",
        "(a) 2 Km/hr",
        "(b) 3 Km/hr",
        "(c) 8 Km/hr",
        "(d) 15 Km/hr",
        "Answer: (b) 3 Km/hr ",
        ""
    ],
    [
        "Q2. A boat can travel 15 km/ hr in still water. If the",
        "(a) 3 hrs",
        "(b) 4 hrs",
        "(c) 6 hrs",
        "(d) 12 hrs",
        "Answer: (b) 4 hrs ",
        ""
    ],
    [
        "Q3. A boat can travel 10 km/ hr in still water. If the",
        "(a) 8 hrs",
        "(b) 9 hrs",
        "(c) 10 hrs",
        "(d) 12 hrs",
        "Answer: (c) 10 hrs ",
        ""
    ],
    [
        "Q4. The speed of a current is 5 km/hr and a man's speed",
        "(a) 28 km/hr",
        "(b) 23 km/hr",
        "(c) 20 km/hr",
        "(d) 16 km/hr",
        "Answer: (a) 28 km/hr",
        ""
    ],
    [
        "Q5. A boat can covers a distance of 12 km in 4 hours in",
        "(a) 2 km/hr",
        "(b) 2.5 km/hr",
        "(c) 3.5 km/hr",
        "(d) 5 km/hr",
        "Answer: (b) 2.5 km/hr",
        ""
    ],
    [
        "Q6. A boat can travel with a speed of 9 km/hr in still",
        "(a) 2 hr",
        "(b) 3 hr",
        "(c) 5 hr",
        "(d) 8 hr",
        "Answer: (c) 5 hr ",
        ""
    ],
    [
        "Q7. A boat takes 90 minutes less to travel 36 miles downstream than to travel the same distance upstream. If the speed of the boat in still water is 10 mph, the speed of the stream is",
        "(a) 2 mph",
        "(b) 3 mph",
        "(c) 3.5 mph",
        "(d) 5 mph",
        "Answer: (a) 2 mph",
        ""
    ],
    [
        "Q8. The speed of a boat in still water is 10 km/hr. If it can travel 26 km downstream and 14 km upstream in the same time, the speed of the stream is",
        "(a) 2 km/hr",
        "(b) 3 km/hr",
        "(c) 5 km/hr",
        "(d) 7 km/hr",
        "Answer: (b) 3 km/hr",
        ""
    ],
    [
        "Q9. A boat is rowed downstream at 16.5 km/hr and upstream at 9.5 km/hr. The speed of the stream is",
        "(a) 3.5 km/hr",
        "(b) 4 km/hr",
        "(c) 5.3 km/hr",
        "(d) 7.8 km/hr",
        "Answer: (a) 3.5 km/hr",
        ""
    ],
    [
        "Q10. A boatman goes 3km against the current of stream in 1hr and goes 2km along the current in 20 minutes. How long will he take to go 6km in stationary water",
        "(a) 1.5 hr",
        "(b) 1(1/3) hr",
        "(c) 2.5 hr",
        "(d) 2(1/3) hr",
        "Answer: (b) 1(1/3) hr ",
        ""
    ],
    [
        "Q11. A boat goes 9 km in an hour in still water. It takes thrice as much time in covering the same distance against the current. Speed of the current is",
        "(a) 6 km/hr",
        "(b) 8 km/hr",
        "(c) 9 km/hr",
        "(d) 10 km/hr",
        "Answer: (a) 6 km/hr ",
        ""
    ],
    [
        "Q12. A man rows 40 km downstream and 22 km upstream taking 5 hours each time. What is the velocity of the current ?",
        "(a) 1.8 km/h",
        "(b) 1.9 km/h",
        "(c) 2.3 km/h",
        "(d) 2.7 km/h",
        "Answer: (a) 1.8 km/h ",
        ""
    ],
    [
        "Q13. A man rows 42 km down stream in 7 hours and 15 km upstream in 5 hours. What is the velocity of the current ?",
        "(a) 1.3 km/h",
        "(b) 1.5 km/h",
        "(c) 2.2 km/h",
        "(d) 2.5 km/h",
        "Answer: (b) 1.5 km/h ",
        ""
    ],
    [
        "Q14. A man can row 8 km/h in still water. When the river is running at 2 km/h, it takes him 4 hours to row to a place and back. How far is the place ?",
        "(a) 9 km",
        "(b) 11 km",
        "(c) 12 km",
        "(d) 15 km",
        "Answer: (d) 15 km ",
        ""
    ],
    [
        "Q15. A boat is rowed downstream at 15.5 km/h and upstream at 8 km/h. The speed of the stream is",
        "(a) 2.19 km/h",
        "(b) 3.75 km/h",
        "(c) 4.12 km/h",
        "(d) 4.33 km/h",
        "Answer: (b) 3.75 km/h ",
        ""
    ],
    [
        "Q16. The speed of a motor boat is that of the current of water as 36:4. The boat goes along with the current in 4 hours 30 minutes. It will come back in",
        "(a) 3(5/7) hr",
        "(b) 3(1/5) hr",
        "(c) 4(5/7) hr",
        "(d) 5(5/8) hr",
        "Answer: (d) 5(5/8) hr ",
        ""
    ],
    [
        "Q17. A man can row upstream at 5 km/hr and downstream at 10 km/hr. Find the man's rate in still water.",
        "(a) 5.5 km/h",
        "(b) 6.5 km/h",
        "(c) 7.5 km/h",
        "(d) 8.5 km/h",
        "Answer: (c) 7.5 km/h ",
        ""
    ],
    [
        "Q18. A boat takes one fourth time in moving a certain distance downstream than upstream. What is the ratio between rate in still water and rate of current ?",
        "(a) 3 : 7",
        "(b) 4 : 5",
        "(c) 5 : 3",
        "(d) 6 : 5",
        "Answer: (c) 5 : 3 ",
        ""
    ],
    [
        "Q19. A man can row 6½ kms an hour in still water and he finds that it takes him twice as long to row down the river. The rate of the stream is",
        "(a) 2(1/6) km/h",
        "(b) 3(1/5) km/h",
        "(c) 3(1/7) km/h",
        "(d) 4(1/5) km/h",
        "Answer: (a) 2(1/6) km/h ",
        ""
    ],
    [
        "Q20. A boat covers a distance of 30 km in 2½ hrs running downstream. While returning it covers the same distance in 3¾ hrs. What is the speed of the boat in still water.",
        "(a) 6 km/h",
        "(b) 7 km/h",
        "(c) 8 km/h",
        "(d) 10 km/h",
        "Answer: (d) 10 km/h ",
        ""
    ],
    [
        "Q21. A fisher man can row 4 km against the stream in 40 minutes and return in 30 minutes. What is the speed of the current ?",
        "(a) 1 km/h",
        "(b) 2 km/h",
        "(c) 3 km/h",
        "(d) 4 km/h",
        "Answer: (a) 1 km/h ",
        ""
    ],
    [
        "Q22. A man can row at 4 km/h in still water. If the river is running at 2 km/h, it takes him 70 minutes to row to a place and back. How far is the place ? ",
        "(a) 1½ km",
        "(b) 1¾ km",
        "(c) 3¼ km",
        "(d) 3¾ km",
        "Answer: (b) 1¾ km ",
        ""
    ],
    [
        "Q23. A man can row three quaters of a kilometer against the stream in 11¼ minutes and return in 7½ minutes. The speed of the man in still water",
        "(a) 3 km/h",
        "(b) 4 km/h",
        "(c) 5 km/h",
        "(d) 6 km/h",
        "Answer: (c) 5 km/h ",
        ""
    ],
    [
        "Q24. A boat running upstream takes 7 hours 48 minutes to cover a certain distance while it takes 4 hours to cover the same distance running downstream. What is the ratio between speed of the boat and the speed of water current respectively ?",
        "(a) 37 : 14",
        "(b) 41 : 16",
        "(c) 52 : 18",
        "(d) 59 : 19",
        "Answer: (d) 59 : 19 ",
        ""
    ],
    [
        "Q25. A boat goes 30 km downstream and 24 km upstream in 6 hours. It goes 39 km upstream and 26 km downstream in 6 hour 30 minutes. The speed of the boat in still water is",
        "(a) 7.4 km/h",
        "(b) 8.9 km/h",
        "(c) 10.5 km/h",
        "(d) 12.3 km/h",
        "Answer: (c) 10.5 km/h ",
        "(a) -(b)⇒ -14b = -1",
        ""
    ],
    [
        "Q26. A boatman goes 2 km against the current of stream in 30 minutes and return to the same spot in 20 minutes. What is his rate of rowing in still water ?",
        "(a) 5 km/h",
        "(b) 7 km/h",
        "(c) 12 km/h",
        "(d) 13 km/h",
        "Answer: (a) 5 km/h ",
        ""
    ],
    [
        "Q27. The speed of a boat in still water is 14 km/h. It can go 30 km upstream and return downstream to the original point in 5 hour. The speed of the stream is",
        "(a) 4 km/h",
        "(b) 6 km/h",
        "(c) 7 km/h",
        "(d) 8 km/h",
        "Answer: (a) 4 km/h ",
        ""
    ],
    [
        "Q28. A boat running downstream covers 24 km in 4 hr, while for covering the same distance upstream it takes 6 hours. What is the speed of the boat in still water ?",
        "(a) 3 km/h",
        "(b) 5 km/h",
        "(c) 6 km/h",
        "(d) 9 km/h",
        "Answer: (b) 5 km/h ",
        ""
    ],
    [
        "Q29. A steamer goes downstream from one port to another in 4 hours. It covers the same distance upstream in 5 hours. If the speed of the stream is 2 km/h, the distance between the two ports is",
        "(a) 52 km",
        "(b) 55 km",
        "(c) 65 km",
        "(d) 80 km",
        "Answer: (d) 80 km ",
        ""
    ],
    [
        "Q30. A boat goes 20 km downstream in 10 hours, It takes 2 hours more to cover the same distance against the stream. What is the speed of the boat in still water ?",
        "(a) 1.52 km/h",
        "(b) 1.83 km/h",
        "(c) 2.15 km/h",
        "(d) 2.77 km/h",
        "Answer: (b) 1.83 km/h ",
        ""
    ],
    [
        "Q31. The current of a stream runs at 4 km an hour. A boat goes 6 km and back to the starting point in 2 hours. The speed of the boat in still water is",
        "(a) 7 km/h",
        "(b) 8 km/h",
        "(c) 9 km/h",
        "(d) 12 km/h",
        "Answer: (b) 8 km/"
    ]
]