[
    [
        "Q1. Running at the same constant rate, 5 identical machines can produce 2500 bottles per minute. At this rate, how many bottles could 10 such machines produce in 5 minutes ?",
        "(a) 2500",
        "(b) 25000",
        "(c) 7500",
        "(d) 75000",
        "Answer: (b) 25000 ",
        ""
    ],
    [
        "Q2. In a hospital, there is a consumption of 1250 liters of milk for 50 patients for 30 days. How many patients will consume 1750 liters of milk in 25 days",
        "(a) 62 patients",
        "(b) 73 patients",
        "(c) 84 patients",
        "(d) 92 patients",
        "Answer: (c) 84 patients ",
        ""
    ],
    [
        "Q3. A contractor under takes to build a wall in 50 days. He employes 50 people for the same. However after 25 days, he finds that only 40% of the work is complete. How many more men need to be employeed to complete the work in time ?",
        "(a) 22",
        "(b) 25",
        "(c) 29",
        "(d) 33",
        "Answer: (b) 25 ",
        ""
    ],
    [
        "Q4. A garrison of 600 men had provisions for 30 days. After 3 days, a reinforcement of 200 men arrived. The remaining food will now last for how many days.",
        "(a) 20¼ days",
        "(b) 22¾ days",
        "(c) 25½ days",
        "(d) 27¾ days",
        "Answer: (a) 20¼ days ",
        ""
    ],
    [
        "Q5. Two persons can complete a piece of work in 9 days. How many more persons are neede to complete the double work in 12 days ?",
        "(a) 1",
        "(b) 2",
        "(c) 4",
        "(d) 5",
        "Answer: (a) 1 ",
        ""
    ],
    [
        "Q6. If 6 spiders can catch 12 flies in 6 minutes, how many flies can 60 spiders can catch in 60 minutes ?",
        "(a) 800",
        "(b) 900",
        "(c) 1050",
        "(d) 1200",
        "Answer: (d) 1200 ",
        ""
    ],
    [
        "Q7. If the rent for grazing 36 cows for 18 days is Rs. 600, how many cows can graze for 20 days on Rs. 500 ?",
        "(a) 24 days",
        "(b) 27 days",
        "(c) 29 days",
        "(d) 32 days",
        "Answer: (b) 27 days ",
        ""
    ],
    [
        "Q8. 25 men can reap a field in 20 days. When should 15 men leave the work if the whole field is to be reaped in 37½ days after they leave the work ?",
        "(a) 5 days",
        "(b) 8 days",
        "(c) 11 days",
        "(d) 14 days",
        "Answer: (a) 5 days ",
        ""
    ],
    [
        "Q9. 9 men complete one-third of a piece of work in 10 days. How many more men should be employeed to finish the rest of the work in 15 more days ?",
        "(a) 2",
        "(b) 3",
        "(c) 5",
        "(d) 6",
        "Answer: (b) 3 ",
        ""
    ],
    [
        "Q10. If 4 persons weave 300 shawls in 12 days, how many shawls will 8 persons weave in 7 days ?",
        "(a) 295",
        "(b) 305",
        "(c) 325",
        "(d) 350",
        "Answer: (d) 350"
    ]
]