[
    [
        "Q1. The sum of the ages of A and B is 63 years. After 6",
        "(a) 46 Years",
        "(b) 50 Years",
        "(c) 53 Years",
        "(d) 60 Years",
        ""
    ],
    [
        "Q2. Rohit is twice as old as Rakesh was two years ago. If",
        "(a) 5 Years",
        "(b) 8 Years",
        "(c) 10 Years",
        "(d) 12 Years",
        ""
    ],
    [
        "Q3. The sum of the ages of 4 children born at the",
        "(a) 4 Years",
        "(b) 6 Years",
        "(c) 9 Years",
        "(d) 10 Years",
        ""
    ],
    [
        "Q4. A is two years older than B who is twice as old as C.",
        "(a) 9 Years",
        "(b) 10 Years",
        "(c) 7 Years",
        "(d) 8 Years",
        ""
    ],
    [
        "Q5. The sum of the present ages of a father and his son",
        "(a) 12 Years",
        "(b) 16 Years",
        "(c) 20 Years",
        "(d) 24 Years",
        ""
    ],
    [
        "Q6. The difference between the ages of two persons is 15",
        "(a) 35 Years",
        "(b) 36 Years",
        "(c) 30 Years",
        "(d) 25 Years",
        ""
    ],
    [
        "Q7. The age of the father is 30 years more than the son's age. Ten years hence, the father's age will become three times the son's age that time. What is the son's present age in years ?",
        "(a) 3 Years",
        "(b) 4 Years",
        "(c) 5 Years",
        "(d) 5 Years",
        ""
    ],
    [
        "Q8. The ages of Sita and Gita are in the ratio 8:15. After 9 years, the ratio of their ages will be 11:18. What is the difference between their ages ?",
        "(a) 18 years",
        "(b) 21 Years",
        "(c) 22 Years",
        "(d) 25 Years",
        "Answer: (b) 21 Years",
        ""
    ],
    [
        "Q9. The sum of the ages of a father and his son is 50 years now. Four years ago, their ages were in the ratio of 2 : 1. The ratio of the ages of father and son after 10 years will be ",
        "(a) 2 : 3",
        "(b) 3 : 2",
        "(c) 4 : 3",
        "(d) 3 : 4",
        "Answer: (b) 3 : 2",
        ""
    ],
    [
        "Q10. The ratio of present ages of two brothers is 1 : 2 and 5 years back the ratio was 1 : 3. What will be the ratio of their ages after 10 years ?",
        "(a) 2 : 3",
        "(b) 3 : 4",
        "(c) 4 : 3",
        "(d) 5 : 3",
        "Answer: (a) 2 : 3 ",
        ""
    ],
    [
        "Q11. The ratio of Sampriti's age to the age of her mother is 4 : 13. The difference between their ages of 27 years. The ratio of the ages after 2 years will be",
        "(a) 4 : 5",
        "(b) 6 : 7",
        "(c) 11 : 27",
        "(d) 14 : 41",
        "Answer: (d) 14 : 41 ",
        ""
    ],
    [
        "Q12. The age of a man 10 years ago was thrice the age of his son. Ten years hence, the man's age will be twice that of his son. The ratio of their present ages is",
        "(a) 7 : 3",
        "(b) 9 : 5",
        "(c) 11 : 7",
        "(d) 13 : 9",
        "Answer: (a) 7 : 3 ",
        ""
    ],
    [
        "Q13. X is 26 years old and Y is 6 years. In how many years will X be twice as old as Y ?",
        "(a) 10",
        "(b) 11",
        "(c) 14",
        "(d) 15",
        "Answer: (c) 14 ",
        ""
    ],
    [
        "Q14. The sum of the ages of five chilndren born at the intervals of 2 years each is 50 years. What is the age of the youngest child ?",
        "(a) 4",
        "(b) 6",
        "(c) 7",
        "(d) 9",
        "Answer: (b) 6 ",
        ""
    ],
    [
        "Q15. A is 2 years older than B who is twice as old as C. If the total of the ages of A, B, C be 52 years, then how old B is ",
        "(a) 14 years",
        "(b) 17 years",
        "(c) 20 years",
        "(d) 23 years",
        "Answer: (c) 20 years ",
        ""
    ],
    [
        "Q16. The difference between the present ages of Anil and Sunil is 5 years. The ratio between their ages after 6 yeyars will be 3 : 4. What can be the present age of Sunil ?",
        "(a) 14 years",
        "(b) 16 years",
        "(c) 18 years",
        "(d) 20 years",
        "Answer: (a) 14 years ",
        ""
    ],
    [
        "Q17. The product of Hari's age 5 years ago with his age 7 years later is 45. Hari's present age is",
        "(a) 6 years",
        "(b) 7 years",
        "(c) 8 years",
        "(d) 9 years",
        "Answer: (c) 8 years ",
        ""
    ],
    [
        "Q18. The ages of two persons are in the ratio of 5 : 7. 16 years ago, their ages were in the ratio of 3 : 5. Their present ages are ",
        "(a) 31 and 48 years",
        "(b) 33 and 51 years",
        "(c) 36 and 52 years",
        "(d) 40 and 56 years",
        "Answer: (d) 40 and 56 years ",
        ""
    ],
    [
        "Q19. Maidul was thrice as old as Zahidul 3 years back. Maidul will be 5/3 times as old as Zahidul 3 years hence. How old is Zahidul today ?",
        "(a) 3 years",
        "(b) 4 years",
        "(c) 5 years",
        "(d) 6 years",
        "Answer: (d) 6 years ",
        ""
    ],
    [
        "Q20. Sunil's age after 11 years will be 5 times his age 5 years back. What is the present age of Sunil ?",
        "(a) 8 years",
        "(b) 9 years",
        "(c) 10 years",
        "(d) 11 years",
        "Answer: (b) 9 years ",
        ""
    ],
    [
        "Q21. The ratio of the ages of Ajay and Binod is 3 : 4. After 5 years, the new ratio of their ages will be 4 : 5. What is the age of Ajay present ?",
        "(a) 10 years",
        "(b) 13 years",
        "(c) 15 years",
        "(d) 19 years",
        "Answer: (c) 15 years ",
        ""
    ],
    [
        "Q22. 15 years hence a man will be just 3 times as old as he was 15 years ago. His present age is",
        "(a) 22 years",
        "(b) 25 years",
        "(c) 29 years",
        "(d) 30 years",
        "Answer: (d) 30 years ",
        ""
    ],
    [
        "Q23. The present age of rahim is four times the age of his son. Five years ago, the age of Rahim was ten times the age of his son at that time. How old is the son at present ?",
        "(a) 7.5 years",
        "(b) 8.5 years",
        "(c) 9.5 years",
        "(d) 10 years",
        "Answer: (a) 7.5 years ",
        ""
    ],
    [
        "Q24. A man's age is now three times that of his son. In 10 years, it will be double that of his son. The present age of the son is",
        "(a) 10 years",
        "(b) 12 years",
        "(c) 13 years",
        "(d) 15 years",
        "Answer: (a) 10 years ",
        ""
    ],
    [
        "Q25. The present age of A, B, C are in the ratio 5:6:7. Five years ago, the sum of their ages was 75. Their present ages are",
        "(a) 15, 20, 25 years",
        "(b) 20, 25, 30 years",
        "(c) 25, 30, 35 years",
        "(d) 30, 35, 40 years",
        "Answer: (c) 25, 30, 35 years ",
        ""
    ],
    [
        "Q26. The ratio of a man's age to his son's age is 5 : 1. The product of their ages is 80. The ratio of their ages after 5 years will be",
        "(a) 19:7",
        "(b) 23:9",
        "(c) 23:7",
        "(d) 25:9",
        "Answer: (d) 25:9 ",
        ""
    ],
    [
        "Q27. Ram is 40 years old and Rahim is 60 years old. How many years ago was the ratio of their ages 3:5 ?",
        "(a) 8 years",
        "(b) 9 years",
        "(c) 10 years",
        "(d) 12 years",
        "Answer: (c) 10 years ",
        ""
    ],
    [
        "Q28. The ratio between the present ages of Gita and Seema is 2:3. If Seema was 5 years older to Geeta four years back, how old is Geeta now ?",
        "(a) 10 years",
        "(b) 11 years",
        "(c) 12 years",
        "(d) 13 years",
        "Answer: (a) 10 years ",
        ""
    ],
    [
        "Q29. A man's present age is three-seventh of the age of his mother. After 6 years, he will be one-half of the age of his mother at that time. How old is the man at present ?",
        "(a) 14 years",
        "(b) 15 years",
        "(c) 16 years",
        "(d) 18 years",
        "Answer: (d) 18 years ",
        ""
    ],
    [
        "Q30. Bimal is as much younger to Rahul as he is older to Nayan. If the total ages of Rahul and Nayan is 42 years, how old is Bimal ?",
        "(a) 15 years",
        "(b) 17 years",
        "(c) 19 years",
        "(d) 21 years",
        "Answer: (d) 21 years ",
        ""
    ],
    [
        "Q31. One year ago, Ram was 8 times as old as his son. Now his age is equal to the square of his son's age. The present age of Ram will be. ",
        "(a) 40 years",
        "(b) 42 years",
        "(c) 45 years",
        "(d) 49 years",
        "Answer: (d) 49 years ",
        ""
    ],
    [
        "Q32. Kamala got married 6 years ago. Today her age is 1¼ times her age at the time of marriage. Her son's age is 1/15 times her age. Her son's age is",
        "(a) 2 years",
        "(b) 3 years",
        "(c) 4 years",
        "(d) 5 years",
        "Answer: (a) 2 years"
    ]
]