[
    [
        "Q1. A train moves with the speed of 180 km/hr. Find the",
        "(a) 20 m/sec",
        "(b) 30 m/sec",
        "(c) 50 m/sec",
        "(d) 70 m/sec",
        "Answer: (c) 50 m/sec ",
        ""
    ],
    [
        "Q2. A 150 metres long train moving at the speed of 126",
        "(a) 3.5 seconds",
        "(b) 4.2 seconds",
        "(c) 5 seconds",
        "(d) 6 seconds",
        "Answer: (b) 4.2 seconds",
        ""
    ],
    [
        "Q3. A train of length 250 meter long running at the speed",
        "(a) 60 seconds",
        "(b) 72 seconds",
        "(c) 85 seconds",
        "(d) 90 seconds",
        "Answer: (d) 90 seconds",
        ""
    ],
    [
        "Q4. A train with a uniform speed crosses a pole in 2",
        "(a) 85 metre",
        "(b) 100 metre",
        "(c) 105 metre",
        "(d) 125 metre",
        "Answer: (b) 100 metre",
        ""
    ],
    [
        "Q5. A train of 260 m long passed a pole in 26 secconds.",
        "(a) 78 seconds",
        "(b) 96 seconds",
        "(c) 100 seconds",
        "(d) 115 seconds",
        "Answer: (c) 100 seconds",
        ""
    ],
    [
        "Q6. A train travels first 160 Km at 64 Km/hr and the next 160 Km at 80 Km/hr. The average speed for the first 320 Km of the tour is",
        "(a) 57.24 km/hr",
        "(b) 71.11 km/hr",
        "(c) 78.32 km/hr",
        "(d) 91 km/hr",
        "Answer: (b) 71.11 km/hr",
        ""
    ],
    [
        "Q7. The ratio between the speeds of two trains is 5 : 6. If the second train runs 600 km in 5 hours, the speed of the first train is",
        "(a) 30 km/hr",
        "(b) 90 km/hr",
        "(c) 100 km/hr",
        "(d) 300 km/hr",
        "Answer: (c) 100 km/hr ",
        ""
    ],
    [
        "Q8. Two trains approach each other at 30 km/hr and 27 km/hr from two places 342 km apart. After how many hours will they meet ?",
        "(a) 6 hrs",
        "(b) 9 hrs",
        "(c) 10 hrs",
        "(d) 11 hrs",
        "Answer: (a) 6 hrs ",
        ""
    ],
    [
        "Q9. The speed of a 180m long train is 60 km/hr. How much time will take to pass a platform of 600m long ?",
        "(a) 40 sec",
        "(b) 42.5 sec",
        "(c) 45.8 sec",
        "(d) 46.8 sec",
        "Answer: (d) 46.8 sec ",
        ""
    ],
    [
        "Q10. A train travelling at a speed of 30 m/sec crosses a platform 600m long in 30 seconds. The length of the train is",
        "(a) 200m",
        "(b) 250m",
        "(c) 300m",
        "(d) 450m",
        "Answer: (c) 300m ",
        ""
    ],
    [
        "Q11. A 230m long train crosses a bridge in 30 seconds at 45 km/hr. The length of the bridge is",
        "(a) 130m",
        "(b) 145m",
        "(c) 245m",
        "(d) 250m",
        "Answer: (b) 145m ",
        ""
    ],
    [
        "Q12. A train crosses a pole in 15 seconds, while it crosses a 100m long platform in 25 seconds. The length of the train is",
        "(a) 125m",
        "(b) 135m",
        "(c) 150m",
        "(d) 200m",
        "Answer: (c) 150m ",
        ""
    ],
    [
        "Q13. A fast train takes 3 hours less than the slow train for a journey of 600 km. If the speed of the slow train is 10 km/hr less than the fast train, the speed of the slow train is",
        "(a) 32 km/hr",
        "(b) 40 km/hr",
        "(c) 46 km/hr",
        "(d) 51 km/hr",
        "Answer: (b) 40 km/hr ",
        ""
    ],
    [
        "Q14. Two trains starts from two stations A and B and travel towards each other at 40 km/hr and 50 km/hr respectively. At the time of their meeting, the second train has travelled 110 km more than the first. The distance between A and B is",
        "(a) 850 Km",
        "(b) 870 Km",
        "(c) 935 Km",
        "(d) 990 Km",
        "Answer: (d) 990 Km ",
        ""
    ],
    [
        "Q15. A train covered a certain distance at a uniform speed. If the train had been 5 km/hr faster, it would have taken 3 hours less than the schedule time. If the train were slower by 5 km/hr, the train would have taken 5 hours more than the schedule time. The length of journey is",
        "(a) 120 Km",
        "(b) 140 Km",
        "(c) 160 Km",
        "(d) 180 Km",
        "Answer: (d) 180 Km ",
        ""
    ],
    [
        "Q16. Bombay Express left Delhi for Bombay at 14.30 hours travelling at a speed of 70 km/hr and Rajdhani Express left Delhi for Bombay on the same day at 15.30 hours travelling at a speed of 90 km/hr. How far away from Delhi will the two trains meet ?",
        "(a) 285 Km",
        "(b) 290 Km",
        "(c) 315 Km",
        "(d) 345 Km",
        "Answer: (c) 315 Km ",
        ""
    ],
    [
        "Q17. A train without stoppages travels at the rate of 60 km/hr and with stopagges it travels at 55 km/hr. How many minutes does the train stop on an average per hour ?",
        "(a) 5 min",
        "(b) 8 min",
        "(c) 10 min",
        "(d) 12 min",
        "Answer: (a) 5 min ",
        ""
    ],
    [
        "Q18. A train travelled distances of 10 km, 20 km and 30 km at speeds of 50 km/hr, 60 km/hr and 90 km/hr respectively. The average speed of the train was",
        "(a) 67.25 km/hr",
        "(b) 69.23 km/hr",
        "(c) 70.12 km/hr",
        "(d) 72.45 km/hr",
        "Answer: (b) 69.23 km/hr ",
        ""
    ],
    [
        "Q19. Two trains A and B start running together from the same point in the same directions at 50 km/hr and 60 km/hr respectively. If the length of each train is 200 m, how long will it take for the train B to cross train A.",
        "(a) 121 Sec",
        "(b) 135 Sec",
        "(c) 144 Sec",
        "(d) 156 Sec",
        "Answer: (c) 144 Sec ",
        ""
    ],
    [
        "Q20. A train 200 m in length passes a milestone in 20 Sec and another train of the same length travelling in opposite direction in 15 Sec. The speed of the second train is",
        "(a) 12 1/3 m/sec",
        "(b) 15 2/5 m/sec",
        "(c) 16 2/3 m/sec",
        "(d) 18 3/5 m/sec",
        "Answer: (c) 16 2/3 m/sec ",
        ""
    ],
    [
        "Q21. How much time will a train 180 m long take to cross a bridge 300 m long, if it is running at a speed of 50 km/hr",
        "(a) 31.21 sec",
        "(b) 34.56 sec",
        "(c) 37.15 sec",
        "(d) 39.59 sec",
        "Answer: (b) 34.56 sec ",
        ""
    ],
    [
        "Q22. Two goods train each 400 m long are running in opposite directions on parallel tracks. Their speeds are 400 km/hr and 30 km/hr respectively. The time taken by the slower train to pass the driver of the faster one is",
        "(a) 32.87 sec",
        "(b) 36.15 sec",
        "(c) 39.33 sec",
        "(d) 41.14 sec",
        "Answer: (d) 41.14 sec ",
        ""
    ],
    [
        "Q23. A 150 m long train crosses a man walking at the speed of 5 km/hr in the opposite direction in 5 seconds. The speed of the train is",
        "(a) 95 km/hr",
        "(b) 98 km/hr",
        "(c) 101 km/hr",
        "(d) 103 km/hr",
        "Answer: (d) 103 km/hr ",
        ""
    ],
    [
        "Q24. A train passes two persons walking in the same direction in which the train is going. These persons are walking at the rate of 2 km/hr and 4 km/hr respectively and the train passes them completely in 10 seconds and 12 seconds respectively. The speed of the train is",
        "(a) 14 km/hr",
        "(b) 19 km/hr",
        "(c) 23 km/hr",
        "(d) 27 km/hr",
        "Answer: (a) 14 km/hr ",
        ""
    ],
    [
        "Q25. A train moving at the rate of 40 km/hr crosses a standing man in 10 seconds. It will crosses a plateform 60m long in",
        "(a) 15.40 sec",
        "(b) 18.56 sec",
        "(c) 22.29 sec",
        "(d) 25.14 sec",
        "Answer: (a) 15.40 sec ",
        ""
    ],
    [
        "Q26. Two trains travel in opposite directions at 35 km/hr and 40 km/hr. A man sitting in the slower train passes the faster train in 10 seconds. The length of the faster train is",
        "(a) 188.13 m",
        "(b) 192.62 m",
        "(c) 201.45 m",
        "(d) 208.33 m",
        "Answer: (d) 208.33 m ",
        ""
    ],
    [
        "Q27. Two trains running in opposite directions at 36 km/hr and 45 km/hr cross each other in 20 seconds. If one of the train is 200 m long, the length of the other train is",
        "(a) 235 m",
        "(b) 245 m",
        "(c) 250 m",
        "(d) 265 m",
        "Answer: (c) 250 m ",
        ""
    ],
    [
        "Q28. Two trains each 100 m long, moving in opposite directions cross each other in 10 seconds. If one is moving twice as fast as the other, then the speed of the faster train is",
        "(a) 48 km/hr",
        "(b) 53 km/hr",
        "(c) 58 km/hr",
        "(d) 67 km/hr",
        "Answer: (a) 48 km/hr ",
        ""
    ],
    [
        "Q29. A train 100 m long is running at 50 km/h. In what time will it pass a man running in the direction opposite to that of the train at 5 km/h ?",
        "(a) 5 3/11 sec",
        "(b) 5 6/11 sec",
        "(c) 6 6/11 sec",
        "(d) 7 9/11 sec",
        "Answer: (c) 6 6/11 sec ",
        ""
    ],
    [
        "Q30. Two trains 110 m and 95 m long run at the speed of 40 km and 70 km per hour respectively in opposite directions on parallel tracks. The time which they thake to cross each other is",
        "(a) 6.20 sec",
        "(b) 6.70 sec",
        "(c) 7.25 sec",
        "(d) 7.38 sec",
        "Answer: (b) 6.70 sec ",
        ""
    ],
    [
        "Q31. A train 80m long moving at a speed of 40 km/hr crosses a train 100 m long comming from opposite direction on parallel tracks in 5 sec. The speed of the second train is",
        "(a) 72.2 km/hr",
        "(b) 77.5 km/hr",
        "(c) 83.7 km/hr",
        "(d) 89.6 km/hr",
        "Answer: (d) 89.6 km/hr ",
        ""
    ],
    [
        "Q32. A train is running at the rate of 60 km/hr. A man is going in the same direction parallel to the train at 20 km/hr. If the train crosses the man in 18 seconds, the length of the train be",
        "(a) 200 m",
        "(b) 220 m",
        "(c) 225 m",
        "(d) 245 m",
        "Answer: (a) 200 m ",
        ""
    ],
    [
        "Q33. A 120 m long train takes 10 seconds to cross a man standing on a platform. The speed of the train is",
        "(a) 6 m/sec",
        "(b) 12 m/sec",
        "(c) 16 m/sec",
        "(d) 20 m/sec",
        "Answer: (b) 12 m/sec ",
        ""
    ],
    [
        "Q34. Two trains running in opposite directions cross a man standing on the platform in 25 secs and 15 seconds respectively and they cross each other in 20 seconds. The ratio of their speed is",
        "(a) 1 : 1",
        "(b) 1 : 2",
        "(c) 2 : 1",
        "(d) 2 : 3",
        "Answer: (a) 1 : 1 ",
        ""
    ],
    [
        "Q35. Convert 20 m/sec into km/hr",
        "(a) 65 km/hr",
        "(b) 68 km/hr",
        "(c) 72 km/hr",
        "(d) 79 km/hr",
        "Answer: (c) 72 km/hr ",
        ""
    ],
    [
        "Q36. A train travelling at 40 km/hr completely crosses another train having half its length and travelling in the opposite direction at 60 km/hr. in 9 seonds. If it passes a platform in 2 minutes, the length of the platform is",
        "(a) 1076.32 m",
        "(b) 1132.12 m",
        "(c) 1166.66 m",
        "(d) 1197.16 m",
        "Answer: (c) 1166.66 m ",
        ""
    ],
    [
        "Q37. A train 150 m long takes 10 seconds to cross a man walking at 5 km/hr in the direction opposite to that of the train. Find the speed of the train.",
        "(a) 45 km/hr",
        "(b) 49 km/hr",
        "(c) 53 km/hr",
        "(d) 55 km/hr",
        "Answer: (b) 49 km/hr ",
        ""
    ],
    [
        "Q38. A 80 m long train is running at 72 km/hr. In how much time will it cross an electric pole ?",
        "(a) 4 sec",
        "(b) 5 sec",
        "(c) 6 sec",
        "(d) 7 sec",
        "Answer: (a) 4 sec"
    ]
]