[
    [
        "Q1. At which sum, the simple interest at the rate of 3¼ per annum will be Rs. 210 in 2½ years.",
        "(a) 2311.25",
        "(b) 2355.30",
        "(c) 2584.60",
        "(d) 2716.90",
        "Answer: (c) 2584.60",
        ""
    ],
    [
        "Q2. A sum of money amount to Rs. 4200 in 4 years and to Rs. 4680 in 7 years at simple interest. The rate of interest per annum is",
        "(a) 3312",
        "(b) 3560",
        "(c) 3590",
        "(d) 3626",
        "Answer: (b) 3560 ",
        ""
    ],
    [
        "Q3. How much simple interest will Rs. 3000 earn in 18 months at 5% per annum",
        "(a) 225",
        "(b) 250",
        "(c) 262",
        "(d) 310",
        "Answer: (a) 225 ",
        ""
    ],
    [
        "Q4. A man deposited Rs. 300 for 2 years, Rs. 600 for 4 years and Rs. 1200 for 6 years. He received Rs. 1020 as the simple interest. The rate of interest per annum is",
        "(a) 10 %",
        "(b) 15 %",
        "(c) 20 %",
        "(d) 30 %",
        "Answer: (a) 10 % ",
        ""
    ],
    [
        "Q5. Simple interest on Rs. 600 for 4 years at 5.25% per annum is equal to the simple interest on 400 at 5% per annum for a certain period of time. The time period is ?",
        "(a) 5 years",
        "(b) 5.5 years",
        "(c) 6.3 years",
        "(d) 7.2 years",
        "Answer: (c) 6.3 years ",
        ""
    ],
    [
        "Q6. A borrows Rs. 800 at the rate of 12% per annum simple interest and B borrows Rs. 910 at the rate of 10% per annum simple interest. In how manny years will their amount of debts be equal ?",
        "(a) 8 years",
        "(b) 13 years",
        "(c) 19 years",
        "(d) 22 years",
        "Answer: (d) 22 years ",
        ""
    ],
    [
        "Q7. Rs. 5000 becomes Rs. 6200 in 4 years at a certain rate of interest. If the rate becomes 1.5 times of itself, the amount of the same principal in 5 years will be",
        "(a) 5536",
        "(b) 5996",
        "(c) 6886",
        "(d) 7250",
        "Answer: (d) 7250 ",
        ""
    ],
    [
        "Q8. If the simple interest for 5 years be equal to 25% of the principal, it will be equal to the principal after",
        "(a) 10 years",
        "(b) 20 years",
        "(c) 30 years",
        "(d) 40 years",
        "Answer: (b) 20 years ",
        ""
    ],
    [
        "Q9. Hari took a loan at simple interest at 6% in the first year with an increase of 0.5% in each subsequent year. He paid Rs. 3375 as interest after 4 years. How much loan did he take ?",
        "(a) 10950",
        "(b) 11750",
        "(c) 12500",
        "(d) 12700",
        "Answer: (c) 12500 ",
        ""
    ],
    [
        "Q10. At what rate of simple interest a certain sum will be doubled in 14 years",
        "Answer: ",
        ""
    ],
    [
        "Q11. Find S.I on Rs. 16250 at 6% p.a. for 73 days",
        "(a) 173",
        "(b) 195",
        "(c) 220",
        "(d) 237",
        "Answer: (b) 195 ",
        ""
    ],
    [
        "Q12. ",
        "(a) 153",
        "(b) 165",
        "(c) 193",
        "(d) 201",
        "Answer: (a) 153 ",
        ""
    ],
    [
        "Q13. A sum when reckoned at 10% S.I amounts to Rs. 2400 in 4 years. Find the sum.",
        "(a) 1575.75",
        "(b) 1610.30",
        "(c) 1612.50",
        "(d) 1714.30",
        "Answer: (d) 1714.30 ",
        ""
    ],
    [
        "Q14. A certain sum is invested on simple interest. If it trebles in 5 years, what is the rate of interest ?",
        "(a) 25 %",
        "(b) 35 %",
        "(c) 40 %",
        "(d) 50 %",
        "Answer: (c) 40 % ",
        ""
    ],
    [
        "Q15. In how many years, a sum will be thrice of it at the rate of 10% per annum ?",
        "(a) 8 years",
        "(b) 10 years",
        "(c) 15 years",
        "(d) 20 years",
        "Answer: (d) 20 years ",
        ""
    ],
    [
        "Q16. A man invests 1/2 of his capital at 6% per annum, 1/3 at 9% per annum and the remainder at 10% per annum. If his annual income is Rs. 560, the capital is",
        "(a) 6384.15",
        "(b) 6825.75",
        "(c) 7219.20",
        "(d) 7304.35",
        "Answer: (d) 7304.35 ",
        ""
    ],
    [
        "Q17. The sum of money that will give Rs. 1 as simple interest per day at the rate of 4% per annum is",
        "(a) 9036",
        "(b) 9125",
        "(c) 9810",
        "(d) 9985",
        "Answer: (b) 9125 ",
        ""
    ],
    [
        "Q18. The difference between the interest received from two different banks on Rs. 4000 for 2 years is Rs. 20. The difference between their rates is",
        "(a) 0.23",
        "(b) 0.25",
        "(c) 0.33",
        "(d) 0.47",
        "Answer: (b) 0.25 ",
        ""
    ],
    [
        "Q19. A sum of Rs. 500 amounts to Rs. 620 in 4 years. What will it amount to if the rate of interest is increased by 2% ?",
        "(a) 590",
        "(b) 630",
        "(c) 660",
        "(d) 720",
        "Answer: (c) 660 ",
        ""
    ],
    [
        "Q20. The simple interest at x% per annum for x years will be Rs. x on a sum of",
        "(a) 75/x",
        "(b) 100/x",
        "(c) 120/x",
        "(d) 150/x",
        "Answer: (b) 100/x ",
        ""
    ],
    [
        "Q21. On a certain sum, the simple interest at the end of 10½ years becomes 3/4 of the sum. What is the rate percent per annum ?",
        "Answer: ",
        ""
    ],
    [
        "Q22. If the annual rate of simple interest increases from 10% to 12½%, a man's annual income increases by Rs. 1250. The Principal is ",
        "(a) 5000",
        "(b) 15000",
        "(c) 30000",
        "(d) 50000",
        "Answer: (d) 50000 ",
        ""
    ],
    [
        "Q23. Rs. 3000 amount to Rs. 3600 in 5 years at simple interest. If the interest rate were increased by 3%, it would amount to how much ?",
        "(a) 3775",
        "(b) 3820",
        "(c) 4010",
        "(d) 4050",
        "Answer: (d) 4050 ",
        ""
    ],
    [
        "Q24. A certain sum of money becomes three times of itself in 10 years at simple interest. In how many years does it become double of itself at the same rate ?",
        "(a) 3 years",
        "(b) 4 years",
        "(c) 5 years",
        "(d) 7 years",
        "Answer: (c) 5 years ",
        ""
    ],
    [
        "Q25. If the simple interest on a certain sum of money for 18 months at 6½ % per annum exceeds the simple interest on the same sum for 8 months at 10½ % per annum by Rs. 33. The sum is",
        "(a) Rs 260",
        "(b) Rs 275",
        "(c) Rs 300",
        "(d) Rs 350",
        "Answer: (c) Rs 300 ",
        ""
    ],
    [
        "Q26. Simple interest on a certain sum at a certain annual rate of interest is 25/16 of the sum. If the numbers representing rate percent and time in years be equal, then rate percent per annum is",
        "(a) 12½ %",
        "(b) 13¼ %",
        "(c) 14½ %",
        "(d) 15¾ %",
        "Answer: (a) 12½ % ",
        ""
    ],
    [
        "Q27. The simple interest on a sum for 4 years is two-fifth of the sum. The rate percent per annum is",
        "(a) 7 %",
        "(b) 9 %",
        "(c) 10 %",
        "(d) 12 %",
        "Answer: (c) 10 % ",
        ""
    ],
    [
        "Q28. Rs. 2000 is invested at 5 % per annum simple interest. If the interest is added to the principal after every 10 years, the amount will become Rs. 4000 after ?",
        "Answer: (b) 16 ",
        ""
    ],
    [
        "Q29. A sum of Rs. 10 is lent to be returned in 11 monthly instalments of Rs 1 each, interest being simple. The rate of interest is",
        ""
    ],
    [
        "Q30. X, Y, Z are three sums of money such that Y is the simple interest on X and Z in the simple interest on y for the same time and rate. Which of the following is correct ?",
        "(a) y2 = xz",
        "(b) y = xz",
        "(c) x = yz",
        "(d) z2 = xy",
        "Answer: (a) y2 = xz ",
        ""
    ],
    [
        "Q31. What annual payment will discharge a debt of Rs. 630 due in 3 years at 5% per annum ?",
        "(a) Rs. 200",
        "(b) Rs. 220",
        "(c) Rs. 230",
        "(d) Rs. 235",
        "Answer: (a) Rs. 200 ",
        ""
    ],
    [
        "Q32. A farmer borrowed Rs. 5000 at 10% per annum. At the end of 5 years he cleared his account by paying Rs. 3000 and a cow. The cost of the cow is ?",
        "(a) Rs. 4000",
        "(b) Rs. 4200",
        "(c) Rs. 4500",
        "(d) Rs. 4800",
        "Answer: (c) Rs. 4500 ",
        ""
    ],
    [
        "Q33. A borrows Rs. 7000 at 10% per annum simple interest and B borrows Rs. 8000 at 8% per annum simple interest. In how many years will their amounts of debts be equal ?",
        "(a) 12 2/3 years",
        "(b) 14 2/3 years",
        "(c) 15 2/3 years",
        "(d) 16 2/3 years",
        "Answer: (d) 16 2/3 years ",
        ""
    ],
    [
        "Q34. A man losses Rs. 45 yearly when the annual rate of interest falls from 11% to 10%. His capital is",
        "(a) Rs 4500",
        "(b) Rs 4650",
        "(c) Rs 4700",
        "(d) Rs 4750",
        "Answer: (a) Rs 4500 ",
        ""
    ],
    [
        "Q35. A sum of money at simple interest amounts to Rs. 2200 in 3 years and Rs. 2500 in 5 years. The sum is",
        "(a) Rs 1600",
        "(b) Rs 1625",
        "(c) Rs 1750",
        "(d) Rs 1780",
        "Answer: (c) Rs 175"
    ]
]