[
    [
        "Q1. A can do a work in 4 days and B can do the same work",
        "(a) 1 days",
        "(b) 1 days 5/7 hours",
        "(c) 2 days 3 hours",
        "(d) 3 days",
        "Answer: (b) 1 days 5/7 hours",
        ""
    ],
    [
        "Q2. A and B complete a work in 6 days. If can A can",
        "(a) 1 days",
        "(b) 1 days 5/7 hours",
        "(c) 2 days 3 hours",
        "(d) 3 days",
        "Answer: (b) 1 days 5/7 hours",
        ""
    ],
    [
        "Q3. A and B can complete a work in 30 days, while B and C",
        "(a) 12 days",
        "(b) 13 days",
        "(c) 16 days",
        "(d) 18 days",
        "Answer: (d) 18 days",
        ""
    ],
    [
        "Q4. A can do a piece of work in 20 days. He works it for",
        "(a) 6 days",
        "(b) 8.5 days",
        "(c) 10.3 days",
        "(d) 12 days",
        "Answer: (b) 8.5 days",
        ""
    ],
    [
        "Q5. A and B together can complete a piece of work in 72",
        "(a) 35 days",
        "(b) 40 days",
        "(c) 48 days",
        "(d) 60 days",
        "Answer: (d) 60 days",
        ""
    ],
    [
        "Q6. A can complete a work in 2 days and B can complete",
        "(a) 2 days",
        "(b) 4 days",
        "(c) 6 days",
        "(d) 7 days",
        "Answer: (c) 6 days",
        ""
    ],
    [
        "Q7. A can complete a work in 15 days and B can complete",
        "(a) 6 days",
        "(b) 7 days",
        "(c) 8 days",
        "(d) 9 days",
        "Answer: (d) 9 days",
        ""
    ],
    [
        "Q8. Ram and Rohit together can finish a job in 10 days. Ram can do the same job on his own in 12 days. How long will Rohit take to do the job by himself",
        "(a) 40 days",
        "(b) 60 days",
        "(c) 80 days",
        "(d) 100 days",
        "Answer: (b) 60 days",
        ""
    ],
    [
        "Q9. A does 20% less work than B. If A can complete a piece of work in 7(1/2) hours, then B can do it in",
        "(a) 4 hrs",
        "(b) 5 hrs",
        "(c) 6 hrs",
        "(d) 8 hrs",
        "Answer: (c) 6 hrs",
        ""
    ],
    [
        "Q10. 4 men or 6 women can do a work in 12 days. How long will 6 men and 6 women take to finish the work",
        "(a) 4 days",
        "(b) 4(4/5) days",
        "(c) 5(1/2) days",
        "(d) 4(1/2) days",
        "Answer: (b) 4(4/5) days ",
        ""
    ],
    [
        "Q11. 10 men can finish the construction of a wall in 12 days. How many men are added to finish the work in half a day ?",
        "(a) 120",
        "(b) 220",
        "(c) 230",
        "(d) 240",
        "Answer: (c) 230 ",
        ""
    ],
    [
        "Q12. 20 men complete one third of a piece of work in 20 days. How many more men should be employed to finish the rest of the work in 25 more days ?",
        "(a) 12",
        "(b) 15",
        "(c) 22",
        "(d) 25",
        "Answer: (a) 12 ",
        ""
    ],
    [
        "Q13. If 36 men can do a piece of work in 25 days, in how many days will 12 men do it ?",
        "(a) 35",
        "(b) 56",
        "(c) 75",
        "(d) 80",
        "Answer: (c) 75 ",
        ""
    ],
    [
        "Q14. The A Minar casts a shadow of 180m long at the same time when the B Minar casts a shadow of 120m long on the ground. If the height of the B Minar is 80m, what is the height of the A minar ?",
        "(a) 105m",
        "(b) 115m",
        "(c) 120m",
        "(d) 135m",
        "Answer: (c) 120m ",
        ""
    ],
    [
        "Q15. 6 men can finish a piece of work in 30 days. If 3 men more join with them then the work will be completed in",
        "(a) 18",
        "(b) 20",
        "(c) 22",
        "(d) 24",
        "Answer: (b) 20 ",
        ""
    ],
    [
        "Q16. 10 women can complete a work in 6 days and 10 children take 12 days to complete the work. How many days will 6 women and 4 children together take to complete the work ?",
        "(a) 7½ days",
        "(b) 8½ days",
        "(c) 9½ days",
        "(d) 10½ days",
        "Answer: (a) 7½ days ",
        ""
    ],
    [
        "Q17. 5 men can complete a work in 10 days and the same work 6 women can complete in 15 days. How many days will 2 men and 3 women together take to complete the work ?",
        "(a) 12(3/11) days",
        "(b) 13(7/11) days",
        "(c) 15(3/7) days",
        "(d) 16(5/11) days",
        "Answer: (b) 13(7/11) days ",
        ""
    ],
    [
        "Q18. Ram can do a work in 15 days. Rahim is 50% more efficient than Ram. The number of days, Rahim will take to do the same piece of work is",
        "(a) 7 days",
        "(b) 8 days",
        "(c) 10 days",
        "(d) 13 days",
        "Answer: (c) 10 days ",
        ""
    ],
    [
        "Q19. Hari can do a work in 28 days. Jadu is 40% more efficient than Hari. The number of days, Jadu will take to do the same piece of work is",
        "(a) 8 days",
        "(b) 10 days",
        "(c) 15 days",
        "(d) 20 days",
        "Answer: (d) 20 days ",
        ""
    ],
    [
        "Q20. A works twice fast as B. If both of them can together finish a piece of work in 15 days then B alone can do it in",
        "(a) 28 days",
        "(b) 33 days",
        "(c) 37 days",
        "(d) 45 days",
        "Answer: (d) 45 days ",
        ""
    ],
    [
        "Q21. A alone can finish a work in 10 days which B alone can finish in 15 days. If they work together and finish it, then out of a total wages of Rs. 2000, A will get",
        "(a) Rs. 1200",
        "(b) Rs. 1300",
        "(c) Rs. 1400",
        "(d) Rs. 1500",
        "Answer: (a) Rs. 1200 ",
        ""
    ],
    [
        "Q22. 12 women can complete a work in 8 days and 9 girl take 12 days to complete the work. How many days will 6 women and 9 girl take to complete the work ?",
        "(a) 5(5/7) days",
        "(b) 6(6/7) days",
        "(c) 8(1/3) days",
        "(d) 11(3/7) days",
        "Answer: (b) 6(6/7) days ",
        ""
    ],
    [
        "Q23. A man, a women and a boy can together complete a piece of work in 3 days. If a man alone can do it in 6 days and a boy alone in 18 days, how long will a women take to complete the work ?",
        "(a) 9 days",
        "(b) 11 days",
        "(c) 13 days",
        "(d) 16 days",
        "Answer: (a) 9 days ",
        ""
    ],
    [
        "Q24. 8 men working 8 hours a day can complete a piece of work in 14 days. In how many days can 6 men working for 9 hours a day, complete the same piece of work ?",
        "(a) 13(11/29) days",
        "(b) 16(16/27) days",
        "(c) 17(13/17) days",
        "(d) 19(3/11) days",
        "Answer: (b) 16(16/27) days ",
        ""
    ],
    [
        "Q25. 9 children can complete a piece of work in 360 days; 18 men can complete the same piece of work in 72 days and 12 women can complete it in 162 days. In how many days can 4 men, 12 women and 10 children together complete the piece of work ?",
        "(a) 57 days",
        "(b) 66 days",
        "(c) 71 days",
        "(d) 81 days",
        "Answer: (d) 81 days ",
        ""
    ],
    [
        "Q26. If 6 men or 10 women can finish a piece of work in 20 days, 4 men and 5 women will do the same work in",
        "(a) 14(1/7) days",
        "(b) 15(1/7) days",
        "(c) 17(1/7) days",
        "(d) 19(1/7) days",
        "Answer: (c) 17(1/7) days ",
        ""
    ],
    [
        "Q27. A can do ¼ th part of the work in 10 days. B can do 40% of the work in 40 days and c can do 1/3rd of the work in 13 days. Who will complete the work first ?",
        "(a) A",
        "(b) B",
        "(c) C",
        "(d) All will complete the work on same time",
        "Answer: (c) C ",
        ""
    ],
    [
        "Q28. A can build a wall in 30 days, while B alone can build it in 40 days. If they build it together and get a payment of Rs. 14000, what is B's share ?",
        "(a) Rs. 5000",
        "(b) Rs. 6000",
        "(c) Rs. 6500",
        "(d) Rs. 7000",
        "Answer: (b) Rs. 6000 ",
        ""
    ],
    [
        "Q29. A can do a piece of work in 50 days which B alone can finish in 40 days. Both together work for 10 days and then A leaves off. How many days will B take to finish the remaining work ?",
        "(a) 15 days",
        "(b) 18 days",
        "(c) 19 days",
        "(d) 22 days",
        "Answer: (d) 22 days ",
        ""
    ],
    [
        "Q30. A can do a piece of work in 18 days which B can do it in 10 days. B work at it for 9 days. A can finish the remaining work in",
        "(a) 1(4/5) days",
        "(b) 3¾ days",
        "(c) 3½ days",
        "(d) 5½ days",
        "Answer: (a) 1(4/5) days ",
        ""
    ],
    [
        "Q31. A and B can finish a piece of work in 30 days. They worked at it for 20 days and then B left. The remaining work was done by A alone in 20 more days. A alone can finish the work in",
        "(a) 47 days",
        "(b) 52 days",
        "(c) 60 days",
        "(d) 72 days",
        "Answer: (c) 60 days ",
        ""
    ],
    [
        "Q32. A and B undertook to do a piece of work for Rs. 4500. A alone should do it in 8 days and B alone in 12 days. With the assistance of C they finished the work in 4 days. C's share of money is",
        "(a) Rs. 695",
        "(b) Rs. 710",
        "(c) Rs. 750",
        "(d) RS. 800",
        "Answer: (c) Rs. 750"
    ]
]