[
    [
        "Q.1 Which of the following deals with economic offences?",
        "(A) MISA (B) NSA (C) TADA (D) COFEPOSA",
        " Ans .D",
        ""
    ],
    [
        "Q.2 In India, inflation is measured by",
        "(A) wholesale price index number",
        "(B) consumer price index for urban non-manual workers",
        "(C) consumer price index for agricultural workers",
        "(D) national income deflation",
        " Ans .D",
        ""
    ],
    [
        "Q.3 Which of the following programs meets the credit needs of poor women?",
        "(A) Mahila Samriddhi Yojna",
        "(B) Rashtriya Mahila Kosh",
        "(C) Indira Mahila Yojna",
        "(D) Mahila Samakhya Programme",
        " Ans .B",
        ""
    ],
    [
        "Q.4 National income is the",
        "(A) Net National Product at Market price",
        "(B) Net National product at factor coast",
        "(C) net domestic product at market price",
        "(D) net domestic product at factor cost",
        " Ans .C",
        ""
    ],
    [
        "Q.5 Which of the following programs aims at the promotion of savings among rural women?",
        "(A) Rashtriya Mahila Kosh",
        "(B) Mahila Samriddhi Yojna",
        "(C) Indira Mahila Yojna",
        "(D) Javhar Rozgar Yojna",
        " Ans .B",
        ""
    ],
    [
        "Q.6 Which is the largest commercial bank in India?",
        "(A) Reserve Bank of India",
        "(B) State Bank of India",
        "(C) ICICI Bank",
        "(D) Bank of India",
        " Ans .B",
        ""
    ],
    [
        "Q.7 Bank of Hindustan is the oldest bank in India. When did it start functioning?",
        "(A) 1990",
        "(B) 1770",
        "(C) 1885",
        "(D) 1892",
        " Ans .B",
        ""
    ],
    [
        "Q.8 The Bank of Calcutta, Bank of Bombay and Bank of Madras were merged in 1921 to form",
        "(A) Reserve Bank of India",
        "(B) Imperial Bank of India",
        "(C) Bank of India",
        "(D) Union Bank of India",
        " Ans .B",
        ""
    ],
    [
        "Q.9 When was the Reserve Bank of India established?",
        "(A) 1935",
        "(B) 1920",
        "(C) 1928",
        "(D) 1947",
        " Ans .A",
        ""
    ],
    [
        "Q.10 When was the Imperial Bank of India nationalized to form the State Bank of India?",
        "(A) 1947",
        "(B) 1949",
        "(C) 1951",
        "(D) 1955",
        " Ans .D",
        ""
    ],
    [
        "Q.11 Which of the following is not an event in ancient Indian history in BC era?",
        "[A] Foundation of the Indo-Greek empire",
        "[B] Beginning of Vikram samvat Era",
        "[C] Fourth Buddhist Council",
        "[D] Hathigumpha inscription by Kharvela",
        " Ans .C",
        ""
    ],
    [
        "Q.12 Which of the following was most probably the rst metal to be used in India?",
        "[A] Iron",
        "[B] Copper",
        "[C] Gold",
        "[D] Silver",
        " Ans .B",
        ""
    ],
    [
        "Q.13 The Jorwe culture of ancient India has been named after site of the same name in which of the following states?",
        "[A] Rajasthan",
        "[B] Gujarat",
        "[C] Karnataka",
        "[D] Maharashtra",
        " Ans .D",
        ""
    ],
    [
        "Q.14 Which of the following terms is not associated with a tool tradition of ancient India / World?",
        "[A] Mousterian",
        "[B] Acheulean",
        "[C] Oldowan",
        "[D] Grotian",
        " Ans .D",
        ""
    ],
    [
        "Q.15 In stone age, the Microliths were most commonly found in which of the following ages?",
        "[A] Paleolithic",
        "[B] Mesolithic",
        "[C] Neolithic",
        "[D] Chalcolithic",
        " Ans .B",
        ""
    ],
    [
        "Q.16 Which of the following is a correct statement about Indus Valley Civilization?",
        "[A] Both Harappa and Mohejodero are is located on the banks of Indus River",
        "[B] Both Chanhudaro and Kalibangan were located within the boundaries of present day Rajasthan.",
        "[C] Both Surkotada and Dholavira are located in Katch of Gujarat",
        "[D] Lothal site was located on bank of Narmada river",
        " Ans .C",
        ""
    ],
    [
        "Q.17 Which of the following is not a correct statement about Buddhist Canonical literature?",
        "[A] Abhidhamma Pitaka was compiled in third Buddhist Council",
        "[B] Digha Nikaya is a part of the Sutta Pitaka",
        "[C] Vinaya Pitaka primarily deals with monastic rules",
        "[D] Sutta Pitaka deals with philosophy and psychology",
        " Ans .D",
        ""
    ],
    [
        "Q.18 Which of the following rulers were closely associated with Yuehzhi nomadic people?",
        "[A] Shaka",
        "[B] Kushana",
        "[C] Pahalva",
        "[D] None of them",
        " Ans .B",
        ""
    ],
    [
        "Q.19 Which of the following ancient Indian sages did not make substantial contribution to the YOGCRA (Yogachara) philosophical tradition?",
        "[A] Vasubandhu",
        "[B] Dinnaga",
        "[C] Dharmakirti",
        "[D] Nagarjuna",
        " Ans .D",
        ""
    ],
    [
        "Q.20 Vindhyashakti was founder of which of the following dynasties in ancient India?",
        "[A] Vakataka",
        "[B] Kakatiya",
        "[C] Kalachuri",
        "[D] Chalukyas of Badami",
        " Ans .A",
        ""
    ],
    [
        "Q.21 Grand Central Terminal, Park Avenue, New York is the world's",
        "(A) largest railway station",
        "(B) highest railway station",
        "(C) longest railway station",
        "(D) None of the above",
        " Ans .A",
        ""
    ],
    [
        "Q.22 Entomology is the science that studies",
        "(A) Behavior of human beings",
        "(B) Insects",
        "(C) The origin and history of technical and scientific terms",
        "(D) The formation of rocks",
        " Ans .B",
        ""
    ],
    [
        "Q.23 Eritrea, which became the 182nd member of the UN in 1993, is in the continent of",
        "(A) Asia",
        "(B) Africa",
        "(C) Europe",
        "(D) Australia",
        " Ans .B",
        ""
    ],
    [
        "Q.24 Garampani sanctuary is located at",
        "(A) Junagarh, Gujarat",
        "(B) Diphu, Assam",
        "(C) Kohima, Nagaland",
        "(D) Gangtok, Sikkim",
        " Ans .B",
        ""
    ],
    [
        "Q.25 For which of the following disciplines is Nobel Prize awarded?",
        "(A) Physics and Chemistry",
        "(B) Physiology or Medicine",
        "(C) Literature, Peace and Economics",
        "(D) All of the above",
        " Ans .D",
        ""
    ],
    [
        "Q.26 Hitler party which came into power in 1933 is known as",
        "(A) Labour Party",
        "(B) Nazi Party",
        "(C) Ku-Klux-Klan",
        "(D) Democratic Party",
        " Ans .B",
        ""
    ],
    [
        "Q.27 Which of the following canals is considered to be an important link between the developed countries and the developing countries?",
        "(A) Panama Canal (B) Suez Canal (C) Kiel Canal (D) Grand Canal",
        " Ans .  B",
        ""
    ],
    [
        "Q.28 Which of the following is NOT a petrochemical centre of India?",
        "(A) Koyali (B) Jamnagar (C) Mangalore (D) Rourkela",
        " Ans .  D",
        ""
    ],
    [
        "Q.29 Which of the following is a correct sequence of sea ports of India from South to North?",
        "(A) Cochin ThiruvananthapuramCalicutMangalore (B) Calicut Thiruvananthapuram Cochin Mangalore (C) Thiruvananthapuram Cochin Calicut Mangalore (D) Thiruvananthapuram Calicut Mangalore Cochin",
        " Ans .  C",
        ""
    ],
    [
        "Q.30 Myanmar does not share its international boundary with__?",
        "(A) Laos (B) Thailand (C) Vietnam (D) India",
        " Ans .  C",
        ""
    ],
    [
        "Q.31 Barclays Chairman Marcus Agius was recently compelled to resign for being involved in a scandal which has dealt a devastating blow to the banks reputation. The scandal is related to:",
        "[A] Insider trading[B] LIBOR interest rates[C] Money laundering[D] Credit Default Swap",
        " Ans .  B",
        ""
    ],
    [
        "Q.32 Who among the following has become the third cricketer from India, after Mohammed Azharuddin and Ajay Sharma in 2000, to suffer a life ban for bringing the game into disrepute?",
        "[A] T.Sudhindra[B] Abhinav Bali[C] Shalabh Srivastava[D] Mohnish Mishra",
        " Ans .  A",
        ""
    ],
    [
        "Q.33 Which online travel portal has acquired Travelguru, the Indian arm of US travel services provider Travelocity, to become the largest provider of hotel bookings in the country?",
        "[A] Tripadvisor.com[B] Yatra.com[C] Makemytrip.com[D] Cleartrip.com",
        " Ans .  B",
        ""
    ],
    [
        "Q.34 Sistema Shyam Teleservices Ltd.(SSTL) lost 21 licences after the Indian Supreme Court cancelled all 2G spectrum licences in February, 2012. Sistema, which holds a 53 per cent stake in SSTL is a _______ conglomerate.",
        "[A] German[B] Ukrainian[C] Russian[D] Italian",
        " Ans .  C",
        ""
    ],
    [
        "Q.35 Which of the following places was recently attacked by armed militants from the fundamentalist Ansar Dine group just two days after it was named as an endangered world heritage site by UNESCO?",
        "[A] Baku,Azerbaijan[B] Zabid,Yemen[C] Timbuktu, Mali[D] Bamiyan Valley, Afghanistan",
        " Ans .  C",
        ""
    ],
    [
        "Q.36 Who among the following was recently appointed as the director of ISRO Satellite Centre (ISAC)?",
        "[A] S.K.Shivakumar[B] T.K.Alex[C] Roddam Narasimha[D] A.Sivathanu Pillai",
        " Ans .  A",
        ""
    ],
    [
        "Q.37 Which among following has recently been included by UNESCO in its coveted list of World Heritage Sites?",
        "[A] Silk Route sites in India[B] Matheran Light Railway Network[C] Riverine Island of Majuli[D] Western Ghats",
        " Ans .  D",
        ""
    ],
    [
        "Q.38 Consider the following Statements:1.There are 12 Millenium Development Goals(MDGs) which have to be met by 2015.2.According to the latest United Nations Report, India is likely to miss the Millennium Development Goal (MDG) related to maternal health.Which among the above Statement(s) is/are correct?",
        "[A] Only 1[B] Only 2[C] Both 1 and 2[D] Neither 1 nor 2",
        " Ans .  B",
        ""
    ],
    [
        "Q.39 The 2012 UEFA European Football Championship, commonly referred to as Euro 2012 was won by :",
        "[A] Spain[B] Italy[C] Portugal[D] Germany",
        " Ans .  A",
        ""
    ],
    [
        "Q.40 Which Panel/Committee has recently given recommendations for deletion of cartoons on politicians and bureaucrats from the National Council of Educational Research and Training (NCERT) textbooks?",
        "[A] Yash Pal Committee[B] D.S Kothari Committee[C] G.V.Ramakrishna Panel[D] S.K.Thorat Panel",
        " Ans .  D "
    ]
]