[
    [
        "Q.1. Sugarcane Research Institute is located at ",
        "A. Aduthurai B. Cuttack C. Madurai D. Coimbatore",
        " Ans .D",
        ""
    ],
    [
        "Q.2. Where is the Indian Forest Research Institute located? ",
        "A. Lucknow B. Bhopal C. Shimla D. Dehradun",
        " Ans .D",
        ""
    ],
    [
        "Q.3. Meghalaya State was created on ",
        "A. 1960 B. 1962 C. 1966 D. 1972",
        " Ans .D",
        ""
    ],
    [
        "Q.4. The term Lok Sabha is normally ",
        "A. 2 years B. 4 years C. 5 years D. 7 years",
        " Ans .C",
        ""
    ],
    [
        "Q.5. The Headquarters of SAARC is ",
        "A. Dhaka B. New Delhi C. Karachi D. Kathmandu",
        " Ans .D",
        ""
    ],
    [
        "Q.6. Which of the following is of the highest nutritive value? ",
        "A. Maize B. Arhar C. Groundnut D. Soybean",
        " Ans .D",
        ""
    ],
    [
        "Q.7. Cow Milk is a rich source of ",
        "A. Vitamin A B. Vitamin B C. Vitamin C D. Vitamin D",
        " Ans .A",
        ""
    ],
    [
        "Q.8. The first synthetic fibre made by man was ",
        "A. Polyester B. Rayon C. Terrycloth D. Nylon",
        " Ans .D",
        ""
    ],
    [
        "Q.9. Which variety of Glass is heat resistant? ",
        "A. Pyrex Glass B. Flint Glass C. Hard Glass D. Soft Glass",
        " Ans .A",
        ""
    ],
    [
        "Q.10. Which of the following is used as a coolant in nuclear reactors? ",
        "A. Cadmium B. Graphite C. Heavy water D. Liquid Sodium",
        " Ans .D",
        ""
    ],
    [
        "Q.11. Which of the following wild life sanctuaries is in Assam? ",
        "A. Periyar B. Sunder ban C. Dudwa D. Manas",
        " Ans .D",
        ""
    ],
    [
        "Q.12. Which Indian state is the largest producer of pepper? ",
        "A. Karnataka B. Tamil Nadu C. Kerala D. Manipur",
        " Ans .C",
        ""
    ],
    [
        "Q.13. The Kakarpara project is on the river ",
        "A. Tabi B. Narmada C. Khosi D. Sutlej",
        " Ans .A",
        ""
    ],
    [
        "Q.14. Jaldapara Sanctuary is located in ",
        "A. Madhya Pradesh B. Tamil Nadu C. Assam D. West Bengal",
        " Ans .D",
        ""
    ],
    [
        "Q.15. Which of the following is known as the Holy Land? ",
        "A. Mecca B. Palestine C. Naples C. Jerusalem",
        " Ans .B",
        ""
    ],
    [
        "Q.16. Which continent is known as Dark Continent? ",
        "A. America B. Asia C. Australia D. Africa",
        " Ans .D",
        ""
    ],
    [
        "Q.17. Which of the following Gas causes heart diseases? ",
        "A. Ozone B. Sulphur Dioxide C. Carbon Monoxide D. Carbon Dioxide",
        " Ans .C",
        ""
    ],
    [
        "Q.18. Which of the following is a cold-blooded animal? ",
        "A. Whale B. Otter C. Tortoise D. Selman",
        " Ans .C",
        ""
    ],
    [
        "Q.19. The percentage of white population in South Africa is ",
        "A. 19% B. 25% C. 40% D. 20%",
        " Ans .A",
        ""
    ],
    [
        "Q.20. The orbit along which the earth is approximately? ",
        "A. Irregular B. Elliptical C. Circular D. Rectangular",
        " Ans .B",
        ""
    ],
    [
        "Q.21. The Asiatic Society was established in Calcutta by ",
        "A. Sir William Jones B. Raja Ram Mohan Roy C. Warren Hastings D. Warren Buffett",
        " Ans .A",
        ""
    ],
    [
        "Q.22. Delhi became the capital of India in ",
        "A. 1911 B. 1912 C. 1916 D. 1917",
        " Ans .A",
        ""
    ],
    [
        "Q.23. The last Governor General of India was ",
        "A. Lord Canning B. Lord Dalhousie C. Lord Mountbatten D. C. Rajagopalachari",
        " Ans .D",
        ""
    ],
    [
        "Q.24. The first session of Indian National Congress was held at ",
        "A. Bombay B. Surat C. Calcutta D. Nagpur",
        " Ans .A",
        ""
    ],
    [
        "Q.25. Pandit Jawaharlal Nehru was born in the year ",
        "A. 1889 B. 1899 C. 1900 D. 1901",
        " Ans .A",
        ""
    ],
    [
        "Q.26. The Judges of the Supreme Court can be removed by ",
        "A. Prime Minister B. Law Minister C. Parliament D. President",
        " Ans .C",
        ""
    ],
    [
        "Q.27. Which of the following is the best conductor of electricity? ",
        "A. Rain water B. Ordinary water C. Sea water D. River water",
        " Ans .C",
        ""
    ],
    [
        "Q.28. Sambhar Lake is situated in ",
        "A. Madhya Pradesh B. Rajasthan C. Gujarat D. Uttar Pradesh",
        " Ans .B",
        ""
    ],
    [
        "Q.29. The smallest Union Territory is ",
        "A. Andaman &amp; Nicobar Islands B. Pondicherry C. Lakshadweep D. Meghalaya",
        " Ans .C",
        ""
    ],
    [
        "Q.30. Sahara Desert is in ",
        "A. Asia B. Africa C. Europe D. North America",
        " Ans .B",
        ""
    ],
    [
        "Q.31. Atmospheric humidity is measured by ",
        "A. Anemometer B. Hydrometer C. Psychrometer D. Ammeter",
        " Ans .C",
        ""
    ],
    [
        "Q.32. Mycology is the study of ",
        "A. Fungi B. Virus C. Hydrilla D. Taxol",
        " Ans .A",
        ""
    ],
    [
        "Q.33. What is the name of the nuclear reactor at Tromboy? ",
        "A. Bhaba B. Apsara C. Venus D. Dhruva",
        " Ans .B",
        ""
    ],
    [
        "Q.34. Television was discovered by ",
        "A. Bohr B. Becquerel C. J.L. Baird D. Graham Bell",
        " Ans .C",
        ""
    ],
    [
        "Q.35. Finance Commission is constituted every ",
        "A. 2 years B. 4 years C. 5 years D. 7 years",
        " Ans .C",
        ""
    ],
    [
        "Q.36. The Finance Commission is appointed after every ",
        "A. 2 years B. 3 years C. 4 years D. 5 years",
        " Ans .D",
        ""
    ],
    [
        "Q.37. Renaissance started first in ",
        "A. Russia B. England C. Italy D. America",
        " Ans .C",
        ""
    ],
    [
        "Q.38. Which of the following is a micronutrient? ",
        "A. Carbon B. Zinc C. Nitrogen D. Hydrogen",
        " Ans .B",
        ""
    ],
    [
        "Q.39. The number of thermal power plants situated in India is ",
        "A. 109 B. 208 C. 290 D. 310",
        " Ans .D",
        ""
    ],
    [
        "Q.40. Which of the following was not one of the important port towns of the cholas? ",
        "A. Korkai B. Mahabalipuram C. Kaveripattinam D. Masula",
        " Ans .D "
    ]
]