[
    [
        "1. Which Police Station is ranked as one of the best Police Stations of India?",
        "A.Hoshangabad",
        "B.Raipur",
        "C.Nauthala",
        "D.Nadaun",
        "Answer: Option D",
        ""
    ],
    [
        "2. Who is the author of 'His Holiness the Fourteenth Dalai Lama: An Illustrated Biography'?",
        "A.26th",
        "B.36th",
        "C.Tenzin Geyche Tethong",
        "D.46th",
        "Answer: Option C",
        ""
    ],
    [
        "3. According to the report on \"Cancer preparedness in Asia-Pacific: Progress towards universal cancer control\", what is India's rank for cancer preparedness among 10 Asia-Pacific countries?",
        "A.3",
        "B.6",
        "C.8",
        "D.5",
        "Answer: Option C",
        ""
    ],
    [
        "4. Who is the author of the book, 'Mahaveer: The Soldier who never died'?",
        "A.Kiran Desai",
        "B.Amitav Ghosh",
        "C.A.K. Srikumar",
        "D.Aravind Adiga",
        "Answer: Option C",
        ""
    ],
    [
        "5. Liberty General Insurance launches 1st of its kind innovative service 'Liberty Assure'. Who is CEO of Liberty General Insurance?",
        "A.Shikha Sharma",
        "B.Roopam Asthana",
        "C.Aditya Puri",
        "D.Sanjay Agarwal",
        "Answer: Option B",
        ""
    ],
    [
        "6. Who has authored a book titled 'Overdraft: Saving the Indian Saver', which focuses on the issue of Non-Performing Assets that has affected Indian banking in recent years and also its causes?",
        "A.Viral Acharya",
        "B.Urjit Patel",
        "C.Raghuram Rajan",
        "D.Nirmala Sitharaman",
        "Answer: Option B",
        ""
    ],
    [
        "7. According to the \"INFORM Report 2020: Shared evidence for managing crises and disasters\" released by research centre INFORM, what is India's rank?",
        "A.38",
        "B.31",
        "C.34",
        "D.37",
        "Answer: Option B",
        ""
    ],
    [
        "8. What is India rank in the 2020 Sustainable Development Goals Index?",
        "A.132",
        "B.112",
        "C.117",
        "D.143",
        "Answer: Option C",
        ""
    ],
    [
        "9. Who is writer of the book 'Bharatiya Loktanktra Ka Koras: Kuch Bisari Bikhari Dhwaniyan'?",
        "A.Priyamvad",
        "B.Hrishikesh Sulabh",
        "C.Indira Dangi",
        "D.Chitra Mudgal",
        "Answer: Option A",
        ""
    ],
    [
        "10. According to the report, \"State of World Population 2020: Against my will - Defying the practices that harm women and girls and undermine equality\" India accounts for how many \"missing females\" over the past 50 years?",
        "A.45.8 million",
        "B.55.8 million",
        "C.65.8 million",
        "D.35.8 million",
        "Answer: Option A",
        ""
    ],
    [
        "11. Who release the first ever report on illegal wildlife trade titled \"Money Laundering and the Illegal Wildlife Trade\"?",
        "A.World Bank",
        "B.Financial Action Task Force",
        "C.Asian Development Bank",
        "D.New Development Bank",
        "Answer: Option B",
        ""
    ],
    [
        "12. Which Indian city become the only city in the country to be included in the world's top-30 startup ecosystem ranking in Global Startup Ecosystem Report 2020 by Startup Genome?",
        "A.Mumbai",
        "B.Surat",
        "C.Bangalore",
        "D.Delhi",
        "Answer: Option C",
        ""
    ],
    [
        "13. What is the name of behaviour change campaign launched by NITI Aayog, in partnership with Bill and Melinda Gates Foundation, Ashoka University, and the Ministries of Health and Ministry of Women and Child Development?",
        "A.Navigating the New Normal",
        "B.Behaving in the New Normal",
        "C.Starting the New Normal",
        "D.Living the New Normal",
        "Answer: Option A",
        ""
    ],
    [
        "14. Who released report titled \"Lives Upended How COVID-19 threatens the futures of 600 million South Asian children\"?",
        "A.UNICEF",
        "B.ECOSOC",
        "C.UNCTAD",
        "D.UNEP",
        "Answer: Option A",
        ""
    ],
    [
        "15. India has retained and consolidated its position at which number in terms of purchasing power parity (PPP) for 2017?",
        "A.7",
        "B.3",
        "C.2",
        "D.5",
        "Answer: Option B",
        ""
    ],
    [
        "16. The Supreme Court asked the government to treat a writ petition, for setting up expert panels to improve India's performance in which index?",
        "A.Food safety index",
        "B.Nature Inde",
        "C.Rule of Law Index",
        "D.World Competitive Index",
        "Answer: Option C",
        ""
    ],
    [
        "17. Approximately how much percent of the world's population were displaced according to Global Trends- Forced Displacement in 2019 report released by United Nations High Commissioner for Refugees in 2019?",
        "A.4%",
        "B.0.5%",
        "C.2%",
        "D.1%",
        "Answer: Option D",
        ""
    ],
    [
        "18. According to the \"Global Status Report on Preventing Violence Against Children 2020\", by United Nations, how many children are affected by physical, sexual or psychological violence?",
        "A.1 billion",
        "B.2 billion",
        "C.0.5 billion",
        "D.3 billion",
        "Answer: Option A",
        ""
    ],
    [
        "19. What is India's position in largest holder of US government securities at the end of April 2020 with a holding worth USD 157.4 billion?",
        "A.6th",
        "B.12th",
        "C.8th",
        "D.4th",
        "Answer: Option B",
        ""
    ],
    [
        "20. PM launched the 'Garib Kalyan Rozgar Abhiyaan' employment scheme for migrant workers from how many states who returned to their home states during the coronavirus-induced lockdown?",
        "A.5",
        "B.6",
        "C.4",
        "D.7",
        "Answer: Option B",
        ""
    ],
    [
        "21. Following reports of relaxation in lockdown by various major economies around the world, on 19th June 2020, the WHO has warned that this could lead to a new and dangerous phase of the Covid-19 pandemic. Who is Director-General of WHO?",
        "A.Tedros Adhanom",
        "B.Guy Ryder",
        "C.Bishar Abdirahman Hussein",
        "D.Petteri Taalas",
        "Answer: Option A",
        ""
    ],
    [
        "22. The Reserve Bank of India on 19th June 2020 has extended the regulatory restrictions imposed on PMC Bank by how many months?",
        "A.9",
        "B.3",
        "C.12",
        "D.6",
        "Answer: Option D",
        ""
    ],
    [
        "23. Who inaugurated and flagged off India's first Infectious disease diagnostic lab for COVID-19 testing in rural and inaccessible areas of India?",
        "A.Nirmala Sitharaman",
        "B.D.V. Sadananda Gowda",
        "C.Nitin Jairam Gadkari",
        "D.Dr. Harsh Vardhan",
        "Answer: Option D",
        ""
    ],
    [
        "24. Who is the writer of the novel - A Burning?",
        "A.Vikram Seth",
        "B.Ravinder Singh",
        "C.Megha Majumdar",
        "D.Amish Tripathi",
        "Answer: Option C",
        ""
    ],
    [
        "25. Indian economy is to grow by how much percent in 2021-22 according to ADB's Asian Development Outlook report?",
        "A.6%",
        "B.7%",
        "C.8%",
        "D.5%",
        "Answer: Option D",
        ""
    ],
    [
        "26. What is the name of novel written by Nobel Prize winner Kazuo Ishiguro?",
        "A.Klara and the Sun",
        "B.Death in Her Hands",
        "C.My Dark Vanessa",
        "D.The Glass Hotel",
        "Answer: Option A",
        ""
    ],
    [
        "27. The Khadi and Village Industries Commission launched a project in Palghar district of Maharashtra, a state with more than 50 lakh palm trees. Headquarters of KVIC is loccated in which city?",
        "A.Surat",
        "B.Ahmedabad",
        "C.Delhi",
        "D.Mumbai",
        "Answer: Option D",
        ""
    ],
    [
        "28. According to the report titled \"Policy Brief: The Impact of COVID-19 on Food Security and Nutrition\" released by FAO, how many people fell into acute food insecurity since February 2020?",
        "A.40 million",
        "B.35 million",
        "C.25 million",
        "D.45 million",
        "Answer: Option D",
        ""
    ],
    [
        "29. Serum Institute of India, signs a new supply agreement with UNICEF and Vaccine alliance Gavi's procurement partner to supply which vaccine to low income countries all over the world?",
        "A.Cholera. Vaxchora.",
        "B.Human Papillomavirus",
        "C.Hepatitis A Vaccine",
        "D.Pneumococcal Conjugate Vaccine",
        "Answer: Option D",
        ""
    ],
    [
        "30. What is the name of Kyrgyzstan's Prime Minister who resigned amid ongoing criminal investigation into whether the government illegally sold radio frequencies?",
        "A.Askar Akayev",
        "B.Roza Otunbayeva",
        "C.Mukhammedkalyi Abylgaziyev",
        "D.Kurmanbek Bakiyev",
        "Answer: Option C",
        ""
    ],
    [
        "31. The fifth state of matter has been observed by the scientists for the first time in space. What is the name of fifth state of matter?",
        "A.Bose-Einstein condensates",
        "B.Plasma",
        "C.Gas",
        "D.Solid",
        "Answer: Option A",
        ""
    ],
    [
        "32. Who will inaugurate Composite Regional Centre in Ranchi on 17 April through video conferencing amid COVID-19 pandemic?",
        "A.Narendra Singh Tomar",
        "B.Shripad Yesso Naik",
        "C.Thaawarchand Gehlot",
        "D.Mahendra Nath Pandey",
        "Answer: Option C",
        ""
    ],
    [
        "33. Who launched the Indian Gas Exchange in an e-ceremony on 15 June?",
        "A.Dharmendra Pradhan",
        "B.D.V. Sadananda Gowda",
        "C.Nitin Jairam Gadkari",
        "D.Ramvilas Paswan",
        "Answer: Option A",
        ""
    ],
    [
        "34. Union Finance & Corporate Affairs Minister Nirmala Sitharaman chaired the virtual 40th GST Council Meeting. What is extended time limit for revoking cancellations of GST registration?",
        "A.July 30, 2020",
        "B.Oct. 30, 2020",
        "C.Sept. 30, 2020",
        "D.Dec. 30, 2020",
        "Answer: Option C",
        ""
    ],
    [
        "35. Which city Railway Protection Force has launched a Robot 'CAPTAIN ARJUN' to intensify the screening and surveillance?",
        "A.Pune",
        "B.Chennai",
        "C.Ahmedabad",
        "D.Lucknow",
        "Answer: Option A",
        ""
    ],
    [
        "36. India's foreign exchange reserves have surged by how much dollars to cross the half-a-trillion mark for the first time?",
        "A.6.22 billion dollars",
        "B.5.22 billion dollars",
        "C.7.22 billion dollars",
        "D.8.22 billion dollars",
        "Answer: Option D",
        ""
    ],
    [
        "37. According to the report 'Global Trade Update 2020' released by UNCTAD, the value of international trade in goods is expected to plunge further by how much percent in the ongoing second quarter due to coronavirus pandemic?",
        "A.17%",
        "B.37%",
        "C.47%",
        "D.27%",
        "Answer: Option D",
        ""
    ],
    [
        "38. According to the FIFA world Ranking released on June 11, 2020, what is India's rank?",
        "A.98",
        "B.102",
        "C.108",
        "D.128",
        "Answer: Option C",
        ""
    ],
    [
        "39. Which city launched \"She Triumphs through Respect, Equality, and Empowerment(STREE)\", a programme to support and empower women victims of domestic violence and abuse?",
        "A.Chennai",
        "B.Bangalore",
        "C.Ahmedabad",
        "D.Hyderabad",
        "Answer: Option D",
        ""
    ],
    [
        "40. The highest ever allocation of funds of how much worth made under Mahatma Gandhi National Rural Employment Guarantee Scheme in the current Financial Year 2020-2021?",
        "A.Rs. 2,01,500",
        "B.Rs. 3,01,500",
        "C.Rs. 1,01,500",
        "D.Rs. 4,01,500",
        "Answer: Option C",
        ""
    ],
    [
        "41. According to the \"Poonam Avlokkan\" survey the population of the Asiatic lion at the Gir sanctuary in Gujarat has seen a commendable rise to approximately how much percent?",
        "A.32%",
        "B.29%",
        "C.22%",
        "D.39%",
        "Answer: Option B",
        ""
    ],
    [
        "42. The government of India has approved how much fund for the implementation of JJM in the Maharashtra during 2020-21?",
        "A.Rs.1,828.92 crore",
        "B.Rs.1,328.92 crore",
        "C.Rs.1,228.92 crore",
        "D.Rs.1,728.92 crore",
        "Answer: Option A",
        ""
    ],
    [
        "43. Scientists from which university has witnessed a birth of a new planet by using photographs of the Spectro-Polarimetric High-contrast Exoplanet Research instrument on the Very Large Telescope of the European Southern Observatory in Chile?",
        "A.University of Amsterdam",
        "B.University of Cambridge",
        "C.King's College London",
        "D.PSL University in France",
        "Answer: Option D",
        ""
    ],
    [
        "44. The Department of School Education and Literacy has collaborated with Fit India under the \"Ek Bharat, Shrestha Bharat\" initiative to produce a series of special films to promote how many indigenous sports of India?",
        "A.8",
        "B.9",
        "C.7",
        "D.10",
        "Answer: Option D",
        ""
    ],
    [
        "45. Which institute has developed a nano-technology based disinfectant spray- Ananya to combat the COVID-19 pandemic?",
        "A.National Institute of Hydrology",
        "B.National Institute of Electronics & Information Technology",
        "C.Physical Research Laboratory, Ahmedabad",
        "D.The Defence Institute of Advanced Technology, Pune",
        "Answer: Option D",
        ""
    ],
    [
        "46. Which institute developed \"ANANYA\" water based disinfectant spray with nanotechnology assisted formulation?",
        "A.Tata Institute of Fundamental Research",
        "B.National Institute of Science Education and Research",
        "C.The Defence Institute of Advanced Technology",
        "D.The Manohar Parrikar Institute for Defence Studies",
        "Answer: Option C",
        ""
    ],
    [
        "47. Fitch Ratings stated that India's economy is forecast to grow with a sharp growth rate of how much percent in 2021 if the country avoids further deterioration in financial sector health?",
        "A.9.5%",
        "B.5.5%",
        "C.6.5%",
        "D.7.5%",
        "Answer: Option A",
        ""
    ],
    [
        "48. The World Archery committee decided to postpone the 2020 World Archery Field Championships to which year?",
        "A.2021",
        "B.2023",
        "C.2024",
        "D.2022",
        "Answer: Option D",
        ""
    ],
    [
        "49. Which company has bagged the world's largest solar bid of USD 6 billion?",
        "A.Luminous Energy Ltd",
        "B.Tata Solar Energy Ltd",
        "C.Loom Solar Energy Ltd",
        "D.Adani Green Energy Ltd",
        "Answer: Option D",
        ""
    ],
    [
        "50. International Advanced Research Centre for Powder Metallurgy and New Material and which Industries have jointly developed a UVC-based Cabinet?",
        "A.Imperia Industries",
        "B.Telemax India Industries",
        "C.MEKINS Industries",
        "D.Tuteja Industries",
        "Answer: Option C",
        ""
    ],
    [
        "51. Who inaugurated the 18th Bench of Central Administrative Tribunal for the Union Territories of Jammu & Kashmir and Ladakh through a Video Conference on 8 June?",
        "A.Ramvilas Paswan",
        "B.Dr. Jitendra Singh",
        "C.Nitin Jairam Gadkari",
        "D.Narendra Singh Tomar",
        "Answer: Option B",
        ""
    ],
    [
        "52. To encourage the Make In India initiative the Department of Chemicals & Petrochemicals identified how many types of chemicals, petrochemicals, pesticides and Dyestuff and assessed the domestic manufacturing capacity and local competition?",
        "A.35",
        "B.45",
        "C.55",
        "D.25",
        "Answer: Option C",
        ""
    ],
    [
        "53. Who has been appointed as non-executive chairman of the Larsen & Toubro company for a period of three years from October 1, 2020?",
        "A.B. D. Pande",
        "B.Nitinbhai Patel",
        "C.A M Naik",
        "D.Ishwarbhai Parmar",
        "Answer: Option C",
        ""
    ],
    [
        "54. A survey released by the Reserve Bank has showed that Indian economy may contract by how much percent in FY21?",
        "A.2.5 percent",
        "B.1.5 percent",
        "C.3.5 percent",
        "D.4.5 percent",
        "Answer: Option B",
        ""
    ],
    [
        "55. Which Abu Dhabi-based company is all set to buy 1.85% stake in jio Platforms, a wholly-owned subsidiary of Reliance Industries, for Rs 9,093.60 crore?",
        "A.Mubadala",
        "B.Rotana",
        "C.ESNAAD",
        "D.Zakum Development Company",
        "Answer: Option A",
        ""
    ],
    [
        "56. Which organisation has partnered with US Agency for International Development's Market Integration and Transformation Program for Energy Efficiency program and launched 'Healthy and Energy Efficient Buildings' initiative?",
        "A.REC Limited",
        "B.The Energy and Resources Institute",
        "C.CEPT University",
        "D.Energy Efficiency Services Limited",
        "Answer: Option D",
        ""
    ],
    [
        "57. Who wrote the book -The Dry Fasting Miracle: From Deprive to Thrive?",
        "A.Karen Kingsbury",
        "B.Helen Phillips",
        "C.Luke Coutinho",
        "D.Jess Kidd",
        "Answer: Option C",
        ""
    ],
    [
        "58. India has pledged to make donation of how many dollars for GAVI - Global Alliance for Vaccines and Immunisation?",
        "A.USD 10 million",
        "B.USD 25 million",
        "C.USD 20 million",
        "D.USD 15 million",
        "Answer: Option D",
        ""
    ],
    [
        "59. Which organisation developed \"SUMERU-PACS\", a personal air circulation system to provide comfort for the doctors and healthcare workers who wear Personal Protective Equipment for more than 6 hours and suffer due to sweating?",
        "A.ICMR",
        "B.CSIR",
        "C.DRDO",
        "D.IIT",
        "Answer: Option C",
        ""
    ],
    [
        "60. Union Cabinet approved the re-establishment of the Pharmacopoeia Commission for Indian Medicine & Homoeopathy as Subordinate Office under AYUSH Ministry. Pharmacopoeia Commission for Indian Medicine & Homoeopathy was established in which year?",
        "A.2005",
        "B.2000",
        "C.2010",
        "D.2014",
        "Answer: Option C",
        ""
    ],
    [
        "61. Which CSIR Institute have indigenously developed a ventilator to provide help and support to the COVID-19 patients?",
        "A.Institute of Minerals and Materials Technology",
        "B.Central Scientific Instruments Organisation",
        "C.Central Electronics Engineering Research Institute",
        "D.Central Mechanical Engineering Research Institute",
        "Answer: Option D",
        ""
    ],
    [
        "62. What is India's Rank according to the Startup Ecosystem Rankings Report 2020 released by StartupBlink?",
        "A.25th",
        "B.15th",
        "C.13rd",
        "D.23rd",
        "Answer: Option D",
        ""
    ],
    [
        "63. The Union Cabinet chaired by PM Narendra Modi approved to rename which port as Syama Prasad Mookerjee Port?",
        "A.Mormugao Port",
        "B.Kolkata Port",
        "C.Cochin Port",
        "D.Mumbai Port",
        "Answer: Option B",
        ""
    ],
    [
        "64. The Science and Engineering Research Board has approved support for research at which institute to identify lead compounds from available and approved drugs for anti-SARS-CoV-2 drug molecules?",
        "A.Indian Institute of Technology Madras",
        "B.Indian Institute of Technology Kharagpur",
        "C.Indian Institute of Technology Palakkad",
        "D.Indian Institute of Technology Varanasi",
        "Answer: Option D",
        ""
    ],
    [
        "65. Which animal is likely to be the world's oldest-known land animal according to the research published in the journal Historical Biology?",
        "A.Kampecaris obanensis",
        "B.Millipede obanensis",
        "C.Hebrides obanensis",
        "D.Kerrera obanensis",
        "Answer: Option A",
        ""
    ],
    [
        "66. Centre announced policy changes in the definition for the MSME sector as part of the Atmanirbhar Bharat package. As per the new definition what will be investment and turnover limit for micro-units?",
        "A.Investment Rs.1 crore and Turnover Rs.10 crore",
        "B.Investment Rs.50 lakhs and Turnover Rs.1 crore",
        "C.Investment Rs.1 crore and Turnover Rs.5 crore",
        "D.Investment Rs.50 lakhs and Turnover Rs.5 crore",
        "Answer: Option C",
        ""
    ],
    [
        "67. Prime Minister Narendra Modi launched which video blogging competition while addressing the nation in 12th Episode of 'Mann Ki Baat 2.0' on 31 May 2020?",
        "A.Our Life, Our Yoga",
        "B.Your Life, Your Yoga",
        "C.Helathy Life, Daily Yoga",
        "D.My Life, My Yoga",
        "Answer: Option D",
        ""
    ],
    [
        "68. What is the name of cyclone likely to intensify and develop into a severe cyclone and cross north Maharashtra and south Gujarat coasts on June 3?",
        "A.Nisarga",
        "B.Ockhi",
        "C.Fani",
        "D.Amphan",
        "Answer: Option A",
        ""
    ],
    [
        "69. Google launches which app to help people maintain social distancing?",
        "A.Dodar",
        "B.Kedar",
        "C.Sodar",
        "D.Cedar",
        "Answer: Option C",
        ""
    ],
    [
        "70. What was the theme of 2020 International Day of UN Peacekeepers?",
        "A.Men in Peacekeeping - A key to Peace",
        "B.Women in Peacekeeping - A Path to Peace",
        "C.Women in Peacekeeping - A key to Peace",
        "D.Men in Peacekeeping - A Path to Peace",
        "Answer: Option C",
        ""
    ],
    [
        "71. Who has launched the e-booklet on Department of Administrative Reforms and Public Grievances achievements for the period 30 May 2019 to 30 May 2020?",
        "A.Harsh Vardhan",
        "B.Ram Vilas Paswan",
        "C.Nitin Gadkari",
        "D.Jitendra Singh",
        "Answer: Option D",
        ""
    ],
    [
        "72. Finance Minister Nirmala Sitharaman chaired which Meeting of the Financial Stability and Development Council via video conferencing, which was the first meet since the coronavirus outbreak?",
        "A.20nd",
        "B.21nd",
        "C.22nd",
        "D.23nd",
        "Answer: Option C",
        ""
    ],
    [
        "73. BSE and National Stock Exchange announced that they will reduce the annual listing fee by how much percent for MSMEs, as a part of their attempts to lower the compliance costs for companies during the ongoing COVID-19 pandemic?",
        "A.15%",
        "B.35%",
        "C.20%",
        "D.25%",
        "Answer: Option D",
        ""
    ],
    [
        "74. Principal Scientific Adviser to the GoI stated that in order to succeed against the COVID-19 pandemic, a large number of parallel efforts are being taken. Who is Principal Scientific Adviser to the GoI?",
        "A.Jitendra Patel",
        "B.Santosh Kumar",
        "C.Vinod Paul",
        "D.K. Vijay Raghavan",
        "Answer: Option D",
        ""
    ],
    [
        "75. How much Rs will be awarded for finding security flaw in the coronavirus tracking app, Aarogya Setu?",
        "A.Rs. 10 lakh",
        "B.Rs. 5 lakh",
        "C.Rs. 1 lakh",
        "D.Rs. 2.5 lakh",
        "Answer: Option "
    ]
]