[
    [
        "1. The IIT Alumni Council signed an agreement for joint research on COVID-19 and patient data analysis with which institute?",
        "A.CSIR-IICT",
        "B.CSIR-CMERI",
        "C.CSIR-IGIB",
        "D.CSIR-IHBT",
        "Answer: Option C",
        ""
    ],
    [
        "2. What is the name of COVID-19 vaccine developed by Bharat Biotech India Ltd in collaboration with the Indian Council of Medical Research - National Institute of Virology?",
        "A.Coroxin",
        "B.Covaxin",
        "C.Covanin",
        "D.Coronin",
        "Answer: Option B",
        ""
    ],
    [
        "3. Indian Council of Medical Research and which company join hands for development of COVID-19 vaccine called Covaxin?",
        "A.Lupin Limited",
        "B.Cipla Limited",
        "C.Bharat Biotech",
        "D.Biocon Limited3",
        "Answer: Option C",
        ""
    ],
    [
        "4. Which scientist from India has been named as members of International Scientific group to offer foremost scientific evidence for sustainable food systems for global food summit 2021?",
        "A.Mohan Sharma and Mitali Mukherji",
        "B.Prof. Rattan Lal and Uma Lele",
        "C.B. V. Sreekantan and C. S. Seshadri",
        "D.Jitendra Nath Goswami and K. S. Krishnan",
        "Answer: Option B",
        ""
    ],
    [
        "5. The Swedish Institute of Space Physics will explore Venus for the second time through the India's 1st Venus Mission. What is the name of India's 1st Venus Mission?",
        "A.Shukrayaan-1",
        "B.Venus-1",
        "C.Shukra-1",
        "D.Venusyaan-1",
        "Answer: Option A",
        ""
    ],
    [
        "6. India's Artificial Intelligence enabled \"MyGov Corona Helpdesk\" won two awards in 4th CogX, 2020. What was the theme of CogX 2020?",
        "A.How do we get healthy in next 10 years?",
        "B.How do we get the next 10 years right?",
        "C.How do we get corona free in next 10 years?",
        "D.How do we get global peace in next 10 years?",
        "Answer: Option B",
        ""
    ],
    [
        "7. Which university has detected two super Earths Gliese 887b and Gliese 887c orbiting around the Gliese 887, the brightest red dwarf star in the sky?",
        "A.The University of Gottingen, Germany",
        "B.University of Bern, Germany",
        "C.Tsinghua University, Beijing",
        "D.University of Helsinki, Germany",
        "Answer: Option A",
        ""
    ],
    [
        "8. Scientists from which Institute have synthesized a novel inorganic-organic hybrid compound that can inhibit breast, lung, and liver cancer cells?",
        "A.Central Institute of Medicinal and Aromatic Plants",
        "B.All India Institute of Medical Sciences",
        "C.Institute of Nano Science & Technology, Mohali",
        "D.Central Drug Research Institute",
        "Answer: Option C",
        ""
    ],
    [
        "9. Which institute has discovered new biomolecules to fight drug resistance in Kala-azar exploring ways to tackle miltefosine resistance?",
        "A.Indira Gandhi Institute of Development Research",
        "B.Indian Institute of Science, Bangalore",
        "C.National Centre for Cell Science, Pune",
        "D.Jawaharlal Nehru Centre for Advanced Scientific Research",
        "Answer: Option C",
        ""
    ],
    [
        "10. Which institue has created a chip named 'Dhruva' that can be mounted in smartphones and navigation devices to find places and routes within the country?",
        "A.IIT Gandhinagar",
        "B.IIT Bombay",
        "C.IIT Indore",
        "D.IIT Guwahati",
        "Answer: Option B",
        ""
    ],
    [
        "11. On June 19, 2020 A meteorite-like object weighing around 2.78kg has fallen from the sky in which Indian state resulting in a one-foot deep crater in the earth?",
        "A.Rajasthan",
        "B.Punjab",
        "C.Haryana",
        "D.Uttar Pradesh",
        "Answer: Option A",
        ""
    ],
    [
        "12. Which Indian company has announced the launch of its generic version of antiviral drug Remdesivir for emergency use in the treatment of the COVID-19 patients?",
        "A.Cipla Ltd",
        "B.Sun Pharmaceutical",
        "C.Wockhardt Limited",
        "D.Lupin Limited",
        "Answer: Option A",
        ""
    ],
    [
        "13. The Indian Space Research Organisation has initiated a 10,000 crore project- Gaganyaan to send humans to space by which year?",
        "A.2025",
        "B.2030",
        "C.2024",
        "D.2022",
        "Answer: Option D",
        ""
    ],
    [
        "14. Astronomers have discovered a rare kind of space object described as something between an asteroid and a comet- an active asteroid in which planet's orbit?",
        "A.Saturn",
        "B.Mars",
        "C.Jupiter",
        "D.Neptune",
        "Answer: Option C",
        ""
    ],
    [
        "15. A team of astronomers from the South African Radio Astronomy Observatory, the US National Radio Astronomy Observatory, the University of Pretoria,used which telescope to solve a longstanding puzzle in 'X'-shaped radio galaxies?",
        "A.The Fermi Gamma-Ray Telescope",
        "B.The Spitzer Space Telescope",
        "C.The Hubble Space Telescope",
        "D.MeerKAT Telescope",
        "Answer: Option D",
        ""
    ],
    [
        "16. Space Telescope Science Institute (STScI) has discovered that the closest known brown dwarf showing signs of cloud bands similar to the Jupiter and Saturn. What is the name of this brown dwarf?",
        "A.Luhman 16A",
        "B.Suhman 16A",
        "C.Luhman 12A",
        "D.Suhman 12A",
        "Answer: Option A",
        ""
    ],
    [
        "17. Astronomers found how many asteroids that once belonged to a distant star system have been found orbiting the Sun between Jupiter and Neptune?",
        "A.12",
        "B.18",
        "C.19",
        "D.11",
        "Answer: Option C",
        ""
    ],
    [
        "18. The Department of Science and Technology (DST), Government of India, developed which mobile application that is prepared and managed by the Survey of India (SoI)to help decision making during the COVID-19 pandemic?",
        "A.CORYO",
        "B.COVYO",
        "C.SAHYO",
        "D.SOVYO",
        "Answer: Option C",
        ""
    ],
    [
        "19. The Department of Science and Technology (DST), under the Ministry of Science & Technology, is to fund which institute to undertake the development of Active Virosome (AV) Vaccine and Immunodiagnostic kits for COVID-19 emergency?",
        "A.FastSense Diagnostics",
        "B.Seagull BioSolutions Pvt. Ltd.",
        "C.Genrich Membranes",
        "D.Module Innovations",
        "Answer: Option B",
        ""
    ],
    [
        "20. What was the theme of CogX 2020?",
        "A.How do we get healthy in next 10 years?",
        "B.How do we get the next 10 years right?",
        "C.How do we get corona free in next 10 years?",
        "D.How do we get global peace in next 10 years?",
        "Answer: Option B",
        ""
    ],
    [
        "21. Department of Science and Technology (DST) is to support and provide funding to the which of the following company to increase the membrane oxygenator equipment (MOE)?",
        "A.FastSense Diagnostics",
        "B.Loop Health",
        "C.Genrich Membranes",
        "D.Module Innovations",
        "Answer: Option C",
        ""
    ],
    [
        "22. Which of the following institutes has designed and developed Digital IR Thermometer to held in the help in the mitigation of the Coronavirus outbreak?",
        "A.CSIR-CBRI",
        "B.CSIR-NCL",
        "C.CSIR-CFTRI",
        "D.CSIR-AMPRI",
        "Answer: Option B",
        ""
    ],
    [
        "23. The Indian Council of Medical Research approved the use of which of the following machines for conducting COVID-19 tests?",
        "A.CT Scan Machine",
        "B.Tuberculosis machine",
        "C.X Ray Machine",
        "D.Ultrasound Machines",
        "Answer: Option B",
        ""
    ],
    [
        "24. According to a US-based research, a combination of reduced morbidity and mortality could make the BCG vaccination a \"game-changer\" in the fight against novel coronavirus. What is full form of C in BCG?",
        "A.Ciclosporin",
        "B.Corona",
        "C.Calmette",
        "D.Cytomegalovirus",
        "Answer: Option C",
        ""
    ],
    [
        "25. Which of the following body develops full-body disinfection chamber called 'Personnel Sanitization Enclosure' for healthcare workers dealing with coronavirus cases?",
        "A.BARC",
        "B.DRDO's VRDE",
        "C.ICMR",
        "D.ISRO",
        "Answer: Option B",
        ""
    ],
    [
        "26. Which of the following institute will set up a task force on gene therapy in order to encourage research in the field?",
        "A.Central Glass and Ceramic Research Institute",
        "B.Central Research Institute for Jute and Allied Fibers",
        "C.Indian Council of Medical Research (ICMR)",
        "D.The Academy of Scientific and Innovative Research",
        "Answer: Option C",
        ""
    ],
    [
        "27. NASA has finally selected a sample collection site on asteroid Bennu after the arrival of OSIRIS-REx spacecraft . What is name of that site?",
        "A.Nightingale",
        "B.Ceres",
        "C.Itokawa",
        "D.Hygiea",
        "Answer: Option A",
        ""
    ],
    [
        "28. George Laurer, who recently passed away was the inventor of which of the following services?",
        "A.Barcode",
        "B.MICR",
        "C.RTGS",
        "D.None of these",
        "Answer: Option A",
        ""
    ],
    [
        "29. Who will be the partner country for Bio Asia 2020?",
        "A.China",
        "B.Switzerland",
        "C.USA",
        "D.Sweden",
        "Answer: Option B",
        ""
    ],
    [
        "30. Which of the following cities organized the Symposium on Scope of Science of Ayurveda in Global Health?",
        "A.Indore",
        "B.Raipur",
        "C.New Delhi",
        "D.Chennai",
        "Answer: Option C",
        ""
    ],
    [
        "31. How many commercial satellites have been launched by ISRO along with RISAT-2BR1?",
        "A.7",
        "B.9",
        "C.10",
        "D.12",
        "Answer: Option B",
        ""
    ],
    [
        "32. How many missions will be completed by PSLV with the launch of RISAT-2BR1 on board PLSV-C48?",
        "A.58",
        "B.55",
        "C.50",
        "D.45",
        "Answer: Option C",
        ""
    ],
    [
        "33. Who has won the Sree Ramakrishna Paramhansa Research Grant?",
        "A.Dibyendu Sarkar",
        "B.Patrick D'Silva",
        "C.Santasabuj Das",
        "D.Vidita Vaidya",
        "Answer: Option D",
        ""
    ],
    [
        "34. Which Radar Imaging Satellite is to be launched by ISRO?",
        "A.RISAT-2B",
        "B.RISAT-2BR1",
        "C.RISAT-1BR2",
        "D.RISAT-1B",
        "Answer: Option B",
        ""
    ],
    [
        "35. Which NASA satellite has recently found the crashed Indian Moon lander Vikram?",
        "A.CALIPSO",
        "B.Aura",
        "C.Landsat7",
        "D.LRO",
        "Answer: Option D",
        ""
    ],
    [
        "36. Researchers of which country have recently discovered a massive black hole in the Milky Way?",
        "A.India",
        "B.USA",
        "C.China",
        "D.Russia",
        "Answer: Option C",
        ""
    ],
    [
        "37. Which high resolution imaging satellite has recently been launched by ISRO?",
        "A.WorldView 1",
        "B.GeoEye-1",
        "C.QuickBird",
        "D.Cartosat-3",
        "Answer: Option D",
        ""
    ],
    [
        "38. What is name of NASA's first electric airplane?",
        "A.P-51 Mustang",
        "B.X-57 Maxwell",
        "C.B-52 Stratofortress",
        "D.U-2 spy plane",
        "Answer: Option B",
        ""
    ],
    [
        "39. NASA has recently detected water vapours on which Jupiter's moon?",
        "A.Europa",
        "B.Ganymede",
        "C.Callisto",
        "D.Io",
        "Answer: Option A",
        ""
    ],
    [
        "40. Which rocket of ISRO is to launch USA's commercial nano satellites?",
        "A.PSLV-C48",
        "B.PSLV-C46",
        "C.PSLV-C47",
        "D.PSLV-C45",
        "Answer: Option C",
        ""
    ],
    [
        "41. What is the name of India's 2nd mission to land on Moon?",
        "A.Chandrayaan 1",
        "B.Chandrayaan 2",
        "C.Chandrayaan 3",
        "D.Gaganyaan",
        "Answer: Option C",
        ""
    ],
    [
        "42. Which Japanese spacecraft has started journey home from asteroid Ryugu?",
        "A.Hayabusa2",
        "B.Akatsuki",
        "C.Selene",
        "D.Hisaki",
        "Answer: Option A",
        ""
    ],
    [
        "43. A huge X-Ray burst from outer space has been detected by which telescope?",
        "A.Hubble",
        "B.Webb",
        "C.NICER",
        "D.Compton",
        "Answer: Option C",
        ""
    ],
    [
        "44. Which organization recently launched 60 mini satellites for global internet?",
        "A.NASA",
        "B.ISRO",
        "C.SpaceX",
        "D.DRDO",
        "Answer: Option C",
        ""
    ],
    [
        "45. Which organization launched its first all-electric aircraft, named as X-57 \"Maxwell\"?",
        "A.CNSA",
        "B.NASA",
        "C.ISRO",
        "D.ROSCOSMOS",
        "Answer: Option B",
        ""
    ],
    [
        "46. Which spacecraft has recently reached interstellar space?",
        "A.Juno",
        "B.Opportunity",
        "C.Voyager 2",
        "D.Skylab",
        "Answer: Option C",
        ""
    ],
    [
        "47. Which of the following Institutes has launched India's first indigenously designed standing wheelchair named 'Arise'?",
        "A.IIT Bombay",
        "B.IIT Hyderabad",
        "C.IIT Kanpur",
        "D.IIT Madras",
        "Answer: Option D",
        ""
    ],
    [
        "48. Which of the following countries has launched Sudan's first ever satellite?",
        "A.China",
        "B.UAE",
        "C.India",
        "D.Australia",
        "Answer: Option A",
        ""
    ],
    [
        "49. Where did the newly decided space technology cell will be set up in India?",
        "A.New Delhi",
        "B.Bangalore",
        "C.Roorkee",
        "D.Hyderabad",
        "Answer: Option A",
        ""
    ],
    [
        "50. Unmanned X-37B space plane which landed recently in Florida has made a record of how many days in orbit?",
        "A.580",
        "B.758",
        "C.780",
        "D.980",
        "Answer: Option C",
        ""
    ],
    [
        "51. Which organization has conducted genome Sequencing of Indians from different populations?",
        "A.CSIR",
        "B.ASI",
        "C.AIMS",
        "D.WHO",
        "Answer: Option A",
        ""
    ],
    [
        "52. What is the name of the gold cart-size robot to be sent by NASA to moon in 2022?",
        "A.CEASER",
        "B.CARTIS",
        "C.VIPER",
        "D.ALEX",
        "Answer: Option C",
        ""
    ],
    [
        "53. Which one advanced digital imaging solution has secured Guinness World Record for developing the smallest commercially available image sensor?",
        "A.Omni Vision",
        "B.Mini Vision",
        "C.Ultra Vision",
        "D.Infra Vision",
        "Answer: Option A",
        ""
    ],
    [
        "54. What is the name of a robot created by India and UK to encourage children to wash their hands?",
        "A.Chichi",
        "B.Meme",
        "C.Pepe",
        "D.Miko",
        "Answer: Option C",
        ""
    ],
    [
        "55. Which astronauts have set history by performing an all-female spacewalk on 18 October?",
        "A.Sunita Williams",
        "B.Christina Koch",
        "C.Jessica Meir",
        "D.Both B and C",
        "Answer: Option D",
        ""
    ],
    [
        "56. Which of the following companies is developing an Artificial intelligence (AI)-based tool for analysis of terrorist activities?",
        "A.TCS",
        "B.L&T",
        "C.BEL",
        "D.HUL",
        "Answer: Option C",
        ""
    ],
    [
        "57. Who among the following persons invented 'Phenakistoscope' and Google celebrated his 218th birthday with a Doodle recently?",
        "A.John Plateau",
        "B.Joseph Antoine Ferdinand Plateau",
        "C.Dracker Ontario",
        "D.Richard Brown Williamson",
        "Answer: Option B",
        ""
    ],
    [
        "58. Who among the following is the name of the first person who did spacewalk in 1965 but died recently?",
        "A.Alexei Leonov",
        "B.Fyodor Gorbachov",
        "C.Joseph Huston",
        "D.Mark Elliot",
        "Answer: Option A",
        ""
    ],
    [
        "59. What is the name of NASA's recently launched a satellite to study the ionosphere?",
        "A.PROP",
        "B.ICON",
        "C.MARK",
        "D.ROCK",
        "Answer: Option B",
        ""
    ],
    [
        "60. Which of the following devices has been launched for ocean states forecast and mapping potential fishing zones?",
        "A.Nishta",
        "B.GEMINI",
        "C.SEAFORC",
        "D.None of the above",
        "Answer: Option B",
        ""
    ],
    [
        "61. Which of the following agencies is going to organize Women Spacewalk on October 21?",
        "A.NASA",
        "B.JAXA",
        "C.ISA",
        "D.ISRO",
        "Answer: Option A",
        ""
    ],
    [
        "62. Stubble burning results in emission of harmful gases such",
        "A.Carbon Monoxide",
        "B.Nitrogen dioxide",
        "C.Ozone",
        "D.Nitrous Monoxide",
        "Answer: Option B",
        ""
    ],
    [
        "63. Which of the following fats is not favourable for our body?",
        "A.Unsaturated fat",
        "B.Saturated fat",
        "C.Trans fat",
        "D.None of these",
        "Answer: Option C",
        ""
    ],
    [
        "64. What is the name of Chandrayaan-2's payload that found charged particles on the Moon?",
        "A.URJA",
        "B.CLASS",
        "C.RUSTOM",
        "D.CLOUD",
        "Answer: Option B",
        ""
    ],
    [
        "65. Recently, Scientists discover 8th continent under Europe. It's named as;",
        "A.Greater Adria",
        "B.Mathilde",
        "C.Cruithne",
        "D.Davida",
        "Answer: Option A",
        ""
    ],
    [
        "66. Name the most massive neutron star discovered by astronomers from West Virginia University (U.S).",
        "A.MSP J0740+6620",
        "B.MNS J0730+6620",
        "C.MVS J0720+6620",
        "D.MDS J0720+6620",
        "Answer: Option A",
        ""
    ],
    [
        "67. ISRO and __________ join hands for the development of human-centric systems for the Human Space Mission.",
        "A.DRDO",
        "B.HAL",
        "C.NASA",
        "D.SpaceX",
        "Answer: Option A",
        ""
    ],
    [
        "68. How many satellites did China launched for disaster management and climate monitoring?",
        "A.3",
        "B.4",
        "C.5",
        "D.6",
        "Answer: Option A",
        ""
    ],
    [
        "69. Name the missile which was recently tested by the DRDO in Kurnool, Andhra Pradesh.",
        "A.NAG",
        "B.Dhanush",
        "C.Nirbhay",
        "D.MPATGM",
        "Answer: Option D",
        ""
    ],
    [
        "70. Water has been discovered on which potentially habitable super-Earth?",
        "A.K2-18d",
        "B.K2-18c",
        "C.K2-18a",
        "D.K2-18b",
        "Answer: Option D",
        ""
    ],
    [
        "71. What is the name of Chandrayaan 2 lander from which Indian Space Research Organisation(ISRO) lost it's contact when it was 2.1Km away from the surface of the moon?",
        "A.Vikram Lander",
        "B.Viking 2 Lander",
        "C.Phoenix Lander",
        "D.Mars Polar Lander",
        "Answer: Option A",
        ""
    ],
    [
        "72. Who was the mission director of the ISRO's mission, Chandrayaan-2?",
        "A.K.Sivan",
        "B.Muthayya Vanitha",
        "C.Ritu Karidhal",
        "D.Ramnanda Das",
        "Answer: Option C",
        ""
    ],
    [
        "73. What is the name of India's first manned space mission?",
        "A.Chandrayaan-3, 2021",
        "B.Mangalyaan-2",
        "C.Gaganyaan, 2021",
        "D.Astrosat",
        "Answer: Option C",
        ""
    ],
    [
        "74. Who was the project director of the ISRO's mission, Chandrayaan-2?",
        "A.K.Sivan",
        "B.Muthayya Vanitha",
        "C.Ritu Karidhal",
        "D.Ramnanda Das",
        "Answer: Option B",
        ""
    ],
    [
        "75. Oscars of science awarded to which of the following team?",
        "A.Event Horizon Telescope",
        "B.Hubble Space Telescope",
        "C.Gemini Observatory",
        "D.Gran Telescopio Canarias",
        "Answer: Option "
    ]
]