[
    [
        "Q.1. Introducing Geeta to guests, Baljeet said, \"Her father is the only son of my father.\" How is Geeta related to Baljeet?",
        "(A) Mother.",
        "(B) Daughter.",
        "(C) Niece.",
        "(D) Sister.",
        " Ans .  B",
        ""
    ],
    [
        "Q.2. Parveen said to her friend, \"Yesterday I attended the birthday party of the son of the only son-in-law of my mother's mother.\" How is Parveen related to the man, whose birthday party she attended?",
        "(A) Daughter.",
        "(B) Niece.",
        "(C) Mother.",
        "(D) Sister.",
        " Ans .  D",
        ""
    ],
    [
        "Q.3. Pointing to a man in the photograph a lady said, \"The father of his brother is the only son of my mother.\" How is that man related to that lady?",
        "(A) Son.",
        "(B) Brother.",
        "(C) Nephew.",
        "(D) Cousin.",
        " Ans .  C",
        ""
    ],
    [
        "Q.4. Pointing to a woman in a photograph, Karan said, \"She is the daughter of the father of the sister of my brother.\" How is that lady in photograph related to Karan?",
        "(A) Wife.",
        "(B) Daughter.",
        "(C) Sister.",
        "(D) Mother.",
        " Ans .  C",
        ""
    ],
    [
        "Q.5. A and B are sisters. R and S are brothers. A's daughter is R's sister. What is B's relation to S?",
        "(A) Grandmother.",
        "(B) Mother.",
        "(C) Aunt.",
        "(D) Sister.",
        " Ans .  C",
        ""
    ],
    [
        "Q.6. Pointing towards a lady in the park, Veerpal said, \"She is the daughter of my grandfather's only son.\" How is Veerpal related to that lady?",
        "(A) Cousin.",
        "(B) Brother.",
        "(C) uncle.",
        "(D) Father.",
        " Ans .  B",
        ""
    ],
    [
        "Q.7. If Nesha says, \"Reeta's father Ravi is the only son of my father-in-law Mohit,\" then how Bali, who is the sister of Reeta is related to Mohit?",
        "(A) Wife.",
        "(B) Daughter.",
        "(C) Granddaughter.",
        "(D) Daughter-in-law.",
        " Ans .  C",
        ""
    ],
    [
        "Q.8. A woman introduces a man as the son of the brother of her mother. How is that man related to the woman?",
        "(A) Son.",
        "(B) Nephew.",
        "(C) Uncle.",
        "(D) Cousin.",
        " Ans .  D",
        ""
    ],
    [
        "Q.9. A woman walking with a boy meets another woman and on being asked about her relationship with the boy, she says, \"My maternal uncle and his maternal uncle's maternal uncle are brothers. \" How is the boy related to the woman?",
        "(A) Son.",
        "(B) Nephew.",
        "(C) Grandson.",
        "(D) Brother-in-law.",
        " Ans .  A",
        ""
    ],
    [
        "Q.10. Read the following information carefully and then answer the question given below it:",
        "(A) P is the brother of Q.",
        "(B) P is the husband of Q.",
        "(C) P is the father of Q.",
        "(D) P is the son of Q.",
        " Ans .  B "
    ]
]