[
    [
        "Q.1. Rashmi started from her home &amp; Walked 5 km. straight in the West. Then she turned to the right &amp; walked 3 km. Then she turned to the right &amp; walked 3 km. Then she tuned to the left &amp; walked 2 km. Again, she turned to the left &amp; walked 3 km. &amp; then walked 3 km. after turning to the right finally. In which direction is she now from her home?",
        "(A) West",
        "(B) North",
        "(C) South",
        "(D) East",
        " Ans . A",
        ""
    ],
    [
        "Q.2. Mohan travelled 5 km. in the West, then he turned to the left &amp; went 3 km. Then he turned to the left &amp; went 3 km. Then he turned to the right &amp; travelled 9 km. Then he went 3 km. towards the North. How far is he from the starting point?",
        "(A) 5 km.",
        "(B) 3 km.",
        "(C) 6 km.",
        "(D) 14 km.",
        " Ans . D",
        ""
    ],
    [
        "Q.3. If the 5th date of month comes after 2 days from Tuesday, then which would be the day on the day before 19th of that month?",
        "(A) Monday",
        "(B) Wednesday",
        "(C) Thursday",
        "(D) Sunday",
        " Ans . B",
        ""
    ],
    [
        "Q.4. If it was Friday on 3rd date of a month, then which day would come on the 4th day after 21st date of that month?",
        "(A) Tuesday",
        "(B) Monday",
        "(C) Thursday",
        "(D) Sunday",
        " Ans . C",
        ""
    ],
    [
        "Q.5. The chairman entered in the Assembly Hall at 10 min. before 12.30 hours to conduct the interview. The chairman was 20 min. earlier than the managing director. The chairman was 30 min. late as per the time fixed. What was the time fixed for interview?",
        "(A) 12:50",
        "(B) 12:10",
        "(C) 12:40",
        "(D) 12:00",
        " Ans . B",
        ""
    ],
    [
        "Q.6. Ashok started from his home to the bus stop before 15 min. then the time. He takes 10 min. to reach to the bus stop. He reached bus stop at 8.40 hours. Generally at what time he stats for the bus stop?",
        "(A) 8:40",
        "(B) 8:35",
        "(C) 8:45",
        "(D) 8:55",
        " Ans . C",
        ""
    ],
    [
        "Q.7. What is represented by ke?",
        "(A) been",
        "(B) has",
        "(C) merit",
        "(D) name",
        "(E) list",
        " Ans . E",
        ""
    ],
    [
        "Q.8. What is the code for idea?",
        "(A) fo",
        "(B) la",
        "(C) bu",
        "(D) na",
        "(E) Either nu or na",
        " Ans . A",
        ""
    ],
    [
        "Q.9. Which of the following represents name has been displayed?",
        "(A) ya la ke si",
        "(B) jo si ya la",
        "(C) si jo ke ne",
        "(D) bu ya ke la",
        "(E) ya si jo zo",
        " Ans . B",
        ""
    ],
    [
        "Q.10. What is denoted by zo?",
        "(A) there",
        "(B) displayed",
        "(C) name",
        "(D) her",
        "(E) Cannot be determined.",
        " Ans . A",
        ""
    ],
    [
        "Q.11. Which of the following represents her name is there?",
        "(A) zo ya go wo",
        "(B) bu ya zo go",
        "(C) zo ya bu ke",
        "(D) ya zo wo bu",
        "(E) wo go zo ya",
        " Ans . D",
        ""
    ],
    [
        "Q.12. What is the code for in?",
        "(A) na",
        "(B) ya",
        "(C) go",
        "(D) ke",
        "(E) Cannot be determined.",
        " Ans . C",
        ""
    ],
    [
        "Q.13. Insurance Company X is considering issuing a new policy to cover services required by elderly people who suffer from diseases that afflict the elderly. Premiums for the policy must be low enough to attract customers; therefore, Company X is concerned that the income from the policies would not be sufficient to pay for the claims that would be made.",
        "(A) Attracting middle-aged customers unlikely to submit claims for benefits for many years.",
        "(B) Insuring only those individuals who did not suffer any serious diseases as children.",
        "(C) Including a greater number of services in the policy than are included in other policies of lower cost.",
        "(D) Insuring only those individuals who were rejected by other companies for similar policies.",
        " Ans . A",
        ""
    ],
    [
        "Q.14. Eating beets significantly lowers the risk of cancer, according to an article in a nutritional magazine. The article refers to a study that found that people who consumed one or more beets per day were half as likely to be diagnosed with the disease as people who did not.",
        "(A) Another study found that people who consumed one tablespoon of flax seed oil per day were more than four times less likely to be diagnosed with cancer",
        "(B) Participants in the study reported consuming no vegetables other than beets.",
        "(C) In another experiment, cancer patients who ate one or more beets per day were no more likely to recover than those who ate no beets.",
        "(D) The participants in the study who ate beets were more likely to exercise regularly than those who did not eat beets.",
        " Ans . D",
        ""
    ],
    [
        "Q.15. It is unfortunate for a country, specially for the poor and women, that whenever any kind of disincentive  even of the mildest nature such as debarring a person with more than two children from contesting any local body election  is introduced to promote family planning, there are always some activists and organizations who unnecessarily oppose the measures without realizing that the voluntary family planning programmes area miserable flop as clearly highlighted by the national family health surveys.",
        "(A) Percentage of rural women voluntarily seeking family planning services in government health centre facilities has drastically come down over the last decade.",
        "(B) One child policy on China, where employees with more than one child are discriminated against, has been very effective in controlling their population.",
        "(C) Activists and organization which seem to advocate civil rights issues typically have their own vested interests and hidden agendas.",
        "(D) Punitive measures are the best deterrents for refraining people from committing deeds which adversely affect the society at large.",
        "(E) None of these",
        " Ans . B",
        ""
    ],
    [
        "Q.16. Left-handed persons suffer more frequently than do right-handed persons from certain immune disorders, such as allergies. Left-handers tend to have an advantage over the right-handed majority, however, on tasks controlled by the right hemisphere of the brain, and mathematical reasoning is strongly under the influence of the right hemisphere in most people.",
        "(A) Most people who suffer from allergies or other such immune disorders are left-handed rather than right-handed.",
        "(B) Most left-handed mathematicians suffer from some kind of allergy.",
        "(C) There are proportionally more left-handers among people whose ability to reason mathematically is above average than there are among people with poor mathematical reasoning ability.",
        "(D) If a left-handed person suffers from an allergy, that person will probably be good at mathematics.",
        "(E) There are proportionally more people who suffer from immune disorders such as allergies than there are people who are left-handed or people whose mathematical reasoning ability is unusually good.",
        " Ans . C",
        "1. P is second to the right of T who is the neighbor of R and V.",
        "2. S is not the neighbor of P.",
        "3. V is the neighbor of U.",
        "4. Q is not between S and W. W is not between U and S.",
        ""
    ],
    [
        "Q.17.Which two of the following are not neighbors ?",
        "(A) RV",
        "(B) UV",
        "(C) RP",
        "(D) QW",
        " Ans . A",
        ""
    ],
    [
        "Q.18. Which one is immediate right to the V ?",
        "(A) P",
        "(B) U",
        "(C) R",
        "(D) T",
        " Ans . D",
        ""
    ],
    [
        "Q.19. Which of the following is correct ?",
        "(A) P is to the immediate right of Q",
        "(B) R is between U and V",
        "(C) Q is to the immediate left of W",
        "(D) U is between W and S",
        " Ans . C",
        ""
    ],
    [
        "Q.20. What is the position of S ?",
        "(A) Between U and V",
        "(B) Second to the right of P",
        "(C) To the immediate right of W",
        "(D) Data inadequate.",
        " Ans . C",
        ""
    ],
    [
        "Q.21. Girdharilal has his wife Radha, 3 sons &amp; 2 daughters in his family. One daughter is still unmarried &amp; the other daughter has a son. Two sons have 2-2 children. Third son has 3 children. An old aunt &amp; a son-in-law also are living with them. What is the total no. of members in Girdharilals family?",
        "(A) 20",
        "(B) 19",
        "(C) 18",
        "(D) 17",
        " Ans . A "
    ]
]