[
    [
        "Q.1. ",
        "",
        "Directions: Read the following passage and examine each inference given below it in the context of this passage. ",
        "",
        "Mark your answer as: ",
        "",
        "(a) if the inference is 'definitely true'",
        "",
        "(b) if the inference is 'probably true';",
        "",
        "(c) if the 'data provided is inadequate';",
        "",
        "(d) if the inference is 'probably false'; and",
        "",
        "(e) if the inference is 'definitely false'.",
        "",
        "Procurement of wheat is in full swing in the north-western states of India. By June end, public agencies are likely to end up with foodgrain stocks of about 40 to 42 million tonnes, the highest ever witnessed in the history of this country. This stock should be more than sufficient to ensure that the country's \"food security\" is not endangered even if India faces two consecutive droughts.",
        "",
        "But strangely enough, while the granaries overflow, there is still widespread hunger in the country even without a drought. The estimates of poverty are being debated, but broadly one-third of India seems to remain underfed. And this coexistent of grain surpluses with large scale hunger should make any serious policy-maker think and examine the existing policy mix with a view to ensure faster economic growth and reduction in poverty.",
        "",
        "",
        " 1. The policy-makers in India are unaware of prevalent hunger.",
        " Ans .  B",
        ""
    ],
    [
        "Q.2. India always maintains foodgrain stocks to withstand two consecutive droughts.",
        " Ans .  D",
        ""
    ],
    [
        "Q.3. The distribution of foodgrains to the masses has remained a problem area for India.",
        " Ans .  A",
        ""
    ],
    [
        "Q.4. India's foodgrains stock has been satisfactory over the past few years.",
        " Ans .  C",
        ""
    ],
    [
        "Q.5. More than 30 percent of the population in India do not even get two times meals per day.",
        " Ans .  A",
        ""
    ],
    [
        "Q.6. The policy of India needs to be revamped to reduce the extent of poverty in the country.",
        " Ans .  A",
        ""
    ],
    [
        "Q.7. India, at present, is one of the countries in the world to have sufficient food for its people.",
        " Ans .  "
    ]
]