[
    [
        "Q.1. Premlata went 8 km in the east from her home &amp; then she turned to the left &amp; went 6 km. Finally, she turned to the left &amp; went 8 km how far was she from the starting point &amp; in which direction?",
        "Answer: 6 Km. North",
        ""
    ],
    [
        "Q.2. Ram goes 4 km in the South &amp; then goes 5 km after turning to the left &amp; then goes 4 km after turning to the left. Now from this point; how far is his starting point &amp; in which direction?",
        "Answer: 5 Km. West",
        ""
    ],
    [
        "Q.3. If it was Wednesday on 2 March, the then which day would come on 26 March ?",
        "Answer:Saturday",
        ""
    ],
    [
        "Q.4. 2 days before the yesterday, it was Tuesday, then which would be the day on the day after 2 days from tomorrow ?",
        ""
    ],
    [
        "Q.5. it is 4 hrs. 40 min. in a clock. Find the angle between both the needles of a clock.",
        "Answer : 1000",
        ""
    ],
    [
        "Q.6. In a code language, PAWAN is written as QBXBO, then how JAMUN will be written in the same language?",
        ""
    ],
    [
        "Q.7. How many digits in 284371 are such digit which are ate the same distance from the starting when they will be arranged in the descending order?",
        "(A) None (B) One (C) Two (D) None of these",
        "Answer : One",
        ""
    ],
    [
        "Q.8. Position of Sita from left is 18th and from right is 30th. Then how many people are in a queue?",
        "Answer : 47",
        "Direction (9 to 13) Eight friends  P,Q,R,S,T,U,V &amp; W are sitting around a circle facing the center. V is third to the right of Q &amp; second to the left of R. Q is second to the let of T &amp; immediate right of S. U is between Q &amp; T. P is not at the left of R.",
        ""
    ],
    [
        "Q.9. Who is exactly at left of S?",
        "(A) Q (B) P (C) U (D) V",
        "Answer : (B).",
        ""
    ],
    [
        "Q.10. Who is second to right of T?",
        "(A) R (B) P (C) W (D) V",
        "Answer : (C).",
        ""
    ],
    [
        "Q.11. In which of the following pairs first person sits exactly at right of second person ?",
        "(A) UT (B) WR (C) WT (D) VT",
        "Answer : (D).",
        ""
    ],
    [
        "Q.12. What is the exact position of W?",
        "(A) Just left is the second of V",
        "(B) Just right of V",
        "(C) In between U and V",
        "(D) Immediate right to R",
        "Answer : (B).",
        ""
    ],
    [
        "Q.13. Who is second at right of S?",
        "(A) U (B) R (C) T (D) P",
        "Answer : (A).",
        "Direction (14-20) : Study the following information carefully to answer the given question.",
        ""
    ],
    [
        "Q.14. Which of the following is the last lecture organized?",
        "(A) Statistics",
        "(B) Research Methods",
        "(C) Psychology",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : E",
        ""
    ],
    [
        "Q.15. If Wednesday is the holiday, then the code will be 2  4. If Thursday is a holiday, then the code will be 3-3. Which of the following codes is corrects on the basis of the holiday?",
        "(A) 2-4",
        "(B) 3-3",
        "(C) 4-2",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : E",
        ""
    ],
    [
        "Q.16. Which lecture will be conducted on Friday?",
        "(A) Economics",
        "(B) Psychology",
        "(C) Computer Science",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : E",
        ""
    ],
    [
        "Q.17. How many lectures were organized between Economics &amp; Psychology?",
        "(A) One",
        "(B) Two",
        "(C) Three",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : C",
        ""
    ],
    [
        "Q.18. On which day the Computer Science was organized?",
        "(A) Monday",
        "(B) Wednesday",
        "(C) Thursday",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : C",
        ""
    ],
    [
        "Q.19. Which day is a holiday?",
        "(A) Tuesday",
        "(B) Wednesday",
        "(C) Friday",
        "(D) Cannot be determined",
        "(E) None of these",
        "Answer : E",
        ""
    ],
    [
        "Q.20. If somebody wants to attend any two lectures from Psychology, Research Methods &amp; Computer Science; &amp; wish that both days should come one after other than which of the following combinations of the lectures should be selected?",
        "(A) Research Methods, Computer Science",
        "(B) Phycology, Computer Science",
        "(C) Psychology, Research Methods",
        "(D) Any two out of three are possible",
        "(E) It is not possible with the condition on the day after day",
        "Answer : A",
        "Direction (21-25): - S, R, N, L, M, T, O, &amp; P are eight persons sitting in a circle facing the center. Their different occupations are-reporter, doctor, cricketer, teacher, accountant, shopkeeper, painter &amp; Supervisor, but not necessarily in the same order as given.",
        ""
    ],
    [
        "Q.21. Who form the following is a reporter?",
        "(A) O",
        "(B) L",
        "(C) N",
        "(D) R",
        "(E) None of these",
        "Answer : A",
        ""
    ],
    [
        "Q.22.What is the position of S regarding R?",
        "(A) Third to the right",
        "(B) Second to the right",
        "(C) Third to the left",
        "(D) Second to the left",
        "(E) Fourth to the right.",
        "Answer : A",
        ""
    ],
    [
        "Q.23. If we count in the anti-clockwise direction starting from N; then how many persons are sitting between P &amp; N?",
        "(A) One",
        "(B) Two",
        "(C) Three",
        "(D) Four",
        "(E) None of these",
        "Answer : D",
        ""
    ],
    [
        "Q.24. As pe the position mentioned above; four of the following pairs are alike &amp; so they form their group. Which one does not belong to this group?",
        "(A) Teacher-Painter",
        "(B) Supervisor  Shopkeeper",
        "(C) Cricketer  Reporter",
        "(D) Doctor  Accountant",
        "(E) Shopkeeper  Doctor",
        "Answer : E",
        ""
    ],
    [
        "Q.25. Which of the following statement is false regarding the above-mentioned arrangement?",
        "(A) N is at the immediate right of supervisor.",
        "(B) Cricketer is third to the right of shopkeeper.",
        "(C) Doctor is sitting exactly between supervisor &amp; accountant",
        "(D) L is neither a teacher nor a supervisor.",
        "(E) Only three persons are between S &amp; N.",
        "Answer : C "
    ]
]