[
    [
        "Q.1. 15 children or 12 persons can go using a lift. How many children can go with 8 persons?",
        "(A) 5",
        "(B) 6",
        "(C) 7",
        "(D) 8",
        " Ans .  A",
        ""
    ],
    [
        "Q.2. Directions : Study the following arrangement and answer the following questions given below.",
        " ‘Barin’ village is 20 kilometres to the north of village ‘Khanof’ village, ‘Banoha’ is 18 kilometres to east of village’ Khanof’ village, Palasi village is 12 kilometres to the west of ‘Barin’. Nitin starts from village Banoha and goes to village palasi in which direction is he from starting point ?",
        "",
        "(A) North-East",
        "(B) North-west",
        "(C) South-East",
        "(D) North",
        "(E) None of these",
        " Ans .  B",
        ""
    ],
    [
        "Q.3. At a Reunion Party six girls are sitting in a row. B is to the left of C. D and E are not at any end. D is third from the right end and immediate right of C. A is to the left of B. E is between D and F. Who is sitting at the extreme left end?",
        "(A) B",
        "(B) C",
        "(C) A",
        "(D) E",
        "(E) D",
        " Ans .  A",
        ""
    ],
    [
        "Q.4. 10 people in a party offered gifts to one another. What was the total no. of gifts?",
        "(A) 35",
        "(B) 60",
        "(C) 40",
        "(D) 90",
        " Ans .  D",
        ""
    ],
    [
        "Q.5. Directions : Study the following arrangement and answer the following questions given below.",
        "   E 4 B % R 3 A 6 # F H @ I 2 D 9 & K U $ W 1 M P 5 * Q 8 T",
        "",
        "If all the numbers are dropped from the arrangement, then which of the following is ninth to the left of W ?",
        "(A) A",
        "(B) #",
        "(C) R",
        "(D) &amp;",
        "(E) None of these",
        " Ans .  E",
        ""
    ],
    [
        "Q.6. In a family A and E are husband and wife. B is brother-in-law of E. D is father-in-law of E. How is D related to B?",
        "(A) Brother",
        "(B) Mother",
        "(C) Father",
        "(D) Father-in-law",
        "(E) Daughter",
        " Ans .  C",
        ""
    ],
    [
        "Q.7. A groups of animals contains some deer &amp; some hens. Total no. of their heads is 15 &amp; total no. of their legs is 50. Find no. of deer in the group.",
        "(A) 5",
        "(B) 8",
        "(C) 7",
        "(D) 10",
        " Ans .  D",
        ""
    ],
    [
        "Q.8. If the first day of January is Tuesday what will be the fourteenth day of this month?",
        "(A) Saturday",
        "(B) Tuesday",
        "(C) Friday",
        "(D) Monday",
        "(E) Sunday",
        " Ans .  D",
        ""
    ],
    [
        "Q.9. In an examination, a candidate gets 2 marks for the right answer &amp; loose 1 marks for the wrong answer. He got 80 marks by answering 100 questions. How many of his answer were right ?",
        "(A) 30",
        "(B) 35",
        "(C) 40",
        "(D) 60",
        " Ans .  D",
        ""
    ],
    [
        "Q.10. There are 12 candidates, including some females, sitting in a row for an interview. A female candidate is seated at the right end. If a male candidate is followed by a female and preceded by a male candidate (assume that this pattern is repeated), then who is seated at the tenth place from the left end?",
        "(A) Male Candidate",
        "(B) Female Candidate",
        "(C) Either Male or Female Candidate",
        "(D) Cant be determined",
        "(E) None of these",
        " Ans .  A "
    ]
]