[
    [
        "Q.1. Direction: Each question given below consists of a statement, followed by two arguments numbered I and II. You have to decide which of the arguments is a strong argument and which is a weak argument.",
        "(a) if only argument I is strong;",
        "(b) if only argument II is strong;",
        "(C) If either I or II is strong;",
        "(d) if neither I nor II is strong and",
        "(e) if both I and II are strong.",
        " Ans . A",
        ""
    ],
    [
        "Q.2. Directions: In each question below is given a statement followed by two assumptions numbered I and II. You have to consider the statement and the following assumptions and decide which of the assumptions is implicit in the statement.",
        "(a) if only assumption I is implicit;",
        "(b) if only assumption II is implicit;",
        "(C) If either I or II is implicit;",
        "(d) if either I nor II is implicit and",
        "(e) If both I and II are implicit.",
        " Ans . B",
        ""
    ],
    [
        "Q.3.Direction: In each question below is given statement followed by two courses of action numbered I and II. You have to assume everything in the statement to be true and on the basis of the information given in the statement, decide which of the suggested courses of action logically follows(s) for pursuing.",
        "(a) if only I follow;",
        "(b) If only II follows,",
        "(c) If either I or II follows",
        "(d) If neither I nor II follows and",
        "(e) If both I and II follow.",
        " Ans . E",
        ""
    ],
    [
        "Q.4. Direction: In each of the following questions, a statement is given followed by two conclusions numbered I and II.",
        "(a) if only Conclusions I follow",
        "(b) If only Conclusions II follows",
        "(c) If either I or II follows",
        "(d) If neither I nor II follows and",
        "(e) If both I and II follow.",
        " Ans . B",
        ""
    ],
    [
        "Q.5. Direction: In each of the following questions, a statement is given followed by two conclusions numbered I and II.",
        "(a) if only Conclusions I follow",
        "(b) If only Conclusions II follows",
        "(c) If either I or II follows",
        "(d) If neither I nor II follows and",
        "(e) If both I and II follow.",
        " Ans . A  "
    ]
]