[
    [
        "Q.1. The prevention of accidents makes it necessary not only that safety devices be used to guard exposed machinery but also that mechanics be instructed in safety rules which they must follow for their own protection, and that lighting in the plant be adequate.",
        "The passage best supports the statement that industrial accidents –",
        "(A) are always avoidable.",
        "(B) may be due to ignorance",
        "(C) cannot be entirely overcome.",
        "(D) can be eliminated with the help of safety rules.",
        "(E) usually, result from inadequate machinery.",
        " Ans .  D",
        ""
    ],
    [
        "Q.2. It is up to our government and planners’ devices ways and means for the mobilization of about ten crore workers whose families total up about forty crore men, women and children. Our agriculture is over-manned. A lesser number of agriculturists would mean more purchasing or spending power to every agriculturist. This will result in the shortage of man power shortage of demand power for many commodities to be produced for which there will be new demand from a prosperous agrarian class. This shortage will be removed by surplus man power released from agriculture as suggested above.",
        "The passage best supports the statement that:",
        "(a) employment in production is more fruitful than employment in agriculture.",
        "(b) Indian economy is in a poor shape basically due to improper mobilization of man power.",
        "(c) a shift of labor from agricultural sector to the industrial sector would uplift the living standard.",
        "(d) the industrial sector is labor-deficient while the agricultural sector is over-manned in our country.",
        " Ans .  B",
        ""
    ],
    [
        "Q.3. To forgive an injury is often considered to be a sign of weakness; it is really a sign of strength. It is easy to a Now oneself to be carried away by resentment and hate into an act of vengeance, but it takes a strong character to restrain those natural passions. The man who forgives an injury proves himself to be the superior of the man who wronged himself and puts the wrong-doer to shame.",
        "The passage best supports the statement that: ",
        "(a) the sufferer alone knows the intensity of his sufferings",
        "(b) people tend to forgive the things happened in the past",
        "(c) natural passions are difficult to suppress.",
        "(d) mercy is the noblest form of revenge.",
        "(e) a person with calm and composed nature has depth of thought and vision.",
        " Ans .  D",
        ""
    ],
    [
        "Q.4. Exports and imports, a swelling favorable balance of trade, investments and bat bank-balance; are not an index or a balance sheet of national prosperity. Till the beginning of the Second World War, English exports were noticeably greater than what they are today. And yet England has greater national prosperity today than it ever had. Because the income of average Englishmen, working as field and factory laborers, clerks, policemen, petty of average Englishmen, working as field and factory laborers, clerks, policemen, petty shopkeepers and shop assistants, domestic workers and other low-paid workers has gone up.",
        "The passage best supports the statement that:",
        "(a) a country's economic standard can be best adjudged by per capita income.",
        "(b) a country's balance of trade is the main criteria of determining its economic prosperity.",
        "(c) a nation's economy strengthens with the increase in exports.",
        "(d) English trade has continually increased since the Second World War.",
        " Ans .  A",
        ""
    ],
    [
        "Q.5.Throughout the ages the businessman has helped build civilization's great cities, provided people with luxuries and artists with patronage, and lift his fellow citizens to understand the standard of living. In the last few centuries the businessman has seeded the Industrial Revolution around the world.",
        "The passage best supports the statement that the businessman ",
        "(a) is accountable to the society",
        "(b) lives luxurious and comfortable life.",
        "(C) is the beneficiary of the Industrial Revolution.",
        "(d) is capable of raising his standard of living.",
        "(e) has contributed to the growth of civilization.",
        " Ans .  A  "
    ]
]