[
    [
        "Q.1. A and B started a business by investing Rs. 36,000 and RS. 63,000. Find the share of each, out of the annual profit of Rs. 5500.",
        "(A) Rs. 2000, Rs. 3500",
        "(B) Rs. 2500, Rs. 3500",
        "(C) Rs. 3500, Rs. 2500",
        "(D) None of these",
        " Ans . A",
        ""
    ],
    [
        "Q.2. A starts some business with Rs. 50,000. After 3 months B joins him with Rs. 70,000. At the end of the year. In what ratio should they share the profit ?",
        "(A) 1 : 3",
        "(B) 3 : 2",
        "(C) 1 : 5",
        "(D) None of these",
        " Ans . D",
        ""
    ],
    [
        "Q.3. A started a business by investing Rs. 36,000. After 4 month B joined him with some investment. At he end of the year, the total profit was divided between them in the ratio of 9:7. How much capital was invested by B in the business?",
        "(A) Rs. 40,000",
        "(B) Rs. 42,000",
        "(C) Rs. 41,000",
        "(D) None of these",
        " Ans . B",
        ""
    ],
    [
        "Q.4. A started some business with RS 26,000. After 3 month B joined him with Rs. 16,000. After some more time C joined them with Rs. 25,000. At he end of the year, out of a total profit of Rs.15,453 C gets Rs. 3825 as his share. How many month after B joined the business did C join?",
        "(A) 3",
        "(B) 4",
        "(C) 5",
        "(D) None of these",
        " Ans . A",
        ""
    ],
    [
        "Q.5. A, B and C started a business with their investment in the ratio 1 : 2 : 4. After 6 month A invested the half amount more as before and B invested same the amount as before while C withdrew $${1\\over 4}$$ of the their investment. Find the ratio of their profits at the end of the year.",
        "(A) 5 : 12 : 13",
        "(B) 5 : 11 : 14",
        "(C) 5 : 12 : 14",
        "(D) None of these",
        " Ans . C",
        ""
    ],
    [
        "Q.6. A started a business with Rs. 52,000 and after 4 months B joined him with Rs. 39,000. At the end of the year, out of the total profit B received total 20,000 including 25% of the profit as commission for managing the business. What amount did A receive?",
        "(A) Rs. 20,000",
        "(B) Rs. 10,000",
        "(C) Rs. 15,000",
        "(D) None of these",
        " Ans . A",
        ""
    ],
    [
        "Q.7. A working partner get 20% as his commission of the profit after his commission is paid. If the working partners commission is Rs. 8000, Then what is the total profit in the business?",
        "(A) Rs. 47,000",
        "(B) Rs. 45,000",
        "(C) Rs. 48,000",
        "(D) None of these",
        " Ans . C",
        ""
    ],
    [
        "Q.8. Sharma Reader publication makes a profit of 9,00,000, 20% of which is paid as taxes. If the rest is divided among the partners P Q and R in the ratio of $$1:1{1\\over 4}:2$$, then the shares of P, Q and R are respectively:",
        "(A)Rs. 2,40,000; Rs. 3,20,000; Rs. 1,60,000",
        "(B) Rs. 3,20,000; Rs. 2,40,000; Rs. 1.60,000",
        "(C) Rs. 1,60,000; Rs. 3,20,000; Rs. 2,40,000",
        "(D) Rs. 1,60,000; Rs. 2,40,000; Rs. 3,20,000",
        " Ans . D",
        ""
    ],
    [
        "Q.9. We have to divide a sum of Rs. 13,950 among three person A, B and C. B must get the double of As share and C must get Rs. 50 less than the double of Bs share. The share of A will be :",
        "(A) Rs. 1950",
        "(B) Rs. 1981.25",
        "(C) Rs. 2000",
        "(D) Rs. 2007.75",
        " Ans . C",
        ""
    ],
    [
        "Q.10. A started business with Rs. 45,000 and B joined after ward with 30,000. If the profit at the end of a year was divided in the ratio 2 : 1 respectively, then B would have joined A for business after.",
        "(A) 1 month",
        "(B) 2 month",
        "(C) 3 month",
        "(D) 4 month",
        " Ans . C "
    ]
]