[
    [
        "Q1. The cost price of a radio is Rs. 600. The 5% of the cost price is charged towards transportation. After adding that, If net profit to be made is 15%, then the selling price of the radio must be</p>",
        " (A) Rs. 664.50 ",
        " (B) Rs. 684.50",
        " (C) Rs. 704.50 ",
        " (D) Rs. 724.50 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q2. A manufacturer fixes his selling price at $$33{1\\over3}\\% $$ over the cost of production. If the cost of production goes up by 12 % and manufacturer raises his selling price by 10%, his percentage profit is</p>",
        " (A) 35% ",
        " (B) $$28{3\\over8}\\%$$",
        " (C) $$36{5\\over9}\\%$$",
        " (D) $$30{20\\over21}\\%$$",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q3. A piece of land came to a person through three middlemen each gaining 20%. If the person purchased the land for Rs. 3,45,600 the original cost of the land was:</p>",
        " (A) Rs.1,75,800 ",
        " (B) Rs.2,00,000",
        " (C) Rs.1,00,000 ",
        " (D) Rs.1,50,000 ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q4. A shopkeeper sold his goods at half the list price and thus lost 20 %. If he had sold on the listed price, his gain percentage would be</p>",
        " (A) 20% ",
        " (B) 60% ",
        " (C) 35%",
        " (D) 72%",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q5. The cost price of an article is Rs x. It is marked up by 200%. It is sold at Rs. 540 after giving 25% discount. What is the value of x (in Rs)?</p>",
        " (A) 300 ",
        " (B) 240 ",
        " (C) 360 ",
        " (D)  250 ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q6. A merchant has 1000 kg sugar, some part of which he sells at 8 % profit and the rest at 18 % profit. He gains 14 % on the whole. The quantity sold at 8 % profit is:</p>",
        " (A) 400 kg",
        " (B) 560 kg ",
        " (C) 600 kg ",
        " (D) 640 kg",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q7. A trader sold an article at profit of 20%. Had he bought that article at 60% less price and sold it at Rs 90 less, then he would have gained 50%. What is the value (in Rs) of cost price?</p>",
        " (A) 250 ",
        " (B)  300",
        " (C) 150 ",
        " (D) 200 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q8. A &amp; B jointly made a profit of Rs. 1650 and they decided to share it such that 1/3 of A's profit is equal to 2/5 of B's profit. Then profit of B is</p>",
        " (A) Rs. 850",
        " (B) Rs. 800",
        " (C) Rs. 700",
        " (D) Rs. 750",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q9. By what fraction selling price ( S.P. ) must be multiplied to get the cost price ( C.P. ) if the loss is 20%?</p>",
        " (A)   $${5\\over4}$$",
        " (B)   $${6\\over5}$$",
        " (C) $${4\\over5}$$",
        " (D)   $${8\\over5}$$",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q10. Last year Mr. A bought two paintings. This year he sold them for Rs. 20,000 each. On one, he made a 25 % profit and of the other he had a 25 % loss. Then his net profit or loss is</p>",
        " (A) He earned more than Rs. 2000 ",
        " (B) He earned less than Rs . 2000 ",
        " (C) He lost more than Rs. 2000 ",
        " (D) He lost more than Rs. 2000 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q11. An article is sold at a profit of 25 %. If the selling price is doubled, the profit % will be:</p>",
        " (A) 100% ",
        " (B) 50% ",
        " (C) 200% ",
        " (D) 150% ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q12. Two - third of a consignment was sold at a profit of 5% and the remaining at a loss of 2 %. If the total profit was Rs. 400. then the value of the consignment was </p>",
        " (A) Rs . 16,000 ",
        " (B) Rs . 16,500",
        " (C) Rs . 15,000 ",
        " (D) Rs . 15,500",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q13. A man sells an article at 5 % above its cost price. If he had bought it at 5 % less than what he had paid for it and sold it at Rs. 2 less, he would have gained 10 %. The cost price of the article is</p>",
        " (A) Rs. 400",
        " (B) Rs. 100",
        " (C) Rs. 200",
        " (D) Rs. 300",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q14. If the cost of pins reduces by Rs . 4 per dozen, 12 more pins can be purchased for Rs. 48. The cost of pins per dozen after reduction is:</p>",
        " (A) Rs. 16 ",
        " (B) Rs. 20 ",
        " (C) Rs. 8",
        " (D) Rs . 12 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q15. There would be a 10 % loss. if rice is sold at  54 per kg. To earn a profit of 20 %, the price of rice per kg will be</p>",
        " (A)  63 ",
        " (B)  65 ",
        " (C)  72 ",
        " (D)  70 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q16. A businessman sells a commodity at 10 % profit. If he had bought it at 10 % less and sold it for Rs. 2 less, then he would have gained $$16{2\\over3}\\%$$. The cost price of the commodity is</p>",
        " (A) Rs . 32 ",
        " (B) Rs . 48",
        " (C) Rs . 36 ",
        " (D) Rs . 40 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q17. On selling 17 balls at Rs. 720 there is a loss equal to the cost price of 5 balls. The cost price of a ball is:</p>",
        " (A) Rs. 60 ",
        " (B) Rs. 55",
        " (C) Rs. 45 ",
        " (D) Rs. 50 ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q18. By selling a bicycle for Rs. 2,850 a shopkeeper gain 14%. If the profit is reduced to 8 %, then the selling price will be</p>",
        " (A) Rs. 2,800 ",
        " (B) Rs. 3,000",
        " (C) Rs. 2,600 ",
        " (D) Rs. 2,700 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q19. A shopkeeper sold sarees at Rs. 266 each after giving 5 % discount on labelled price. Had he not given the discount, he would have earned a profit of 12 % on the cost price. What was the cost price of each saree?</p>",
        " (A) Rs. 240 ",
        " (B) Rs. 250 ",
        " (C) Rs. 280 ",
        " (D) Rs. 260 ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q20. A man bought 20 dozen eggs for Rs. 720. What should be the selling price of each egg if he wants to make a profit of 20 %?</p>",
        " (A) Rs. 3.50 ",
        " (B) Rs. 3.60",
        " (C) Rs. 3.25 ",
        " (D) Rs. 3.30 ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q21. Mohan bought 25 books for Rs. 2,000 and sold them at a profit equal to the selling price of 5 books. The selling price of 1 book is:</p>",
        " (A) Rs . 120",
        " (B) Rs . 150 ",
        " (C) Rs . 100 ",
        " (D) Rs . 200 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q22. A cloth merchant on selling 33 metres of cloth obtains a profit equal to the selling price of 11 metres of cloth , the profit is</p>",
        " (A) 50% ",
        " (B) 11% ",
        " (C) 40% ",
        " (D) 22% ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q23. A book seller sells a book at a profit of 10 %. If he had bought it at 4 % less and sold it for Rs. 6 more. he would have gained $$18{3\\over4}\\%$$. The cost price of the book is</p>",
        " (A) Rs . 150 ",
        " (B) Rs . 160",
        " (C) Rs. 130",
        " (D) Rs. 140  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q24. The cost price of two dozen bananas is Rs. 32 After selling 18 bananas at the rate Rs. 12 per dozen, the shopkeeper reduced to rate as Rs. 4 per dozen. The percent loss is</p>",
        " (A) 36.5%",
        " (B) 37.5% ",
        " (C) 25.2% ",
        " (D) 32.4%  ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q25. Krishna bought a camera and paid 20 % less than its original price. He sold it at 40 % profit on the price he had paid. The percentage of profit earned by Krishna on the original price was</p>",
        " (A) 12",
        " (B) 15 ",
        " (C) 22",
        " (D) 32",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q26. The price of jewelry , passing through three hands. rises on the whole by 65 %. If the first and the second sellers earned 20 % and 25 % profit respectively, the profit earned by the third seller is</p>",
        " (A) 10% ",
        " (B) 5% ",
        " (C) 20%",
        " (D) 15% ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q27. If a manufacturer gains 10 percent, wholesaler 15 percent and retailer 25 percent, then the production cost of an article, whose retail price is Rs. 1,265, is</p>",
        " (A) Rs. 800 ",
        " (B) Rs. 900 ",
        " (C) Rs. 700 ",
        " (D) Rs. 750 ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q28. A merchant fixes the sale price of his goods at 15 % above the cost price. He sells his goods at 12 % less than the fixed price. His percentage of profit is:</p>",
        " (A)   $$1{1\\over5}$$",
        " (B)   $$2{1\\over5}$$",
        " (C) $$2{1\\over2}$$",
        " (D)   2",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q29. A merchant buys an article for Rs. 27 and sells it at a profit of 10 % of the selling price. The selling price of the article is:</p>",
        " (A) Rs. 37 ",
        " (B) Rs.32 ",
        " (C) Rs. 29.70",
        " (D) Rs. 30 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q30. A person bought some articles at the rate of 5 per rupee and the same number at the rate of 4 per rupee. He mixed both the types and sold at the rate of 9 for 2 rupees. In this business he suffered a loss of Rs. 3. The total number of articles bought by him was</p>",
        " (A) 540 ",
        " (B) 545",
        " (C) 1090",
        " (D) 1080 ",
        "Correct Answer : D "
    ]
]