[
    [
        "Q.1. Union Minister for Human Resource Development (MHRD) held a detailed review of the National online education platform SWAYAM and the 32 DTH Television Education Channels SWAYAM PRABHA in New Delhi on 20 April. Who is Union Minister for Human Resource Development?</p>",
        " (A) D.V. Sadananda Gowda",
        " (B) Ramesh Pokhriyal 'Nishank'",
        " (C) Thaawar Chand Gehlot",
        " (D) Prakash Javadekar",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.2. What is the name of mobile application which aims to effectively track home-quarantines citizens and ensure they are actually staying in the home developed by Pune Municipal Corporation under Smart Cities Mission (SCM)?</p>",
        " (A) Savdhan",
        " (B) Saiyam",
        " (C) Saksham",
        " (D) Satark",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.3. Union Minister of Finance &amp; Corporate Affairs Nirmala Sitharaman participated in the 5th Annual Meeting of Board of Governors of New Development Bank through video-conference. Where is the Headquarters of NDB?</p>",
        " (A) Shanghai",
        " (B) Delhi",
        " (C) Rio de Janeiro",
        " (D) Volgograd",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.4. World Creativity and Innovation Day is observed on which date?</p>",
        " (A) 21 April",
        " (B) 12 April",
        " (C) 20 April",
        " (D) 19 April",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. RBI announces extension of Ways &amp; Means Advances limit from Rs 1.2 lakh crore to how much for the remaining part of first half of the financial year 2020-21?</p>",
        " (A) Rs 1.5 lakh crore",
        " (B) Rs 1.8 lakh crore",
        " (C) Rs 2.5 lakh crore",
        " (D) Rs 2 lakh crore",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.6. Secretary's day or Administrative Professionals Day is observed on which date in India?</p>",
        " (A) 12 April",
        " (B) 20 April",
        " (C) 21 April",
        " (D) 22 April",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.7. Border Roads Organisation (BRO) constructed the Daporijo bridge over which river?</p>",
        " (A) Dihing River",
        " (B) Dibang River",
        " (C) Subansiri river",
        " (D) Lohit River",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.8. Union Minister of Health &amp; Family Welfare, Dr. Harsh Vardhan launched which platform that aims to establish a direct channel of communication with millions of Indians amid the pandemic?</p>",
        " (A) COVID India Info",
        " (B) COVID India Stop",
        " (C) COVID India Seva",
        " (D) COVID India Care",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.9. The Economic Advisory Council of the Fifteenth Finance Commission (XIV-FC) has been scheduled to meet on 23-24 April 2020. Who is the Chairman of the 15th Finance Commission?</p>",
        " (A) Omkar Goswami",
        " (B) N.K. Singh",
        " (C) Sajjid Z Chinoy",
        " (D) Krishnamurthy Subramanian",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. Who has been reappointed as the Managing Director (MD) and Chief Executive Officer (CEO) of the Private sector lender City Union Bank?</p>",
        " (A) N Kamakodi",
        " (B) N Kamakodi",
        " (C) Sajjid Z Chinoy",
        " (D) Neelkanth Mishra",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.11. Central government departments asked to include \"transgender\" as a separate category of gender for recruitment in civil services and other posts. Who is the Minister of Personnel, Public Grievances and Pensions?</p>",
        " (A) Amit Shah",
        " (B) Narendra Modi",
        " (C) Narendra Singh Tomar",
        " (D) Prakash Javadekar",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.12. Which city uses Vehicle tracking applications and GPS (Global Positioning System) enabled smartwatches for waste collection drivers in its fight against COVID-19 pandemic?</p>",
        " (A) Chandigarh",
        " (B) Delhi",
        " (C) Amritsar",
        " (D) Bhopal",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.13. Fitch Solutions cuts India's economic growth forecast for 2020-21 to how much percent?</p>",
        " (A) 1.5%",
        " (B) 1.8 %",
        " (C) 2.1%",
        " (D) 2.8%",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.14. Who has been appointed as the Secretary to President Ram Nath Kovind?</p>",
        " (A) Krishnamurthy Subramanian",
        " (B) Kapil Dev Tripathi",
        " (C) Neelkanth Mishra",
        " (D) Prachi Mishra",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.15. Which state govt. partners with healthcare startup MedCords for consultation and medicine delivery through Aayu &amp; Sehat Sathi apps?</p>",
        " (A) Uttar Pradesh",
        " (B) Rajasthan",
        " (C) Haryana",
        " (D) Punjab",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.16. Defence Research and Development Organisation (DRDO) shifted its testing facility from Defence Research Development Establishment (DRDE), Gwalior to which of the following institute?</p>",
        " (A) Centre for Nano and Soft Matter Sciences",
        " (B) Institute of Nuclear Medicine &amp; Allied Sciences, Delhi",
        " (C) The Indian Institute of Science (IISc), Bangaluru",
        " (D) The Indian Institute of Technology, Delhi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. Who has been appointed as the new Ambassador for World Wide Fund (WWF) India's Environment Education program?</p>",
        " (A) Viswanathan Anand",
        " (B) Sourav Ganguly",
        " (C) Sachin Tendulkar",
        " (D) Virat Kohli",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.18. The International Monetary Fund (IMF) proposed to release its full lending capacity to support countries that battle the COVID-19 outbreak. What is its full lending capacity?</p>",
        " (A) $4 trillion",
        " (B) $3 trillion",
        " (C) $2 trillion",
        " (D) $1 trillion",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. RMS Titanic sank, which was carrying around 2000 passengers and crew, sank on which of the following date?</p>",
        " (A) April 15, 1922",
        " (B) April 15, 1912",
        " (C) April 15, 1932",
        " (D) April 15, 1902",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.20. The US State Department said in a report on April 15, 2020 that which of the following country may have secretly set off low-level underground nuclear test explosions despite claiming to observe an international pact banning such blasts?</p>",
        " (A) China",
        " (B) Isarel",
        " (C) North Korea",
        " (D) Pakistan",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.21. What is India's growth rate in 2020 as per IMF?</p>",
        " (A) 2.9%",
        " (B) 4.9%",
        " (C) 3.9%",
        " (D) 1.9%",
        "Correct Answer : D  "
    ]
]