[
    [
        "Q.1. Recently which player has been chosen as the ambassador for 'Badminton' awareness campaign of World Badminton Federation (BWF)?</p>",
        " (A) Chetan Anand",
        " (B) PV Indus",
        " (C) Saina Nehwal",
        " (D) Srikanth Kidambi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.2. The Central Government recently issued an ordinance in view of the attacks on health workers across the country, under which the culprits can now be punished for up to how many years?</p>",
        " (A) Ten years",
        " (B) Ten years",
        " (C) twenty years",
        " (D) Seven Years",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. Which state government has banned the use and sale of all tobacco products including cigarettes, bidis, gutkha, zarda, betel nut, hookah, e-hookah, e-cigarettes in the wake of corona virus?</p>",
        " (A) Bihar",
        " (B) Punjab",
        " (C) Jharkhand",
        " (D) Gujarat",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. Ministry of Power issued a draft proposal for amendment of Electricity Act, 2003 in the form of the draft Electricity Act (Amendment) Bill, 2020 for comments/suggestions from Stakeholders on 17th April 2020. Who is current Minister of Power?</p>",
        " (A) Dr. Jitendra Singh",
        " (B) Santosh Kumar Gangwar",
        " (C) Shri Raj Kumar Singh",
        " (D) Shri Hardeep Singh Puri",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.5. Recently the government constituted 15th Finance commission under the Chairman- ship of N.K. Singh. Who was the Chairman of 14th Finance commission?</p>",
        " (A) Y. V. Reddy ",
        " (B) Dr. Vijay Kelkar ",
        " (C) K. C. Pant ",
        " (D) C. Rangarajan ",
        " (E) A. M Khusro ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.6. Indian Premier League is delayed by how much time due to COVID-19?</p>",
        " (A) 3 Months",
        " (B) Suspended indefinitely",
        " (C) 1 Months",
        " (D) 2 Months",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. Pradhan Mantri Awas Yojana has been launched with the motive to provide 'Housing for all' by 2022. It was launched in the year-</p>",
        " (A) 2014  ",
        " (B) 2015 ",
        " (C) 2016",
        " (D) 2017 ",
        " (E) None of these ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.8. Which company announced the acquisition of the UK's most iconic sporting motorcycle Norton for 16 million, by acquiring certain assets of Norton Motorcycles?</p>",
        " (A) Tata Motors Limited",
        " (B) Maruti Suzuki India Limited",
        " (C) TVS Motor Company",
        " (D) Ashok Leyland",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.9. Recently which leading two-wheeler company of India has acquired 122 year old motorcycle company 'Norton' in United Kingdom?</p>",
        " (A) Tvs",
        " (B) Yamaha",
        " (C) Bajaj",
        " (D) Honda",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.10. Which mobile application has been launched by the Union Ministry of Agriculture and Farmers Welfare to reduce disruption in agro-based supply chains?</p>",
        " (A) Peasant chariot",
        " (B) Heaven chariot",
        " (C) Public welfare",
        " (D) Farmer welfare",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.11. World Heritage Day is celebrated on which of the following days?</p>",
        " (A) 18 April",
        " (B) 20 March",
        " (C) 10 February",
        " (D) 15 January",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.12. Dubai's Supreme Committee of Crisis and Disaster Management announced the extension of the 24-hour National Sterilisation Programme for how much time?</p>",
        " (A) 1 week",
        " (B) 2 weeks",
        " (C) 4 weeks",
        " (D) 3 Days",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.13. Around 40 Indian business representatives logged on to a first-of-its-kind virtual roundtable organized by the Indian High Commission in London. Who is prime minister of UK?</p>",
        " (A) Tony Blair",
        " (B) David Cameron",
        " (C) Boris Johnson",
        " (D) Theresa May",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.14. US President Donald Trump unveiled a three-phase plan to reopen the country's economy following the COVID-19 outbreak. Which of the following countries have maximum confirmed cases?</p>",
        " (A) USA",
        " (B) Spain",
        " (C) Italy",
        " (D) China",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.15. Which of the following is the first green state in the country which does not have cases of corono virus?</p>",
        " (A) Bihar",
        " (B) Punjab",
        " (C) Goa",
        " (D) Delhi",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.16. How many inter-ministerial teams were formed by the central government to assess the situation and effectively prevent COVID-19?</p>",
        " (A) 7",
        " (B) 8",
        " (C) 6",
        " (D) 5",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.17. Civil Service Day is observed on which of the following days?</p>",
        " (A) 21 April",
        " (B) 10 March",
        " (C) 15 January",
        " (D) 10 June",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.18. Which state's CM inaugurated the online delivery website 'Cghaat' which will facilitate doorstep delivery of fruits and vegetables?</p>",
        " (A) Haryana",
        " (B) Tamil Nadu",
        " (C) Andhra Pradesh",
        " (D) Chhattisgarh",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. The Reserve Bank of India (RBI) has announced the second set of measures to preserve financial stability and help put money in the hands of the needy and disadvantaged during the extended lockdown due to the COVID-19 crisis. Reverse repo rate has been reduced by how many basis points from 4.0%?</p>",
        " (A) 20 basis points",
        " (B) 25 basis points",
        " (C) 35 basis points",
        " (D) 50 basis points",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.20. Central Drug Standard Control Organisation (CDSCO) has approved how many Indian firms for antibody rapid testing kits for testing COVID-19?</p>",
        " (A) 57",
        " (B) 47",
        " (C) 67",
        " (D) 27",
        "Correct Answer : C   "
    ],
    [
        ""
    ]
]