[
    [
        "Q.1. IMF chief Kristalina Georgieva confirmed the world economy was already sluggish before the coronavirus outbreak now bound to suffer a \"severe recession\" in 2020. Where is headquaters of IMF?</p>",
        " (A) Washington D.C",
        " (B) Warsaw",
        " (C) New York City",
        " (D) Bucharest",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. US President Donald Trump unveiled a three-phase plan to reopen the country's economy following the COVID-19 outbreak. Which of the following countries have maximum confirmed cases?</p>",
        " (A) USA",
        " (B) Spain",
        " (C) Italy",
        " (D) China",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.3. Home Ministry extended regular and e-visas of all foreigners who are stranded in India due to the coronavirus lockdown till which date on a gratis basis?</p>",
        " (A) May 3",
        " (B) May 6",
        " (C) May 2",
        " (D) May 1",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.4. Dubai's Supreme Committee of Crisis and Disaster Management announced the extension of the 24-hour National Sterilisation Programme for how much time?</p>",
        " (A) 1 week",
        " (B) 2 weeks",
        " (C) 4 weeks",
        " (D) 3 Days",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. Union Health Minister Dr. Harsh Vardhan had a detailed meeting with medical officials with Delhi Medical Superintendents of various hospitals in New Delhi. Who is current Health Minister of Delhi?</p>",
        " (A) Manish Sisodia",
        " (B) Imran Hussain",
        " (C) Satyendra Kumar Jain",
        " (D) Gopal Rai",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.6. Civil Service Day is observed on which of the following days?</p>",
        " (A) 21 April",
        " (B) 10 March",
        " (C) 15 January",
        " (D) 10 June",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.7. RBI announced to increase the advance limit from Rs 1.2 lakh crore to how many lakh crore rupees for the remaining part of the first half of FY 2020-21?</p>",
        " (A) 3 lakh crores",
        " (B) 4 lakh crores",
        " (C) 2 lakh crores",
        " (D) 5 lakh crores",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.8. How many companies have been selected by the Department of Biological Technology (DBT), which will be funded to develop the Kovid-19 vaccine?</p>",
        " (A) 4",
        " (B) 5",
        " (C) 8",
        " (D) 3",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.9. Which of the following is the first green state in the country which does not have cases of corono virus?</p>",
        " (A) Bihar",
        " (B) Punjab",
        " (C) Goa",
        " (D) Delhi",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.10. Which link has been launched by Road Transport Ministry for the list of Dhabas and truck repair shops on its website?</p>",
        " (A) Dashboard",
        " (B) Carboard",
        " (C) Slashboard",
        " (D) Blackboard",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.11. What is name of mascot for the 4th Asian Para Games at Hangzhou, China in October 2022?</p>",
        " (A) Soohorang",
        " (B) Feifei",
        " (C) Soohorang",
        " (D) Miraitowa",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.12. RBI raises Ways and Means Advances limit for States by how much percent over and above the level as on 31 March 2020?</p>",
        " (A) 30%",
        " (B) 60%",
        " (C) 40%",
        " (D) 50%",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.13. World Heritage Day is celebrated on which date?</p>",
        " (A) April 16",
        " (B) April 12",
        " (C) April 18",
        " (D) April 14",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.14. Around 40 Indian business representatives logged on to a first-of-its-kind virtual roundtable organized by the Indian High Commission in London. Who is prime minister of UK?</p>",
        " (A) Tony Blair",
        " (B) David Cameron",
        " (C) Boris Johnson",
        " (D) Theresa May",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.15. Which institute designs 'WardBot' to deliver food, medicines to COVID-19 patients in isolation wards without human intervention?</p>",
        " (A) IIT Patna",
        " (B) IIT Mumbai",
        " (C) IIT Delhi",
        " (D) IIT Ropar",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.16. Which country termed the changes in FDI policy by India as a violation of WTO principles?</p>",
        " (A) Nepal",
        " (B) Nepal",
        " (C) Japan",
        " (D) Russia",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. How many inter-ministerial teams were formed by the central government to assess the situation and effectively prevent COVID-19?</p>",
        " (A) 7",
        " (B) 8",
        " (C) 6",
        " (D) 5",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.18. Which of the following company has developed the 'Talkback' keyboard for the visually impaired?</p>",
        " (A) Google",
        " (B) TCS",
        " (C) Facebook",
        " (D) Amazon",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.19. Recently a petition has been filed in the Supreme Court to direct which state government to conduct COVID-19 test among the tribal population residing in Godavari river valley area?</p>",
        " (A) Bihar",
        " (B) Andra Pradesh",
        " (C) Uttar Pradesh",
        " (D) Tamil Nadu",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.20. Recently who has been appointed the secretary of President Ramnath Kovind?</p>",
        " (A) Rahul Rai",
        " (B) Manoj Tripathi",
        " (C) Neeraj Agnihotri",
        " (D) Kapil Dev Tripathi",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.21. Central Drug Standard Control Organisation (CDSCO) has approved how many Indian firms for antibody rapid testing kits for testing COVID-19?</p>",
        " (A) 57",
        " (B) 47",
        " (C) 67",
        " (D) 27",
        "Correct Answer : C   "
    ]
]