[
    [
        "Q.1. Dr. Harsh Vardhan, Union Minister for Science &amp; Technology reviewed and directed which institute's scientists to develop COVID-19 mitigation solutions to effectively combat the disease on 13 April, 2020?</p>",
        " (A) CSIR",
        " (B) ISRO",
        " (C) DRDO",
        " (D) IIT",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. DAY-NRLM , Ministry of Rural Development, has contributed to the challenge of COVID-19 situation in the country. What is full form of A in DAY-NRLM?</p>",
        " (A) Ahimsa",
        " (B) Aashra",
        " (C) Awas",
        " (D) Antyodaya",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. Which country overtakes Italy (19,468) with highest coronavirus deaths?</p>",
        " (A) Uganda",
        " (B) UAE",
        " (C) USA",
        " (D) UK",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. The University Grants Commission (UGC) has formed a committee to promote online learning in the wake of nation-wide lockdown due to coronavirus. Who is the chairman of UGC?</p>",
        " (A) AP Patel",
        " (B) DP Singh",
        " (C) AP Chaudhary",
        " (D) KP Sisodia",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.5. Team at the University of Delhi South Campus-Centre for Innovation in Infectious Disease Research, Education and Training (UDSC-CIIDRET) is planning to find solution/cure to the coronavirus. Which of the following Professor is leading the team?</p>",
        " (A) Vijay Chaudhary",
        " (B) Amitabh Chaudhary",
        " (C) Rajiv Chaudhary",
        " (D) Arvind Chaudhary",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.6. Atal Innovation Mission (AIM), policy think tank NITI Aayog and National Informatics Centre (NIC) jointly launched which of the following collaborative network, on 13 April which provide a total engineering solution from 2D drafting &amp; detailing to 3D product design?</p>",
        " (A) DesignCAD",
        " (B) 2D-3DCAD",
        " (C) CollabCAD",
        " (D) NetdesignCAD",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.7. Under which scheme, free Liquefied petroleum gas Refills will be provided to Ujjwala beneficiaries over the period of 3 months, that is, from April-June 2020?</p>",
        " (A) PMJJBY",
        " (B) PMMY",
        " (C) PMSSY",
        " (D) PMGKY",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.8. YUKTI a web-portal \"Young India Combating COVID with Knowledge, Technology and Innovation\" was launched by which of the following Minister?</p>",
        " (A) Shripad Yesso Naik",
        " (B) Ramesh Pokhriyal \"Nishank\"",
        " (C) Dharmendra Pradhan",
        " (D) Hardeep Singh Puri",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. Border Roads Organisation (BRO) opened the strategic Srinagar-Leh highway on 11 April. When was Border Road Organisation Formed?</p>",
        " (A) 1950",
        " (B) 1947",
        " (C) 1957",
        " (D) 1960",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.10. British citizen Stirling Moss dies aged 90 in London. He was a famous person of which field?</p>",
        " (A) Formula One racing driver",
        " (B) Table Tennis Player",
        " (C) Tennis player",
        " (D) Cricket player",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.11. <strong>Odia New Year is celebrated on which day in 2020?</strong></p>",
        " (A) 11 April",
        " (B) 12 April",
        " (C) 13 April",
        " (D) 14 April",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.12. 13 April 2020 marked which anniversary of the Jallianwala Bagh Massacre?</p>",
        " (A) 102",
        " (B) 101",
        " (C) 100",
        " (D) 99",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.13. Smartphone manufacturer Apple is making a software similar to Arogya Setu to enable COVID-19 contact tracing through phones with the help of which of the following company?</p>",
        " (A) IBM",
        " (B) TCS",
        " (C) Yahoo",
        " (D) Google",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.14. Indian Council of Medical Research (ICMR) approved the bioassay laboratory of which of the following institute as an extension of diagnostic facility of Employees' State Insurance Corporation (ESIC) Medical College and Hospital?</p>",
        " (A) The Indian Institute of Science",
        " (B) Jawaharlal Nehru Centre for Advanced Scientific Research",
        " (C) Translational Health Science and Technology Institute (THSTI),Faridabad",
        " (D) Sree Chitra Tirunal Institute for Medical Sciences and Technology",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.15. Which institute based in Hyderabad is currently Testing patient samples, Training on COVID-19 Testing, Sequencing of the SARS-CoV-2 genome, Culturing SARS-CoV-2 Virus for Testing Repurposed &amp; New Drugs?</p>",
        " (A) CSIR-CCMB",
        " (B) CSIR-CMERI",
        " (C) CSIR-CFTRI",
        " (D) CSIR-AMPRI",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.16. According to the Indian Council of Medical Research (ICMR), how many vaccines are under various stages of development of COVID-19?</p>",
        " (A) 5",
        " (B) 10",
        " (C) 40",
        " (D) 15",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.17. According to World Bank's 'South Asia Economic Focus' report what will be the growth rate of Indian economy?</p>",
        " (A) 2.5%-3.8%,",
        " (B) 3.5%-4.8%,",
        " (C) 4.5%-5.8%,",
        " (D) 1.5%-2.8%",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.18. Bangladesh Former President Sheikh Mujibur Rahman's killer Abdul Majed hanged in Dhaka. Who is current President of Bangladesh?</p>",
        " (A) Shahabuddin Ahmed",
        " (B) Zillur Rahman",
        " (C) Iajuddin Ahmed",
        " (D) Mohammad Abdul Hamid",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. The IUSSTF has invited Proposals for 'COVID-19 Indo-US Virtual Networks' on 13 April which allow Indian and the US scientists and engineers currently engaged in COVID-related research. What is the full form of F in IUSSTF?</p>",
        " (A) Forum",
        " (B) Firm",
        " (C) Functions",
        " (D) Foundation",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.20. According to World bank 'South Asia Economic Focus' report COVID-19 will hit South Asia very hard, likely to wipe out gains made in poverty alleviation. When was World Bank formed?</p>",
        " (A) July 1943",
        " (B) July 1946",
        " (C) July 1944",
        " (D) July 1945",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. With 70% annual global production share, which country tops Hydroxychloroquine producer, exporter chart?</p>",
        " (A) China",
        " (B) Pakistan",
        " (C) India",
        " (D) USA",
        "Correct Answer : C  "
    ]
]