[
    [
        "Q.1. The International Monetary Fund (IMF) proposed to release its full lending capacity to support countries that battle the COVID-19 outbreak. What is its full lending capacity?</p>",
        " (A) $4 trillion",
        " (B) $3 trillion",
        " (C) $2 trillion",
        " (D) $1 trillion",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.2. Which application has become the world's fastest app to reach 50 million downloads in just 13 days?</p>",
        " (A) Ludo King",
        " (B) Tiktok",
        " (C) Aarogya Setu",
        " (D) Zoom Vidoe call",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.3. <strong>The Central</strong> Board of Direct Taxes (CBDT) stated that it has already issued over 10.2 lakh refunds totalling to how much money as of 14 April 2020?</p>",
        " (A) Rs.3,250 crore",
        " (B) Rs.4,250 crore",
        " (C) Rs.5,250 crore",
        " (D) Rs.6,250 crore",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.4. The Department of Science and Technology (DST), Government of India, developed which mobile application that is prepared and managed by the Survey of India (SoI)to help decision making during the COVID-19 pandemic?</p>",
        " (A) CORYO",
        " (B) COVYO",
        " (C) SAHYO",
        " (D) SOVYO",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.5. When was 73rd foundation day of Himachal Pradesh celebrated?</p>",
        " (A) April 10",
        " (B) April 15",
        " (C) April 11",
        " (D) April 16",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. The International Monetary Fund (IMF) in its report on the Asia-Pacific region stated that Asia's economic growth in 2020 will grind to a halt for the first time in 60 years due to the COVID-19 pandemic. When was International Monetary Fund (IMF) Formed?</p>",
        " (A) 27 December 1944",
        " (B) 27 December 1945",
        " (C) 27 December 1946",
        " (D) 27 December 1947",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. The Government of India has announced which act a punishable offence under the strict Disaster Management Act in its revised guidelines for lockdown issued to contain COVID-19?</p>",
        " (A) Dancing in public",
        " (B) Making Tiktok in public",
        " (C) Fighting in public",
        " (D) Spitting in public",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.8. Which country launched multiple short-range anti-ship cruise missiles into the sea when every country is fighting COVID-19?</p>",
        " (A) USA",
        " (B) North Korea",
        " (C) Russia",
        " (D) Israel",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. RMS Titanic sank, which was carrying around 2000 passengers and crew, sank on which of the following date?</p>",
        " (A) April 15, 1922",
        " (B) April 15, 1912",
        " (C) April 15, 1932",
        " (D) April 15, 1902",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. The Ministry of External Affairs (MEA) has announced a training program on COVID-19 from 17 April 2020 for healthcare professionals from SAARC countries by the Central government's Indian Technical and Economic Cooperation (ITEC) program. When was ITEC Programme was established?</p>",
        " (A) 15 September 1974",
        " (B) 15 September 1954",
        " (C) 15 September 1964",
        " (D) 15 September 1984",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.11. India has received how many testing kits, including rapid antibody test kits, from two Chinese firms for better monitoring and surveillance?</p>",
        " (A) 1 lakh",
        " (B) 5 lakh",
        " (C) 2 lakh",
        " (D) 2 lakh",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.12. Union Minister for Finance &amp; Corporate Affairs Nirmala Sitharaman participated in the virtual session of the 2nd G20 Finance Ministers and Central Bank Governors (FMCBG) meeting on which date?</p>",
        " (A) 10 April",
        " (B) 11 April",
        " (C) 15 April",
        " (D) 12 April",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.13. Ministry of Panchayati Raj, Government of India remains in close coordination with State Governments, District authorities and Gram Panchayats to ensure that lockdown conditions are not violated and norms of social distancing are followed. Who is current Minister of Panchayati Raj?</p>",
        " (A) Narendra Singh Tomar",
        " (B) D.V. Sadananda Gowda",
        " (C) Thaawar Chand Gehlot",
        " (D) Prakash Javadekar",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.14. The Government of India decided to divide all districts across the country into how many categories considering number of COVID-19 cases?</p>",
        " (A) 3",
        " (B) 4",
        " (C) 2",
        " (D) 5",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.15. On April 16, 2020, the Indian Army chief issued directives to all the military cantonments, headquarters, establishments to strictly ensure no movement of forces till April 19, 2020. Who is current Indian Army chief?</p>",
        " (A) Manoj Naravane",
        " (B) V.K. Singh",
        " (C) Bikram Singh",
        " (D) Bipin Rawat",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.16. Industries operating in rural areas (i.e. outside the limits of municipal corporations and municipalities) allowed to resume production from which date?</p>",
        " (A) May 3",
        " (B) April 20",
        " (C) April 25",
        " (D) April 27",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. The Union Minister of Agriculture and Farmers' Welfare Narendra Singh Tomar addressed the \"National Conference on Kharif crops 2020\" through a video conference. Which of the following is not a Kharif crop?</p>",
        " (A) Bajra",
        " (B) Barley",
        " (C) Maize",
        " (D) Cotton",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.18. State-owned Coal India Limited (CIL) is to deliberate on model bid documents for the development and operation of underground mines.How much percent of India's domestic coal production comes from CIL?</p>",
        " (A) 80%",
        " (B) 20%",
        " (C) 25%",
        " (D) 65%",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.19. The Union Home Ministry has issued an advisory stating that which of the following app is \"not safe\" for private persons and entities?</p>",
        " (A) FreeConference app",
        " (B) Google Hangouts app",
        " (C) Zoom videoconferencing app",
        " (D) Skype app",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.20. The US State Department said in a report on April 15, 2020 that which of the following country may have secretly set off low-level underground nuclear test explosions despite claiming to observe an international pact banning such blasts?</p>",
        " (A) China",
        " (B) Isarel",
        " (C) North Korea",
        " (D) Pakistan",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.21. <strong>Rongali Bihu is the Harvest Festival of Assam. It was celebrated on which date in 2020?</strong></p>",
        " (A) 13 April",
        " (B) 12 April",
        " (C) 14 April",
        " (D) 11 April",
        "Correct Answer : C  "
    ]
]