[
    [
        "Q.1. The US reaffirmed its determination to sell Harpoon air-launched anti-ship missiles and Mark 54 lightweight torpedoes worth $155 million to which of the following country?</p>",
        " (A) India",
        " (B) China",
        " (C) Israel",
        " (D) Pakistan",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. Government of India launched the All India Agri Transport Call Centre at a function in New Delhi on 15 April. The center was launched by Union Minister of Agriculture and Farmers Welfare. What is the name of Union Minister of Agriculture and Farmers Welfare?</p>",
        " (A) Narendra Singh Tomar",
        " (B) D.V. Sadananda Gowda",
        " (C) Thaawar Chand Gehlot",
        " (D) Prakash Javadekar",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.3. <strong>PM Modi and Palestinian President discuss COVID-19 pandemic challenges. Who is current President of Palestinian?</strong></p>",
        " (A) Ahmed Qurei",
        " (B) Mahmoud Abbas",
        " (C) Yasser Arafat",
        " (D) Rawhi Fattouh",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.4. <strong>Rongali Bihu is the Harvest Festival of Assam. It was celebrated on which date in 2020?</strong></p>",
        " (A) 13 April",
        " (B) 12 April",
        " (C) 14 April",
        " (D) 11 April",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.5. <strong>The Ministry of HRD has directed the National Institute of Open Schooling (NIOS) to initiate a unique method to ensure effective schooling to reach the unreached directly at doorstep. NIOS has initiated which platform of MHRD for various subjects from class 9th to 12th?</strong></p>",
        " (A) SIKHO",
        " (B) SWAYAM",
        " (C) LEARN",
        " (D) SAB PADHE",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. The Ministry of Tourism has launched which webinar series to provide information on the many destinations and details and expanse of the culture and heritage of our Incredible India?</p>",
        " (A) DeshDekhoApna",
        " (B) DekhoApnaDesh",
        " (C) DekhoHmaraDesh",
        " (D) SeeyourCountry",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. Which country will host the 2020 Asian Boxing Championship?</p>",
        " (A) Singapore",
        " (B) China",
        " (C) India",
        " (D) Bangladesh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.8. Government of India has initiated a dialogue with the exporters of Agri and Allied commodities due to the lockdown. The representatives of industries including food processing, spices, cashew nuts, and machine &amp; equipment (M&amp;E) sectors requested permission to open/operate at least what strenght?</p>",
        " (A) 15-30%",
        " (B) 45-50%",
        " (C) 25-30%",
        " (D) 35-40%",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.9. What is India's growth rate in 2020 as per IMF?</p>",
        " (A) 2.9%",
        " (B) 4.9%",
        " (C) 3.9%",
        " (D) 1.9%",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.10. Ministry of Home Affairs (MHA) issued Consolidated Revised Guidelines for the Containment of COVID-19 epidemic in the Country. Who is current home minister of india?</p>",
        " (A) Rajnath Singh",
        " (B) Amit Shah",
        " (C) Nitin Gadkari",
        " (D) Nirmala Sitharaman",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. The Centre is to pass an ordinance which will allow the state governments the flexibility to increase the work hours of employees across establishments to how many housrs per day from eight hours?</p>",
        " (A) 9",
        " (B) 10",
        " (C) 11",
        " (D) 12",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. Ordnance Factory Board (OFB) began the supply of coveralls conforming to ISO Class 3 exposure standards. The initial order of 1.10 lakh from HLL Lifecare Limited (HLL) has begun in OFB.Where is headquaters of OFB?</p>",
        " (A) Lucknow",
        " (B) Chandigarh",
        " (C) Delhi",
        " (D) Kolkata",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.13. Which institute has developed COVID-19 Sample Collection Kiosk (COVSACK) to combat COVID-19?</p>",
        " (A) Translational Health Science and Technology Institute",
        " (B) Sree Chitra Tirunal Institute for Medical Sciences and Technology",
        " (C) Jawaharlal Nehru Centre for Advanced Scientific Research",
        " (D) Defence Research &amp; Development Laboratory, Hyderabad",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.14. SC says only persons covered under which scheme can be tested for free for COVID-19 in private labs?</p>",
        " (A) Pradhan Mantri Matru Vandana Yojana",
        " (B) Ayushman Yojana",
        " (C) Pradhan Mantri Suraksha Bima Yojana",
        " (D) Atal Pension Yojana",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.15. GMR Airports Limited gets approval to build greenfield International airport in which of the following district?</p>",
        " (A) Siddipet",
        " (B) Kurnool",
        " (C) Anantapur",
        " (D) Vizianagaram",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.16. The University Grants Commission (UGC) has formed a committee to promote online learning in the wake of nation-wide lockdown due to coronavirus. Who is the chairman of UGC?</p>",
        " (A) AP Patel",
        " (B) DP Singh",
        " (C) AP Chaudhary",
        " (D) KP Sisodia",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. Under which scheme, free Liquefied petroleum gas Refills will be provided to Ujjwala beneficiaries over the period of 3 months, that is, from April-June 2020?</p>",
        " (A) PMJJBY",
        " (B) PMMY",
        " (C) PMSSY",
        " (D) PMGKY",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.18. Team at the University of Delhi South Campus-Centre for Innovation in Infectious Disease Research, Education and Training (UDSC-CIIDRET) is planning to find solution/cure to the coronavirus. Which of the following Professor is leading the team?</p>",
        " (A) Vijay Chaudhary",
        " (B) Amitabh Chaudhary",
        " (C) Rajiv Chaudhary",
        " (D) Arvind Chaudhary",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.19. The IUSSTF has invited Proposals for 'COVID-19 Indo-US Virtual Networks' on 13 April which allow Indian and the US scientists and engineers currently engaged in COVID-related research. What is the full form of F in IUSSTF?</p>",
        " (A) Forum",
        " (B) Firm",
        " (C) Functions",
        " (D) Foundation",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.20. According to the Indian Council of Medical Research (ICMR), how many vaccines are under various stages of development of COVID-19?</p>",
        " (A) 5",
        " (B) 10",
        " (C) 40",
        " (D) 15",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. 13 April 2020 marked which anniversary of the Jallianwala Bagh Massacre?</p>",
        " (A) 102",
        " (B) 101",
        " (C) 100",
        " (D) 99",
        "Correct Answer : B  "
    ]
]