[
    [
        "Q.1. Who has been appointed as the new Ambassador for World Wide Fund (WWF) India's Environment Education program?</p>",
        " (A) Viswanathan Anand",
        " (B) Sourav Ganguly",
        " (C) Sachin Tendulkar",
        " (D) Virat Kohli",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. Which institute is to develop plasmonic semiconductor nanomaterials for the removal of toxic organic compounds from water by harvesting solar light?</p>",
        " (A) Translational Health Science and Technology Institute (THSTI),Faridabad",
        " (B) Institute of Advanced Study in Science and Technology (IASST), Assam",
        " (C) The Indian Institute of Science (IISc) , Bangaluru",
        " (D) The Indian Institute of Technology, Delhi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.3. Tour de France cycling race postponed from June 27 to which date?</p>",
        " (A) August 29",
        " (B) August 21",
        " (C) May 29",
        " (D) May 21",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.4. Which institute is currently developing an inactivated virus vaccine for COVID-19?</p>",
        " (A) Centre for Cellular and Molecular Biology (CCMB)",
        " (B) Jawaharlal Nehru Centre for Advanced Scientific Research",
        " (C) Translational Health Science and Technology Institute (THSTI),Faridabad",
        " (D) Sree Chitra Tirunal Institute for Medical Sciences and Technology",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. Defence Research and Development Organisation (DRDO) shifted its testing facility from Defence Research Development Establishment (DRDE), Gwalior to which of the following institute?</p>",
        " (A) Centre for Nano and Soft Matter Sciences",
        " (B) Institute of Nuclear Medicine &amp; Allied Sciences, Delhi",
        " (C) The Indian Institute of Science (IISc), Bangaluru",
        " (D) The Indian Institute of Technology, Delhi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. The Reserve Bank of India (RBI) released the 49th round of quarterly OBICUS of the manufacturing sector. What is full form of O in OBICUS?</p>",
        " (A) Office",
        " (B) Order",
        " (C) Offset",
        " (D) Owner",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. Which institute has developed a compact solid-state sensor that can detect the heavy metal ions in water?</p>",
        " (A) Centre for Nano and Soft Matter Sciences",
        " (B) Institute of Advanced Study in Science and Technology (IASST), Assam",
        " (C) The Indian Institute of Science (IISc) , Bangaluru",
        " (D) The Indian Institute of Technology, Delhi",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. Which institute has developed a diagnostic test kit that can confirm COVID-19 in 2 hours at a low cost?</p>",
        " (A) Centre for Cellular and Molecular Biology (CCMB)",
        " (B) Jawaharlal Nehru Centre for Advanced Scientific Research",
        " (C) Translational Health Science and Technology Institute (THSTI),Faridabad",
        " (D) Sree Chitra Tirunal Institute for Medical Sciences and Technology, Trivandrum",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.9. Algerian author Abdelouahab Aissaoui wins $50,000 International Prize for Arabic Fiction (IPAF) for which novel?</p>",
        " (A) The Good Muslim",
        " (B) Girls of Riyadh",
        " (C) The Spartan Court",
        " (D) Persepolis",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.10. Government-appointed committee of experts, headed by IBBI (Insolvency and Bankruptcy Board of India) Chairperson , recommends setting up National Institute of Valuers?</p>",
        " (A) Aditya Puri",
        " (B) M S Sahoo",
        " (C) Sanjay Agarwal",
        " (D) Sandeep Bakhshi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. Which State's/UT's Chief Minister announced that the Doctors will conduct the clinical trial of plasma enrichment technique to treat severely-ill coronavirus patients soon?</p>",
        " (A) Rajasthan",
        " (B) Uttar Pradesh",
        " (C) Haryana",
        " (D) Delhi",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. Central Drug Standard Control Organisation (CDSCO) has approved how many Indian firms for antibody rapid testing kits for testing COVID-19?</p>",
        " (A) 57",
        " (B) 47",
        " (C) 67",
        " (D) 27",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.13. Pusa Decontamination and Sanitizing Tunnel are developed by the Division of Agricultural Engineering, Indian Agricultural Research Institute. Where is Indian Agricultural Research Institute Situated?</p>",
        " (A) Bhopal",
        " (B) New Delhi",
        " (C) Amritsar",
        " (D) Amritsar",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.14. Mobile phones, televisions, refrigerators, laptops and stationary items will be allowed to be sold through e-commerce platforms like Amazon, Flipkart and Snapdeal from which date?</p>",
        " (A) April 20",
        " (B) April 17",
        " (C) April 25",
        " (D) April 29",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.15. World Haemophilia Day was observed on which date?</p>",
        " (A) 17 April",
        " (B) 12 April",
        " (C) 13 April",
        " (D) 16 April",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.16. Which country halt his annual funding to WHO?</p>",
        " (A) Spain",
        " (B) China",
        " (C) USA",
        " (D) Italy",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.17. Who tops Forbes annual world's billionaires list with a net worth of $113 billion?</p>",
        " (A) Warren Buffett",
        " (B) Jeff Bezos",
        " (C) Michael Bloomberg",
        " (D) Mark Zuckerberg",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.18. The Reserve Bank of India (RBI) has announced the second set of measures to preserve financial stability and help put money in the hands of the needy and disadvantaged during the extended lockdown due to the COVID-19 crisis. Reverse repo rate has been reduced by how many basis points from 4.0%?</p>",
        " (A) 20 basis points",
        " (B) 25 basis points",
        " (C) 35 basis points",
        " (D) 50 basis points",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.19. Which state's CM inaugurated the online delivery website 'Cghaat' which will facilitate doorstep delivery of fruits and vegetables?</p>",
        " (A) Haryana",
        " (B) Tamil Nadu",
        " (C) Andhra Pradesh",
        " (D) Chhattisgarh",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.20. Which country is the most digitally dexterous country in the world according to Gartner 2019 Digital Workplace Survey?</p>",
        " (A) Pakistan",
        " (B) India",
        " (C) USA",
        " (D) China",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.21. The International Monetary Fund (IMF) in its report on the Asia-Pacific region stated that Asia's economic growth in 2020 will grind to a halt for the first time in 60 years due to the COVID-19 pandemic. When was International Monetary Fund (IMF) Formed?</p>",
        " (A) 27 December 1944",
        " (B) 27 December 1945",
        " (C) 27 December 1946",
        " (D) 27 December 1947",
        "Correct Answer : B   "
    ]
]