[
    [
        "Q.1. Which of the following institutes developed an electrochemical sensing platform to detect carcinogenic or mutagenic compound N-nitrosodimethylamine and N-nitrosodiethanolamine?</p>",
        " (A) Institute of Advanced Study in Science and Technology",
        " (B) Indian Institute Technology of Madras",
        " (C) Centre for Nano and Soft Matter Sciences",
        " (D) Agharkar Research Institute",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. State-owned Ircon International Limited has signed a MoU with which company to explore opportunities for joint development of railways and other infrastructure projects in Asia, Africa and Latin America?</p>",
        " (A) Canadian Pacific Railway",
        " (B) Limited Liability Company",
        " (C) Indian Institute of Technology",
        " (D) Union Pacific Company",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.3. The World Bank announced emergency operations of how much worth to 100 developing countries over a 15-month period to fight the deadly Coronavirus?</p>",
        " (A) 260 billion USD",
        " (B) 160 billion USD",
        " (C) 100 billion USD",
        " (D) 200 billion USD",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.4. International Day for Biological Diversity is celebrated every year on which date?</p>",
        " (A) May 21",
        " (B) May 20",
        " (C) May 19",
        " (D) May 22",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.5. A rare palm of South Andaman Island 'Pinanga andamanensis' will be grown in which state with the help of Jawaharlal Nehru Tropical Botanic Garden and Research Institute?</p>",
        " (A) Telangana",
        " (B) Kerala",
        " (C) Tamil Nadu",
        " (D) Andhra Pradesh",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. Which of the following institutes has developed a cup-shaped design mask that helps to create enough space in front of the mouth while speaking to tackle COVID-19?</p>",
        " (A) Translational Health Science and Technology Institute",
        " (B) Sree Chitra Tirunal Institute for Medical Sciences and Technology",
        " (C) Centre for Nano and Soft Matter Sciences",
        " (D) Agharkar Research Institute",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.7. The Indian Council of Medical Research (ICMR) has announced that it is to replace hydroxychloroquine (HCQ) with which tea to improve immunity and possibly reduce viral replication, in the revised protocol?</p>",
        " (A) Kangra tea",
        " (B) Assam Tea",
        " (C) Darjeeling Tea",
        " (D) Nilgiri Tea",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. International Day to End Obstetric Fistula is observed on which date?</p>",
        " (A) 23 May",
        " (B) 22 May",
        " (C) 21 May",
        " (D) 20 May",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.9. Dr. Harsh Vardhan participated in the Non-Aligned Movement Health Ministers meeting through video conference. When was NAM established?</p>",
        " (A) 1951",
        " (B) 1961",
        " (C) 1971",
        " (D) 1981",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. Which of the following institutes developed 'Parabolic Trough Collector', a new trough collector equipped with enhanced energy to serve industries?</p>",
        " (A) Translational Health Science and Technology Institute",
        " (B) Indian Institute Technology of Madras",
        " (C) Centre for Nano and Soft Matter Sciences",
        " (D) Agharkar Research Institute",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. What was the theme of Micro, Small and Medium Enterprises E-conclave, \"Society of Indian Defence Manufacturers MSME Conclave 2020\"?</p>",
        " (A) Business Continuity for MSMEs in Defence Sector",
        " (B) Business Continuity for MSMEs in Service Sector",
        " (C) Business Continuity for MSMEs in Manufacturing Sector",
        " (D) Business Continuity for MSMEs in Defence &amp; Aerospace Sector",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. The Reserve Bank of India (RBI) has released its Monetary Policy Statement 2020-21 in Mumbai , Maharashtra. Who is Governer of RBI?</p>",
        " (A) Shaktikanta Das",
        " (B) Nirmala Sitharaman",
        " (C) Raghuram Rajan",
        " (D) Urjit Patel",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.13. Government has notified the amendments to the General Financial Rules(GFR) 2017 that the global tenders will be banned for government procurement upto how much worth?</p>",
        " (A) 250 crores",
        " (B) 150 crores",
        " (C) 200 crores",
        " (D) 100 crores",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.14. The United Nations has listed which state's initiative \"khudol\" among the top 10 global initiatives for an inclusive fight against the COVID-19 pandemic?</p>",
        " (A) Sikkim",
        " (B) Nagaland",
        " (C) Manipur",
        " (D) Mizoram",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.15. Which institute has mapped two alternative dwarf genes - Rht14 and Rht18- in wheat that can eliminate rice crop residue burning?</p>",
        " (A) Institute of Advanced Study in Science and Technology",
        " (B) Indian Institute Technology of Madras",
        " (C) Centre for Nano and Soft Matter Sciences",
        " (D) Agharkar Research Institute",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.16. Which company acquired a 10% strategic stake in Voicezen, a Gurgaon based startup in early stage focused on conversational AI technologies?</p>",
        " (A) BSNL",
        " (B) Bharti Airtel",
        " (C) Vodafone Idea",
        " (D) Jio",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. The Textiles Committee, Mumbai was named as the ninth approved laboratory to test and certify PPE body coveralls produced in the country for healthcare workers. Who is current Union Textile Minister?</p>",
        " (A) Sadhvi Niranjan Jyoti",
        " (B) Smriti Zubin Irani",
        " (C) Harsimrat Kaur Badal",
        " (D) Nirmala Sitharaman",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.18. Who has been appointed by the World Bank to a key position on climate change and disaster management in South Asia?</p>",
        " (A) Mansukh Jha",
        " (B) Raj Kumar",
        " (C) Abhas Jha",
        " (D) Hardeep Kumar",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.19. If <strong>ADVANCE</strong> is coded as <strong>CEWCXMG,</strong> then what will be code for BRITAIN?</p>",
        " (A) DRIVRZP",
        " (B) CRIVRZP ",
        " (C) DIRVRZP ",
        " (D) DRIGRZP ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.20. IRDAI has approved the proposal of which bank to continue with its 30% holding in IndiaFirst Life?</p>",
        " (A) Punjab National Bank",
        " (B) UCO Bank",
        " (C) Union Bank of India",
        " (D) Indian Overseas Bank",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. UNICEF partnered with which company to support the school children in the coronavirus affected areas and provide them access to remote learning in africa?</p>",
        " (A) Bharti Airtel",
        " (B) Reliance",
        " (C) Idea Cellular",
        " (D) Tata Indicom",
        "Correct Answer : A   "
    ]
]