[
    [
        "Q.1. ICMR has approved a total of how many laboratories across India to conduct the tests for COVID-19?</p>",
        " (A) 624 laboratories",
        " (B) 324 laboratories",
        " (C) 424 laboratories",
        " (D) 224 laboratories",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. World Digestive Health Day is observed on which of the following days?</p>",
        " (A) 12 June",
        " (B) 15 March",
        " (C) 29 May",
        " (D) 10 April",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.3. Who wrote the song titled 'Jayatu Jayatu Bharatam - Vasudev Kutumbakkam' to increase the nation's will power and evoke the spirit of self-reliance in COVID-19 pandemic?</p>",
        " (A) Amitabh Bhattacharya",
        " (B) Javed Akhtar",
        " (C) Gulzar",
        " (D) Prasoon Joshi",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.4. World Cycle Day is observed on which of the following days?</p>",
        " (A) 3 June",
        " (B) 25 March",
        " (C) 15 April",
        " (D) 10 January",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. Recently which young female cricketer has been nominated for the Arjuna Award?</p>",
        " (A) Poonam Yadav",
        " (B) Memorize",
        " (C) Radha Yadav",
        " (D) Deepti Sharma",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.6. The Central Government has recently launched a portal to help solve the problems of 'micro, small and medium enterprises'?</p>",
        " (A) The champions",
        " (B) The strength",
        " (C) Solution",
        " (D) Invitation",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.7. Recently the Income Tax Return (ITR) form has been notified for the assessment year 2020-21, in which information will be obtained on cash deposits over which limit?</p>",
        " (A) 10 crores",
        " (B) 1 crore rupees",
        " (C) 15 crores",
        " (D) 2 crore rupees",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.8. According to Indian Meteorological Department (IMD), in which period of the year does the southwest monsoon occur?</p>",
        " (A) May-september",
        " (B) January-february",
        " (C) March April",
        " (D) June-September",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.9. International Missing Children's Day is observed every year on which date?</p>",
        " (A) May 24",
        " (B) May 27",
        " (C) May 25",
        " (D) May 23",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.10. The first phase of the Army Commanders conference will be organised on which date?</p>",
        " (A) 22 to 26 May",
        " (B) 25 to 30 May",
        " (C) 1 to 5 June",
        " (D) 27 to 29 May",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.11. What is the name of military war game centre at the Uganda Senior Command and Staff College of Uganda developed by the Indian Association Uganda and Indian Military Advisory and Training Team for Uganda Peoples Defence Forces?</p>",
        " (A) GameOn",
        " (B) INDUGA",
        " (C) INDIA",
        " (D) WarOn",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.12. Power Finance Corporation the central PSU and India's leading NBFC, signed an agreement with which company to fund hydro-electric projects worth Rs.22,000 on 26 May 2020?</p>",
        " (A) Power Grid Corporation of India Limited",
        " (B) NTPC Limited",
        " (C) Adani Power Limited",
        " (D) Narmada Basin Projects Company Ltd.",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.13. Who lead the team of scientists of Botanical Survey of India who discovered 3 new plant species namely- Eugenia sphaerocarpa, Goniothalamus sericeus and Memecylon nervosum at the Western Ghats in Kerala and Tamil Nadu?</p>",
        " (A) Manju Sharma",
        " (B) Samir K. Brahmachari",
        " (C) A. A. Mao",
        " (D) K.A. Sujana",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.14. Which state became the 1st state to release a report highlighting its conservation efforts to save over 1,100 rare plants from extinction?</p>",
        " (A) Uttar Pradesh",
        " (B) Madhya pradesh",
        " (C) Uttarakhand",
        " (D) Himachal Pradesh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.15. Who inaugurated the Chamba Tunnel in Uttarakhand under Chardham Pariyojana through video conference mode on 26 May 2020?</p>",
        " (A) Raj Nath Singh",
        " (B) Amit Shah",
        " (C) Nirmala Sitharaman",
        " (D) Nitin Gadkari",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.16. REC Foundation, has tied up with TajSATS, a joint venture of IHCL and SATS Ltd, to distribute specially-made nutritious meal packets for medical staff in which hospital?</p>",
        " (A) Apollo Hospital",
        " (B) Safdarjung Hospital",
        " (C) ESIC AYUSH HOSPITAL NARELA",
        " (D) BLK Super Speciality Hospital, Delhi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. Which state becomes the 1st state to grant sports an industry status to boost the sports sector, generate employment, increase value of sports?</p>",
        " (A) Mizoram",
        " (B) Nagaland",
        " (C) Sikkim",
        " (D) Assam",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.18. What is the name of PPE kit made with innovative breathable fabric material, to provide comfort to healthcare workers working against COVID-19 pandemic developed by Indian Navy?</p>",
        " (A) CovRakshak",
        " (B) NavCov",
        " (C) CovNav",
        " (D) NavRakshak",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. The World Health Organization have teamed up with which organisation to fight the battle against Covid-19 and have signed an agreement to work together to promote health through sport and physical activity?</p>",
        " (A) International Olympic Committee",
        " (B) The Federation Internationale de Football Association",
        " (C) International Cricket Council",
        " (D) International Sports Federations",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.20. CSIR-IIIM, Jammu a constituent laboratory of CSIR signed MoU with which company to develop and scale-up a new Reverse Transcriptase-Loop Mediated Isothermal Amplification based COVID-19 diagnostic kit?</p>",
        " (A) Tech Mahindera",
        " (B) Reliance Industries Limited",
        " (C) Infosys",
        " (D) Tata Group",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.21. Who has been appointed as the Member of Commission on Economic Recovery of New York?</p>",
        " (A) Siddhartha Mukherjee",
        " (B) Satish Tripathi",
        " (C) Rohan Tripathi",
        " (D) Abhinay Mukherjee",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.22. World Thyroid Day all is observed on which day all over the world?</p>",
        " (A) 22th May",
        " (B) 23th May",
        " (C) 25th May",
        " (D) 26th May",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.23. Who won men's events respectively in Steinitz Memorial online blitz chess?</p>",
        " (A) Daniil Dubov",
        " (B) Viswanathan Anand",
        " (C) Magnus Carlsen",
        " (D) Garry Kasparov",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.24. HIL INDIA, a PSU under the Department of Chemicals and Petrochemicals is to supply 25 MT Malathion Technical for supply to locust control programme to which country under Government to Government arrangement?</p>",
        " (A) Bhutan",
        " (B) Iraq",
        " (C) Nepal",
        " (D) Iran",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.25. R Shanmugam passed away on 23 May due to age-related illness. He was a famous?</p>",
        " (A) Chess player",
        " (B) Football player",
        " (C) Criket player",
        " (D) Tennis player",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.26. Union Minister Prakash Javadekar launched how many initiatives towards conservation of biodiversity during the virtual celebration of \"International Day for Biological Diversity (IDB)\"?</p>",
        " (A) 6",
        " (B) 2",
        " (C) 5",
        " (D) 3",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.27. Which state governments on 23 May imposed a 50% 'Special COVID Fee' on the maximum retail price of liquor while allowing home delivery of alcohol in the State from 24 May?</p>",
        " (A) Karnataka",
        " (B) Telangana",
        " (C) Odisha",
        " (D) Tamil Nadu",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.28. World Turtle Day is celebrated on which day every year?</p>",
        " (A) May 23",
        " (B) May 21",
        " (C) May 20",
        " (D) May 22",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.29. Jitendra Nath Pande who had tested positive for COVID-19 earlier this week, died at his residence on 23 May. He was a professional?</p>",
        " (A) Doctor",
        " (B) Cricketer",
        " (C) Boxer",
        " (D) Singer",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.30. Maruti Suzuki India Limited, has joined hands with which company to launch 'Buy Now Pay Later' financing scheme to make the purchase of its cars even more convenient?</p>",
        " (A) Muthoot Finance Limited",
        " (B) Cholamandalam Investment and Finance Company Limited",
        " (C) Mahindra &amp; Mahindra Financial Services Limited",
        " (D) Bajaj Finance Limited",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.31. Which bank has introduced a special fixed deposit scheme for senior citizens which offers an interest rate of 6.55% per annum for deposits up to Rs 2 crores with a tenure of more than 5 years to 10 years?</p>",
        " (A) HSBC Bank India",
        " (B) ICICI bank",
        " (C) Bank of India",
        " (D) Union Bank Of India",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.32. Who has become the highest paid female athlete in the world, topping American great Serena Williams?</p>",
        " (A) Venus Williams",
        " (B) Naomi Osaka",
        " (C) Steffi Graf",
        " (D) Simone Biles",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.33. The Indian Council of Medical Research (ICMR) has announced that it is to replace hydroxychloroquine (HCQ) with which tea to improve immunity and possibly reduce viral replication, in the revised protocol?</p>",
        " (A) Kangra tea",
        " (B) Assam Tea",
        " (C) Darjeeling Tea",
        " (D) Nilgiri Tea",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.34. Which of the following institutes developed 'Parabolic Trough Collector', a new trough collector equipped with enhanced energy to serve industries?</p>",
        " (A) Translational Health Science and Technology Institute",
        " (B) Indian Institute Technology of Madras",
        " (C) Centre for Nano and Soft Matter Sciences",
        " (D) Agharkar Research Institute",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.35. A rare palm of South Andaman Island 'Pinanga andamanensis' will be grown in which state with the help of Jawaharlal Nehru Tropical Botanic Garden and Research Institute?</p>",
        " (A) Telangana",
        " (B) Kerala",
        " (C) Tamil Nadu",
        " (D) Andhra Pradesh",
        "Correct Answer : B  "
    ]
]