[
    [
        "Q.1. Internal Displacement Monitoring Centre (IDMC) released its Global Report on Internal Displacement (GRID) 2020 on 29 April. Which country reported highest displacement in the world, due to disasters, including cyclones and monsoon floods?</p>",
        " (A) Pakistan",
        " (B) Bangladesh",
        " (C) China",
        " (D) India",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.2. Which company will set up two Centres for Invention, Innovation, Incubation and Training (CIIITs) at Baramulla and Jammu?</p>",
        " (A) HCL Technologies Limited",
        " (B) Tata Technologies",
        " (C) Reliance Industries",
        " (D) Larsen &amp; Toubro Infotech Limited",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.3. Maharashtra Day and Gujarat Day is celebrated on which date?</p>",
        " (A) 2 May",
        " (B) 30 April",
        " (C) 28 April",
        " (D) 1 May",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.4. Which institute has developed a microwave sterilizer named \"ATULYA\". The sterilizer will disintegrate coronavirus?</p>",
        " (A) BARC",
        " (B) Defence Institute of Advanced Technology",
        " (C) ISRO",
        " (D) ICMR",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.5. A programme was organized for Delhi Police personnel at New Delhi on 30 April which aims to fight against corona through simple and time tested Ayurveda immunity-boosting measures.What was the name of programme?</p>",
        " (A) BARC",
        " (B) AYURAKSHA",
        " (C) ICMR",
        " (D) ISRO",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. Ministry of Coal (MoC) launched a Project Monitoring Unit (PMU) for the facilitation of early operationalization of coal mines allocated by the Central Government. Who is current coal minister?</p>",
        " (A) Giriraj Singh",
        " (B) Pralhad Joshi",
        " (C) Piyush Goyal",
        " (D) Mukhtar Abbas Naqvi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. What is India's rank among 117 nations in terms of budget transparency and accountability by Open Budget Survey?</p>",
        " (A) 53rd",
        " (B) 51rd",
        " (C) 52rd",
        " (D) 54rd",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. The US space agency NASA has partnered with SpaceX, Blue Origin and Dynetics to build lunar landing systems that can carry astronauts to the moon by 2024. Who is the owner of Blue Origin company?</p>",
        " (A) Larry Page",
        " (B) Elon Reeve Musk",
        " (C) Bill Gates",
        " (D) Jeffrey Preston Bezos",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.9. What was the title of 12th session of Dekho Apna Desh of Tourism Ministry held on 30 April 2020?</p>",
        " (A) Celebrating the Citizens in Responsible Tourism",
        " (B) Celebrating the Incredible Indian Women in Responsible Tourism",
        " (C) Celebrating the Incredible India in Responsible Tourism",
        " (D) Celebrating the Incredible Indian Men in Responsible Tourism",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. Students form which university have developed an intelligent device that will analyze if a coughing person is a COVID-19 carrier?</p>",
        " (A) Jawaharlal Nehru University, Delhi",
        " (B) Jadavpur University, Kolkata",
        " (C) Amity University, Noida",
        " (D) Anna University, Chennai",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. Who assumed charge as Secretary, Ministry of Road Transport and Highways?</p>",
        " (A) Vaidya Rajesh Kotecha",
        " (B) Giridhar Aramane",
        " (C) Kapil Dev Tripath",
        " (D) Atul Chaturvedi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.12. Govt. raises MSP (Minimum Support Price) for MFP (Minor Forest Produce) of how many items to benefit livelihoods of tribal gatherers in view of circumstance arising out of Covid 19?</p>",
        " (A) 59 items",
        " (B) 49 items",
        " (C) 79 items",
        " (D) 69 items",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.13. The Ministry of Home Affairs clarified rules regarding opening of shops/services during lockdown Barber shops and salons located in green and orange zones will be allowed to open. Who is current Home Secretary to Ministry of Home Affairs?</p>",
        " (A) Samant Goel",
        " (B) Rajiv Gauba",
        " (C) Anil Kumar Gupta",
        " (D) Ajay Kumar Bhalla",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.14. World Press Freedom Day is celebrated on which date every year?</p>",
        " (A) April 30",
        " (B) May 3",
        " (C) April 29",
        " (D) May 1",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.15. Which state's govt. launched Mukhya Mantri Shahari Rojgar Guarantee Yojna guaranteeing at least 120 days' employment to the those living in urban?</p>",
        " (A) Uttarakhand",
        " (B) Himachal Pradesh",
        " (C) Andhra Pradesh",
        " (D) Jharkhand",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.16. According to IHS Markit India what is the Manufacturing Purchasing Managers' Index (PMI) of the manufacturing sector activity of the country in April?</p>",
        " (A) 17.4",
        " (B) 27.4",
        " (C) 67.4",
        " (D) 67.4",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.17. Which of the following political parties will bear the cost of rail travel of needy home-bound migrants stranded at various places across the country due to the coronavirus-induced lockdown?</p>",
        " (A) Congress",
        " (B) BSP",
        " (C) AAP",
        " (D) CPI",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.18. Which state's government has made it compulsory to download the Arogya Setu app for those living in hotspot areas of the state?</p>",
        " (A) Uttar Pradesh",
        " (B) Tripura",
        " (C) Kerala",
        " (D) Telangana",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.19. The Union Minister Narendra Singh Tomar launched which collection that will showcase daily utility products made by rural self-help groups?</p>",
        " (A) The Farmer Collection",
        " (B) The SHG Collection",
        " (C) The Saras Collection",
        " (D) The Rural Collection",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.20. The National Mission for Clean Ganga operating (NMCG) under Ministry of Jal Shakti launched \"IDEAthon\" titled \"The future of River Management\". Who is current Jal Shakti Minister?</p>",
        " (A) Gajendra Singh Shekhawat",
        " (B) Shripad Yesso Naik",
        " (C) Raj Kumar Singh",
        " (D) Jitendra Singh",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.21. How many Indian journalists have been honoured with the \"Pulitzer Prize 2020\"?</p>",
        " (A) 2",
        " (B) 5",
        " (C) 13",
        " (D) 3",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.22. Who assumed command of the Army Training Command (ARTRAC)on 1 May 2020?</p>",
        " (A) Kanwal Jeet Singh Dhillon",
        " (B) S K Shrivastava",
        " (C) Raj Shukla",
        " (D) Madhuri Kanitkar",
        "Correct Answer : C "
    ]
]