[
    [
        "Q.1. Which 2 of these people have recently been selected for the Abel Award for the year 2020?</p>",
        " (A) Hillel Furstenberg - Mark Fox",
        " (B) Hillel Furstenberg - Gregory Margulis",
        " (C) Andy James - Gregory Margulis",
        " (D) Hillel Furstenberg - Charles Ferguson",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.2. World tuberculosis day is celebrated every year?</p>",
        " (A) 22 March",
        " (B) 20 March",
        " (C) 21 March",
        " (D) 24 March",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. Recently, who has become the new Chief Minister of Madhya Pradesh after Kamal Nath?</p>",
        " (A) Jyotiraditya Scindia",
        " (B) Surendra Patwa",
        " (C) Shivraj Singh Chauhan",
        " (D) Shiv Bahadur Singh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. World Meteorological Day is celebrated every year?</p>",
        " (A) 18 March",
        " (B) 17 March",
        " (C) 23 March",
        " (D) 10 March",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.5. World Water Day is celebrated every year?</p>",
        " (A) 02 March",
        " (B) 12 March",
        " (C) 22 March",
        " (D) 20 March",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.6. World Accreditation Day was observed on which day?</p>",
        " (A) 6 June",
        " (B) 9 June",
        " (C) 17 June",
        " (D) 26 June",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. Which institute developed \"ANANYA\" water based disinfectant spray with nanotechnology assisted formulation?</p>",
        " (A) Tata Institute of Fundamental Research",
        " (B) National Institute of Science Education and Research",
        " (C) The Defence Institute of Advanced Technology",
        " (D) The Manohar Parrikar Institute for Defence Studies",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.8. What is the name of Fast Patrol Vessels for the Indian Coast Guard delivered by Warship builder Garden Reach Shipbuilders and Engineers Ltd on 9 June?</p>",
        " (A) ICGS Ameya Amogh",
        " (B) ICGS Kanaklata Barua",
        " (C) ICGS Achook",
        " (D) ICGS Atulya",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. On 8th June, Massive fire broke at a natural-gas oil well in the Baghjan oil field of which Indian state?</p>",
        " (A) Assam",
        " (B) Mizoram",
        " (C) Sikkim",
        " (D) Arunachal Pradesh",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.10. S&amp;P Global Ratings predicted that Indian economy will shrink how much pecent in FY21 and the fiscal stimulus worth 1.2 percent of GDP will not be enough to provide significant growth support?</p>",
        " (A) 2%",
        " (B) 5%",
        " (C) 4%",
        " (D) 3%",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. How many countries have been declared as COVID-19 free till 9 June?</p>",
        " (A) 4",
        " (B) 7",
        " (C) 9",
        " (D) 12",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.12. Scientist from which institute have discovered a new planet named KOI-456.04 &amp; its host star called Kepler-160 which are \"mirror image\" of our own planet and sun?</p>",
        " (A) American Schools of Oriental Research",
        " (B) Max Planck Institute for Solar System Research",
        " (C) German Institute of Science and Technology",
        " (D) Nordic Institute for Theoretical Physics",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.13. Who represent India in Lieutenant General-level talks held between India and China at the Border Personnel Meeting Point in Maldo, on the Chinese side of the Line of Actual Control in Eastern Ladakh?</p>",
        " (A) G. S. Rawat",
        " (B) Shushil Chandra",
        " (C) Harinder Singh",
        " (D) Devraj Anbu",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.14. Which company along with ICICI Lombard 'first of its kind' travel insurance, domestic multi-trip insurance to provide a stress-free travel experience to customers by covering risks associated with all modes of travel within the country?</p>",
        " (A) PhonePe",
        " (B) Google Pay",
        " (C) Amazon Pay",
        " (D) ICICI Pockets",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.15. Arjun Charan Sethi passed away at 79 due to his brief illness in a private hospital at Bhubaneswar. He was a famous?</p>",
        " (A) Cricketer",
        " (B) Singer",
        " (C) Politician",
        " (D) Actor",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.16. Athletics Integrity Unit banned which indian athlete from Tamil Nadu who won the gold medal for 800m in the 2019 Asian Championship for 4years after testing positive for banned substances?</p>",
        " (A) Dutee Chand",
        " (B) Hima Das",
        " (C) K. T. Irfan",
        " (D) Gomathi Marimuthu",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.17. The International Weightlifting Federation has recently cleared which Indian weightlifter from the doping charge due to the non-conformities in handling of samples?</p>",
        " (A) Ganaesh Mali",
        " (B) K Sanjita Chanu",
        " (C) Sukhen Dey",
        " (D) Mirabai Chanu",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.18. The Embassy of India and the Central Level Project Implementation Unit of the Ministry of Education, Nepal signed 7 MoUs for re-building how many higher secondary schools?</p>",
        " (A) 56",
        " (B) 46",
        " (C) 36",
        " (D) 26",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.19. Who has been honoured with NASA's highest form of recognition for a non-governmental individual \"NASA Distinguished Public Service Medal\" for his service to NASA?</p>",
        " (A) Dalip Singh Saund",
        " (B) Sanjay Gupta",
        " (C) Renjith Kumar",
        " (D) Gobind Behari",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.20. Fitch Ratings stated that India's economy is forecast to grow with a sharp growth rate of how much percent in 2021 if the country avoids further deterioration in financial sector health?</p>",
        " (A) 9.5%",
        " (B) 5.5%",
        " (C) 6.5%",
        " (D) 7.5%",
        "Correct Answer : A"
    ],
    [
        ""
    ]
]