[
    [
        "Q.1. The MeitY has launched how many services of India Meteorological Department on the UMANG App to further enhance the online delivery of Government services?</p>",
        " (A) 3",
        " (B) 4",
        " (C) 7",
        " (D) 9",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.2. The first phase of the Army Commanders conference will be organised on which date?</p>",
        " (A) 22 to 26 May",
        " (B) 25 to 30 May",
        " (C) 1 to 5 June",
        " (D) 27 to 29 May",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. International Missing Children's Day is observed every year on which date?</p>",
        " (A) May 24",
        " (B) May 27",
        " (C) May 25",
        " (D) May 23",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. The Pradhan Mantri Matsya Sampada Yojana has announced its plan to enhance fish production to 220 lakh metric tons by which year from 137.58 lakh MT in 2018-19?</p>",
        " (A) 2024-25",
        " (B) 2022-23",
        " (C) 2023-24",
        " (D) 2025-26",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. Who inaugurated the Chamba Tunnel in Uttarakhand under Chardham Pariyojana through video conference mode on 26 May 2020?</p>",
        " (A) Raj Nath Singh",
        " (B) Amit Shah",
        " (C) Nirmala Sitharaman",
        " (D) Nitin Gadkari",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.6. Which country successfully destroyed an unmanned aerial vehicle with a solid-state laser \"Laser Weapon System Demonstrator \" from Pacific?</p>",
        " (A) China",
        " (B) Russia",
        " (C) USA",
        " (D) France",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.7. The World Health Organization have teamed up with which organisation to fight the battle against Covid-19 and have signed an agreement to work together to promote health through sport and physical activity?</p>",
        " (A) International Olympic Committee",
        " (B) The Federation Internationale de Football Association",
        " (C) International Cricket Council",
        " (D) International Sports Federations",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. CSIR-IIIM, Jammu a constituent laboratory of CSIR signed MoU with which company to develop and scale-up a new Reverse Transcriptase-Loop Mediated Isothermal Amplification based COVID-19 diagnostic kit?</p>",
        " (A) Tech Mahindera",
        " (B) Reliance Industries Limited",
        " (C) Infosys",
        " (D) Tata Group",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. REC Foundation, has tied up with TajSATS, a joint venture of IHCL and SATS Ltd, to distribute specially-made nutritious meal packets for medical staff in which hospital?</p>",
        " (A) Apollo Hospital",
        " (B) Safdarjung Hospital",
        " (C) ESIC AYUSH HOSPITAL NARELA",
        " (D) BLK Super Speciality Hospital, Delhi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. Former World Top 25 tennis star Jamie Hampton announced her retirement from professional tennis at the age of 30 due to the injuries. She was from which country?</p>",
        " (A) Italy",
        " (B) Canada",
        " (C) France",
        " (D) USA",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.11. What is the name of PPE kit made with innovative breathable fabric material, to provide comfort to healthcare workers working against COVID-19 pandemic developed by Indian Navy?</p>",
        " (A) CovRakshak",
        " (B) NavCov",
        " (C) CovNav",
        " (D) NavRakshak",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. Which state becomes the 1st state to grant sports an industry status to boost the sports sector, generate employment, increase value of sports?</p>",
        " (A) Mizoram",
        " (B) Nagaland",
        " (C) Sikkim",
        " (D) Assam",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.13. Which startup has partnered with payments technology major Visa to launch innovative payment solutions for Small and Medium Enterprises and startups so as to enhance productivity, automate processes, focus on easy and fast credit?</p>",
        " (A) Dave",
        " (B) Credit Karma",
        " (C) Coinbase",
        " (D) Zaggle",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.14. According to World Steel Association monthly crude steel report for April 2020, India's crude steel output declined by how much percent during April, 2020 in comparison to the 9.021 MT of crude steel production in April 2019?</p>",
        " (A) 35.2%",
        " (B) 45.2%",
        " (C) 65.2%",
        " (D) 55.2%",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.15. Which state became the 1st state to release a report highlighting its conservation efforts to save over 1,100 rare plants from extinction?</p>",
        " (A) Uttar Pradesh",
        " (B) Madhya pradesh",
        " (C) Uttarakhand",
        " (D) Himachal Pradesh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.16. World Thyroid Day all is observed on which day all over the world?</p>",
        " (A) 22th May",
        " (B) 23th May",
        " (C) 25th May",
        " (D) 26th May",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.17. Who lead the team of scientists of Botanical Survey of India who discovered 3 new plant species namely- Eugenia sphaerocarpa, Goniothalamus sericeus and Memecylon nervosum at the Western Ghats in Kerala and Tamil Nadu?</p>",
        " (A) Manju Sharma",
        " (B) Samir K. Brahmachari",
        " (C) A. A. Mao",
        " (D) K.A. Sujana",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.18. Power Finance Corporation the central PSU and India's leading NBFC, signed an agreement with which company to fund hydro-electric projects worth Rs.22,000 on 26 May 2020?</p>",
        " (A) Power Grid Corporation of India Limited",
        " (B) NTPC Limited",
        " (C) Adani Power Limited",
        " (D) Narmada Basin Projects Company Ltd.",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. World Health Organization had selected how many people to participate in human challenge trials to develop new vaccines for COVID-19?</p>",
        " (A) 3 people",
        " (B) 7 people",
        " (C) 5 people",
        " (D) 8 people",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.20. What is the name of military war game centre at the Uganda Senior Command and Staff College of Uganda developed by the Indian Association Uganda and Indian Military Advisory and Training Team for Uganda Peoples Defence Forces?</p>",
        " (A) GameOn",
        " (B) INDUGA",
        " (C) INDIA",
        " (D) WarOn",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. Which institute developed an AI -based Attendance application which allows non-contact based personnel verification, using facial features of the person in the wake of COVID-19 pandemic?</p>",
        " (A) CSIR",
        " (B) DRDO",
        " (C) IIT",
        " (D) ICMR",
        "Correct Answer : B   "
    ]
]