[
    [
        "Q.1. What was the theme of 2020 International Day of UN Peacekeepers?</p>",
        " (A) Men in Peacekeeping - A key to Peace",
        " (B) Women in Peacekeeping - A Path to Peace",
        " (C) Women in Peacekeeping - A key to Peace",
        " (D) Men in Peacekeeping - A Path to Peace",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.2. Centre has approved which State's Jal Jeevan Mission Annual Action Plan which provided 100% coverage of all households with functional tap water connections by 2020-21?</p>",
        " (A) Uttarakhand",
        " (B) Uttar Pradesh",
        " (C) Rajasthan",
        " (D) Bihar",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. Who was the first CM of Chhattisgarh who passed away at the age of 74 in Raipur, Chhattisgarh?</p>",
        " (A) Hemant Soren",
        " (B) Bhupesh Baghel",
        " (C) Ajit Jogi",
        " (D) Raman Singh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. What is the name of a multi-purpose decontamination device developed by Devaditek that can sanitize items ranging from N95 masks to vegetables by using ultraviolet germicidal irradiation technology?</p>",
        " (A) Sumos",
        " (B) Kumos",
        " (C) Lumos",
        " (D) Cumos",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.5. What is name of the Director-General of Sports Authority of India who has been given an extension for a period of 2 years?</p>",
        " (A) Vishal Sikka",
        " (B) Anshu Jain",
        " (C) C. P. Gurnani",
        " (D) Sandip Mukund Pradhan",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.6. Which state launch a project that aims to provide free internet access to the poor in the State?</p>",
        " (A) Sikkim",
        " (B) Kerala",
        " (C) Karnataka",
        " (D) Assam",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.7. Which company launched an experimental app named 'Collab' that lets users make short music videos?</p>",
        " (A) Microsoft",
        " (B) Facebook",
        " (C) Amazon",
        " (D) Google",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.8. The National Aeronautics and Space Administration renamed its Wide Field Infrared Survey Telescope as?</p>",
        " (A) Hubble 2 Space Telescope",
        " (B) Nancy Grace Roman Space Telescope",
        " (C) Hubble legacy Space Telescope",
        " (D) Legend Grace Space Telescope",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. Infosys Limited has entered into the partnership with which company that develops and provides software for core banking, to offer end-to-end products and services as Software-as-a-Service across the world?</p>",
        " (A) Edgeverge",
        " (B) Avaloq",
        " (C) Oracle",
        " (D) Temenos",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.10. Who has launched the e-booklet on Department of Administrative Reforms and Public Grievances achievements for the period 30 May 2019 to 30 May 2020?</p><br/></p>",
        " (A) Harsh Vardhan",
        " (B) Ram Vilas Paswan",
        " (C) Nitin Gadkari",
        " (D) Jitendra Singh",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.11. Who has been appointed as one of the co-founder of Zomato by Deepinder Goyal, Founder and Chief Executive Officer?</p>",
        " (A) Tapan Singhel",
        " (B) Dipankar Datta",
        " (C) Mohit Gupta",
        " (D) Leo Puri",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. Finance Minister Nirmala Sitharaman chaired which Meeting of the Financial Stability and Development Council via video conferencing, which was the first meet since the coronavirus outbreak?</p>",
        " (A) 20th",
        " (B) 21st",
        " (C) 22nd",
        " (D) 23rd",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.13. Who has detected a new species of silver colored small freshwater fish \"Puntius sanctus\" of the Cyprinidae family in Velankanni ,Tamil Nadu?</p>",
        " (A) Mathews Plamoottil",
        " (B) Biswa Vairamuthu",
        " (C) Trisha Krishnan",
        " (D) Jagdish Mukhi",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.14. Who has been appointed as the new Chief Executive Officer and Managing Director of Wipro effective from 6th July 2020?</p>",
        " (A) Thierry Delaporte",
        " (B) Adidali Neemuchwala",
        " (C) Sanjay Jha",
        " (D) Nikesh Arora",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.15. BSE and National Stock Exchange announced that they will reduce the annual listing fee by how much percent for MSMEs, as a part of their attempts to lower the compliance costs for companies during the ongoing COVID-19 pandemic?</p>",
        " (A) 15%",
        " (B) 35%",
        " (C) 20%",
        " (D) 20%",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.16. Which state launched the scheme named \"Mukhyamantri Swarozgar Yojana\" to retain the migrants who have returned to the state during the lockdown?</p>",
        " (A) Uttarakhand",
        " (B) Uttar Pradesh",
        " (C) Rajasthan",
        " (D) Haryana",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.17. According to Fitch's Global Economic Outlook for May, India's Gross Domestic Product is anticipated to how much decline in the current financial year due to the pandemic?</p>",
        " (A) 5%",
        " (B) 4%",
        " (C) 4.8%",
        " (D) 3%",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.18. What is the name of artificial intelligence based chatbot, launched by National Payment Corporation of India to create awareness around its products like FASTag, RuPay, Unified Payments Interface, Aadhaar Enabled Payment System?</p>",
        " (A) KAi",
        " (B) SAi",
        " (C) AAi",
        " (D) PAi",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.19. M.P. Veerendra Kumar passed away at the age of 83 due to cardiac arrest in Kozhikode, Kerala. He was a famous?</p>",
        " (A) Singer",
        " (B) Politician",
        " (C) Actor",
        " (D) Cricketer",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.20. Which state announced the development of 800 km herbal roads along the state and national highways through the state?</p>",
        " (A) Uttarakhand",
        " (B) Uttar Pradesh",
        " (C) Rajasthan",
        " (D) Haryana",
        "Correct Answer : B   "
    ],
    [
        ""
    ]
]