[
    [
        "Q.1. Government to set up how much fund to repay outstanding payments to MSMEs owed by govt. and private industries?</p>",
        " (A) Rs 1 trillion",
        " (B) Rs 2 trillion",
        " (C) Rs 4 trillion",
        " (D) Rs 5 trillion",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.2. which yojna will use drones in mapping of properties in villages and will make it easier for villagers to avail loans from banks?</p>",
        " (A) Swabhiman Yojana",
        " (B) Swami Yojana",
        " (C) Sarvjan Yojana",
        " (D) Swamitva Yojana",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.3. Which institutes along with a few other institutions is currently developing digital and molecular surveillance of the spread of novel coronavirus to understand the biology, epidemiology and disease impact?</p>",
        " (A) CCMB and IGIB",
        " (B) CCMB and IIT",
        " (C) THSTI and IGIB",
        " (D) CCMB and INST",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.4. Iran launched its first military satellite into orbit. What is the name of the satellite?</p>",
        " (A) Haniya",
        " (B) Noor",
        " (C) Heer",
        " (D) Aaira",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.5. The Fifteenth Finance Commission (XVFC) had online meetings with its Advisory Council on 23-24 April 2020. Who is Deputy Minister responsible for finance ministry?</p>",
        " (A) Mahendra Nath Pandey",
        " (B) Giriraj Singh",
        " (C) Anurag Thakur",
        " (D) Harsh Vardhan",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.6. Union Human Resource Development (HRD) Minister Ramesh Pokhriyal 'Nishank' felicitated the team of scientists from which of the following institute who are involved in the development of COVID-19 probe free Real-time Polymerase Chain Reaction (RT-PCR) Diagnostic Kit?</p>",
        " (A) IIT-Patna",
        " (B) THSTI-Faridabad",
        " (C) INST-Mohali",
        " (D) IIT-Delhi",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.7. The United Nations Conference on Trade and Development (UNCTAD) has cancelled how much debt owed by developing countries amid the COVID-19 pandemic?</p>",
        " (A) $1 trillion",
        " (B) $4 trillion",
        " (C) $3 trillion",
        " (D) $2 trillion",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. Which country President dominates the rankings for world leaders with most interactions on Facebook in the past 12 months?</p>",
        " (A) India",
        " (B) France",
        " (C) USA",
        " (D) UK",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.9. Who took oath as Chief Vigilance Commissioner (CVC) on 25 April 2020?</p>",
        " (A) Pramod Kumar Mishra",
        " (B) Santosh Kumar",
        " (C) Sanjay Kothari",
        " (D) Rajiv Gauba",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.10. Which institute has developed Chitra Magna, an innovative RNA extraction kit, innovative technology for isolating RNA from swabs for COVID-19 tests?</p>",
        " (A) Sree Chitra Tirunal Institute for Medical Sciences and Technology",
        " (B) Jawaharlal Nehru Centre for Advanced Scientific Research",
        " (C) Translational Health Science and Technology Institute (THSTI),Faridabad",
        " (D) Institute of Nano Science and Technology (INST), Mohali",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.11. Prime Minister Narendra Modi launched which of the following portal on 24 April 2020 at the occasion of National Panchayati Raj Day?</p>",
        " (A) E-Village Swadesh portal",
        " (B) E-Gram Swadesh portal",
        " (C) E-Village Swaraj portal",
        " (D) E-Gram Swaraj portal",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.12. Under the Smart Cities Mission PCMC has set up a COVID-19 War Room at Pimpri-Chinchwad Municipal Corporation (PCMC) to track and monitor the COVID-19 situation in the city.In which of the folowing state Pimpri-Chinchwad located?</p>",
        " (A) Punjab",
        " (B) Gujarat",
        " (C) Maharashtra",
        " (D) Madhya Pradesh",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.13. World Malaria Day is an international event observed on which date every year?</p>",
        " (A) 21 April",
        " (B) 25 April",
        " (C) 22 April",
        " (D) 24 April",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.14. What is the name of application launched in CISF to enable movement of files and documents without physical touch?</p>",
        " (A) E-Office",
        " (B) E-Files",
        " (C) E-CISF",
        " (D) E-karyalay",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.15. How many farmers and traders registered on 'Kisan Rath' mobile app, just within one week of its launch?</p>",
        " (A) 2.5 lakh",
        " (B) 1.5 lakh",
        " (C) 3.5 lakh",
        " (D) 2.0 lakh",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.16. China announced how much additional grant for WHO to fight against COVID-19?</p>",
        " (A) USD 10 million",
        " (B) USD 20 million",
        " (C) USD 40 million",
        " (D) USD 30 million",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.17. The home ministry has set up how many more inter-ministerial central teams (IMCTs) for making an on-spot assessment of Covid-19?</p>",
        " (A) 2",
        " (B) 3",
        " (C) 4",
        " (D) 5",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.18. International Delegate's Day is observed on which date?</p>",
        " (A) 22 April",
        " (B) 25 April",
        " (C) 23 April",
        " (D) 21 April",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.19. The US space agency NASA engineers have developed a new high-pressure ventilator tailored specifically to treat COVID-19 patients. What is the name of this ventilator?</p>",
        " (A) VITAL",
        " (B) CARE",
        " (C) VENTI",
        " (D) COVEN",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.20. Astronomers found how many asteroids that once belonged to a distant star system have been found orbiting the Sun between Jupiter and Neptune?</p>",
        " (A) 12",
        " (B) 18",
        " (C) 19",
        " (D) 11",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. What is the name of China's first Mars exploration mission?</p>",
        " (A) Cianwen-1",
        " (B) Mianwen-1",
        " (C) Nianwen-1",
        " (D) Tianwen-1",
        "Correct Answer : D"
    ]
]