[
    [
        "Q.1. Recently which player has been chosen as the ambassador for 'Badminton' awareness campaign of World Badminton Federation (BWF)?</p>",
        " (A) Chetan Anand",
        " (B) PV Indus",
        " (C) Saina Nehwal",
        " (D) Srikanth Kidambi",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.2. In view of the status of COVID-19, the Union Minister of Health and Family Welfare recently stated that which online portal is being used to monitor the real-time status of the current reserves of each blood group?</p>",
        " (A) E-blood cell",
        " (B) even",
        " (C) E-wind",
        " (D) E-blood pressure",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.3.  India's largest IT company TCS will launch the first fully digital bank in which country?</p>",
        " (A) Pakistan",
        " (B) Iraq",
        " (C) Israel",
        " (D) Russia",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.4. According to which organization, the decline in the economic sector due to Kovid-19 could almost double the number of people facing acute food insecurity in the world this year?</p>",
        " (A) United Nations",
        " (B) world Bank",
        " (C) World Trade Organization",
        " (D) World Health Organization",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.5. Which state government has banned the use and sale of all tobacco products including cigarettes, bidis, gutkha, zarda, betel nut, hookah, e-hookah, e-cigarettes in the wake of corona virus?</p>",
        " (A) Bihar",
        " (B) Punjab",
        " (C) Jharkhand",
        " (D) Gujarat",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.6. The union government of India made Central Nodal Agencies like NAFED and FCI striving to assure better returns for the farmers. When was NAFED founded?</p>",
        " (A) 2 October 1962",
        " (B) 2 October 1956",
        " (C) 2 October 1968",
        " (D) 2 October 1958",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.7. Department of Posts planned to extend the payment of compensation of how much rupees to all postal employees including Gramin Dak Sevaks employees to the corona disease?</p>",
        " (A) 10 lakh rupees",
        " (B) 20 lakh rupees",
        " (C) 30 lakh rupees",
        " (D) 40 lakh rupees",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.8. Ministry of Power issued a draft proposal for amendment of Electricity Act, 2003 in the form of the draft Electricity Act (Amendment) Bill, 2020 for comments/suggestions from Stakeholders on 17th April 2020. Who is current Minister of Power?</p>",
        " (A) Dr. Jitendra Singh",
        " (B) Santosh Kumar Gangwar",
        " (C) Shri Raj Kumar Singh",
        " (D) Shri Hardeep Singh Puri",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.9. 4478 m high Matterhorn mountain in which of the following country lights up with Indian flag in show of solidarity?</p>",
        " (A) Sweden",
        " (B) Germany",
        " (C) Switzerland",
        " (D) Finland",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.10. Union Minister of State (I/C) for Labour and Employment requested various State/UT Governments to designate a nodal officer to coordinate with Control Rooms set up by the Union Government. Who is Union Minister of State for Labour and Employment?</p>",
        " (A) Dr. Jitendra Singh",
        " (B) Santosh Kumar Gangwar",
        " (C) Shri Raj Kumar Singh",
        " (D) Shri Hardeep Singh Puri",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.11. The Supreme Court quashed the order to provide 100 percent reservation for ST candidates in scheduled tribe areas of which state?</p>",
        " (A) Bihar",
        " (B) Punjab",
        " (C) Andra Pradesh",
        " (D) Uttar Pradesh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.12. English Language Day is celebrated on which of the following days?</p>",
        " (A) 23 April",
        " (B) 30 April",
        " (C) 10 January",
        " (D) 15 March",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.13. How many days has the United States most affected by the Coronavirus epidemic decided to stop immigration?</p>",
        " (A) 50 days",
        " (B) 40 days",
        " (C) 60 days",
        " (D) 30 days",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.14. The Central Government recently issued an ordinance in view of the attacks on health workers across the country, under which the culprits can now be punished for up to how many years?</p>",
        " (A) Ten years",
        " (B) Ten years",
        " (C) twenty years",
        " (D) Seven Years",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.15. The Union Health and Family Welfare Minister launched which interactive platform to establish a direct channel of communication during the COVID-19 epidemic?</p>",
        " (A) COVID India Services",
        " (B) COVID Family Welfare",
        " (C) COVID mind talk",
        " (D) COVID Communications",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q.16. Which institute made available high-protein biscuits to the corona affected patients in the All India Institute of Medical Science (AIIMS), New Delhi?</p>",
        " (A) CSIR-CCMB",
        " (B) CSIR-CMERI",
        " (C) CSIR-CFTRI",
        " (D) CSIR-AMPRI",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.17. Door-to-door delivery of newspapers and magazines prohibited in which of the following states?</p>",
        " (A) Punjab",
        " (B) Haryana",
        " (C) Maharashtra",
        " (D) Uttar Pradesh",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.18. International Day for Monuments and Sites (World Heritage Day) celebrated on which date?</p>",
        " (A) April 15",
        " (B) April 18",
        " (C) April 17",
        " (D) April 13",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q.19. Currently, government permission is mandatory only for investments coming from which of the following two countries?</p>",
        " (A) Afganistan and Pakistan",
        " (B) Nepal and Pakistan",
        " (C) Bangladesh and Afganistan",
        " (D) Bangladesh and Pakistan",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q.20. RBI lowers liquidity coverage ratio (LCR) for banks to how much percent from 100%?</p>",
        " (A) 70%",
        " (B) 60%",
        " (C) 80%",
        " (D) 90%",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q.21. Recently which leading two-wheeler company of India has acquired 122 year old motorcycle company 'Norton' in United Kingdom?</p>",
        " (A) Tvs",
        " (B) Yamaha",
        " (C) Bajaj",
        " (D) Honda",
        "Correct Answer : A   "
    ]
]