[
    [
        "Q 1 : Length of a rectangle is 53 metre, while its breath is 28 metre. Cost of covering it with grass bed is Rs.27 sq meter. Find total expenditure?",
        " (A) Rs. 40,098",
        " (B) Rs. 40,048",
        " (C) Rs. 40,058",
        " (D) Rs. 40,088",
        " (E) None of these",
        "Correct Answer : E",
        ""
    ],
    [
        "Q 2 : Base of a right-angle triangle is 9 cm and its area is 81 sq cm. Find its height.",
        " (A) 36 cm",
        " (B) 9 cm",
        " (C) 27 cm",
        " (D) None of these",
        "Correct Answer : D",
        ""
    ],
    [
        "Q 3 : Difference between the circumferences of two circles is 132 cm and radius of the smaller circle is 14 cm. Find the radius of the larger circle?",
        " (A) 14 cm",
        " (B) 21 cm",
        " (C) 30 cm",
        " (D) None of these",
        "Correct Answer : D",
        ""
    ],
    [
        "Q 4 : Poles are to be created along the boundary of a rectangular field in such a way that distance between any two adjacent poles is 1.5 metres. The perimeter of the field is 21 metres and length and the breadth are in the ratio of 4:3 respectively. How many poles will be required?",
        " (A) 14",
        " (B) 16",
        " (C) 15",
        " (D) 20",
        "Correct Answer : A",
        ""
    ],
    [
        "Q 5 : The ratio of length and breadth of rectangle is 5:2 respectively. The respective ratio of its perimeter and area is 1:3 (irrespective of the unit). What is the length of the rectangle?",
        " (A) 27 units",
        " (B) 32 units",
        " (C) 21 units",
        " (D) None of these",
        "Correct Answer : C",
        ""
    ],
    [
        "Q 6 : The length of a rectangle, which is 25 cm is equal to the length of a square and the area of the rectangle is 125 square cm less than the area of the square. What is the breadth of the rectangle?",
        " (A) 15 cm",
        " (B) 20 cm",
        " (C) 12 cm",
        " (D) 14 cm",
        "Correct Answer : B",
        ""
    ],
    [
        "Q 7 : The area of a rectangle with 10 cm length is equal to the area of a circle. Find the circumference of the circle.",
        " (A) 36 cm",
        " (B) 34 cm",
        " (C) 26 cm",
        " (D) cannot be determined",
        "Correct Answer : D",
        ""
    ],
    [
        "Q 8 : If the length of a rectangle is increased by 20% and the breadth is decreased by 10%. What will be the effect on its area?",
        " (A) 8% increase",
        " (B) 8% decrease",
        " (C) 2% increase",
        " (D) 2% decrease",
        "Correct Answer : A",
        ""
    ],
    [
        "Q 9 : The ratio of length and breadth of a rectangular plot is 71:16 respectively. The area of the plot is 17324 sq.metres. What is the perimeter of the plot?",
        " (A) 284 metres",
        " (B) 528 metres",
        " (C) 264 metres",
        " (D) 614 metres",
        "Correct Answer : B",
        ""
    ],
    [
        "Q 10 : If area of a circular jogging track is 3850 sq.metres. What is the circumference of the jogging track?",
        " (A) 225 metres",
        " (B) 214 metres",
        " (C) 220 metres",
        " (D) 235 metres",
        "Correct Answer : C",
        ""
    ],
    [
        "Q 11 : Ratio between areas of two squares is 36:25. What would be the ratio between their perimeter.",
        " (A) 5:4",
        " (B) 6:5",
        " (C) 4:6",
        " (D) 8:7",
        "Correct Answer : B",
        ""
    ],
    [
        "Q 12 : A wheel can travel 22 km. in 100 rounds. Find the radius of that wheel.",
        " (A) 42 mtr",
        " (B) 28 mtr.",
        " (C) 35 mtr",
        " (D) 49 mtr",
        "Correct Answer : C",
        ""
    ],
    [
        "Q 13 : A cow is tied with a 14 ft. long rope in the centre of a field. If the cow can graze the grass of 100 ft2 area per day. What will be the time taken by the cow in grazing the grass of whole field?",
        " (A) 2 Days",
        " (B)  18 Days",
        " (C) 24 Days\t",
        " (D) 6 Days",
        "Correct Answer : D",
        ""
    ],
    [
        "Q 14 : A rectangular plot has the ratio of 5:3 between length and breath. If the perimeter of the plot is 320 mtr. Whats the area of the plot?",
        " (A) 6000 sq.mtr.",
        " (B) 12000 sq.mtr.",
        " (C) 4500 sq.mtr.",
        " (D) 18000 sq.mtr.",
        "Correct Answer : A",
        ""
    ],
    [
        "Q 15 : Ratio of length, breath and height of a room is 5:4:2. Area of four wall is 144 square meter. Find diagonal of the floor.",
        " (A) 241 mtr ",
        " (B) 341 mtr",
        " (C) 242 mtr",
        " (D) 241 mtr",
        "Correct Answer : A",
        ""
    ],
    [
        "Q 16 : Area of a rectangle is 4 times than that of a square. Breath of rectangle is 12cm. and length of side of square. What is the length of the side of square?",
        " (A) 10 cm",
        " (B) 12 cm",
        " (C) 14 cm",
        " (D) 16 cm",
        "Correct Answer : B",
        ""
    ],
    [
        "Q 17 : Diagonal of a square is 122. Find the ratio between the area of this square and that of square drawn on diagonal.",
        " (A) 2:1",
        " (B) 1:1",
        " (C) 1:2",
        " (D) 1:3",
        "Correct Answer : C",
        ""
    ],
    [
        "Q 18 : Ratio between the length and breadth of a rectangular field is 9:4. Rs.14400 are spent on the implantation of grass on this field. If the rate of implantation is Rs. 4 per meter square. What is the breath of the field?",
        " (A) 38 mtr ",
        " (B) 48 mtr ",
        " (C) 42 mtr ",
        " (D) 40 mtr",
        "Correct Answer : D",
        ""
    ],
    [
        "Q 19 : Length and breadth of a rectangular field is 140 m. and respectively. Poles have to be fixed around this field at the distance of 5 m. How many such poles are required?",
        " (A) 88",
        " (B) 40",
        " (C) 92",
        " (D) 41",
        "Correct Answer : C",
        ""
    ],
    [
        "Q 20 : A carpet is to be laid in a room of 12m 8m. measurement. Breath of the carpet is 3m. What should be the length of this carpet?",
        " (A) 34 mtr",
        " (B) 32 mtr",
        " (C) 36 mtr",
        " (D) 40 mtr",
        "Correct Answer : "
    ]
]