[
    [
        "Q.1. The hottest planet in the solar system",
        "A. Earth B. Venus C. Mars D. Jupiter",
        " Ans .B",
        ""
    ],
    [
        "Q.2. The first Muslim President of the Indian National Congress",
        "A. Azad B. M.A.Jinnah C. Badruddin TaiyabjiD. A.P.J.Abdul Kalam",
        " Ans .C",
        ""
    ],
    [
        "Q.3. One People, One State, One leader was the policy of",
        "A. Stalin B. Hitler C. Lenin D. Mussolin",
        " Ans .B",
        ""
    ],
    [
        "Q.4. The river that flows through Delhi is",
        "A. Ganges B. Indus C. Yamuna D. Narmada",
        " Ans .C",
        ""
    ],
    [
        "Q.5. Name the plant important in sericulture",
        "A. Pea B. Legumes C. Mulberry D. Cassia",
        " Ans .C",
        ""
    ],
    [
        "Q.6. The Hindustan Shipyard is located at",
        "A. Chennai B. Mumbai C. Vishakapatnam D. Mangalore",
        " Ans .C",
        ""
    ],
    [
        "Q.7. Punjab is famous for",
        "A. Nylon textile B. Silk textile C. Woolen textile D. Cotton textile",
        " Ans .C",
        ""
    ],
    [
        "Q.8. The oldest literary work available in Tamil was",
        "A. Silappadikaram B. Tholkappiyam C. Thirukkural D. Manimegalai",
        " Ans .B",
        ""
    ],
    [
        "Q.9. Which city is famous for Cotton Industry in TamilNadu",
        "A. Coimbatore B. Trichy C. Madurai D. Chennai",
        " Ans .A",
        ""
    ],
    [
        "Q.10. The state that has the largest number of Cotton textile mills",
        "A. Maharashtra B. Andhra Pradesh C. Madhya Pradesh D. Gujarat",
        " Ans .A",
        ""
    ],
    [
        "Q.11. The largest fresh water lake in India is",
        "A. Pulicat Lake B. Veeranam Lake C. Chilka Lake D. Wular Lake",
        " Ans .D",
        ""
    ],
    [
        "Q.12. Name the Governor General who abolished sati in 1829",
        "A. Lord Clive B. Lord Curzon C. Lord William Bentinck D. Lord Dalhousie",
        " Ans .C",
        ""
    ],
    [
        "Q.13. The chemical name of Chloroform is",
        "A. Sulphuric acid B. Sodium Chloride C. Sodium Carbonate D. Trichloromethane",
        " Ans .D",
        ""
    ],
    [
        "Q.14. The largest river in India is",
        "A. Yamuna B. Kaveri C. Ganga D. Bramaputra",
        " Ans .C",
        ""
    ],
    [
        "Q.15. Country that was called as Land of Rising Sun",
        "A. Russia B. Japan C. Korea D. Holland",
        " Ans .B",
        ""
    ],
    [
        "Q.16. The world smallest country is",
        "A. Canada B. Russia C. Maldives D. Vatican City",
        " Ans .D",
        ""
    ],
    [
        "Q.17. The first Indian Satellite was",
        "A. Columbia B. Bhaskara C. Aryabhatta D. Rohinh",
        " Ans .C",
        ""
    ],
    [
        "Q.18. The brighest planet is",
        "A. Mars B. Mercury C. Neptune D. Venus",
        " Ans .D",
        ""
    ],
    [
        "Q.19. Satellite launching station is",
        "A. Pune B. Trombay C. Sriharikota D. Thumba",
        " Ans .C",
        ""
    ],
    [
        "Q.20. The planet nearest to the Sun is",
        "A. Venus B. Mercury C. Jupiter D. Saturn",
        " Ans .B",
        ""
    ],
    [
        "Q.21. The World Largest desert is",
        "A. Thar B. Kalahari C. Sahara D. Sonoran",
        " Ans .C",
        ""
    ],
    [
        "Q.22. Country that has the highest in Barley Production",
        "A. China B. India C. Russia D. France",
        " Ans .C",
        ""
    ],
    [
        "Q.23. The metal whose salts are sensitive to light is",
        "A. Zinc B. Silver C. Copper D. Aluminium",
        " Ans .B",
        ""
    ],
    [
        "Q.24. The Central Rice Research Station is situated in",
        "A. Chennai B. Cuttack C. Bangalore D. Quilon",
        " Ans .B",
        ""
    ],
    [
        "Q.25. The first chairman of the Atomic Energy Commission was",
        "A. Dr.C.V.Raman B. Dr.H.J.Bhabha C. Dr.A.P.J.Abdul Kalam D. Dr.Vickram Sarabhai",
        " Ans .B",
        ""
    ],
    [
        "Q.26. Pink city in India is",
        "A. Mysore B. Karnataka C. Hyderabad D. Jaipur",
        " Ans .D",
        ""
    ],
    [
        "Q.27. The famous Integral Coach Factory(ICF) for the manufacture of railway coaches are situated at",
        "A. Kolkata B. Borivilli C. Perambur D. Chittaranjan",
        " Ans .C",
        ""
    ],
    [
        "Q.28. Deficiency of Iron leads to",
        "A. Rickets B. Malaria C. Dental Cavity D. Anaemia",
        " Ans .D",
        ""
    ],
    [
        "Q.29. The state which has desert in India is",
        "A. Rajasthan B. Punjab C. Uttar Pradesh D. Madhya Pradesh",
        " Ans .A",
        ""
    ],
    [
        "Q.30. The headquarters of the coffee board of India is",
        "A. Mysore B. Kolkata C. Bangalore D. Cochin",
        " Ans .C",
        ""
    ],
    [
        "Q.31. D.D.T. was invented by",
        "A. Mosley B. Rudeolf C. Karl Benz D. Dalton",
        " Ans .A",
        ""
    ],
    [
        "Q.32. Which is considered as the biggest port of India?",
        "A. Kolkata B. Cochin C. Chennai D. Mumbai",
        " Ans .D",
        ""
    ],
    [
        "Q.33. The gas used for making vegetables is",
        "A. Oxygen B. Carbon dioxide C. Hydrogen D. Nitrogen",
        " Ans .C",
        ""
    ],
    [
        "Q.34. The chief ore of Aluminium is",
        "A. Iron B. Cryolite C. Bauxite D. Haematite",
        " Ans .C",
        ""
    ],
    [
        "Q.35. Sharavati projects is in",
        "A. Orissa B. Kerala C. Andhra Pradesh D. Karnataka",
        " Ans .D",
        ""
    ],
    [
        "Q.36. In which of the following states in English the Official Language?",
        "A. Orissa B. Nagaland C. Kerala D. Tripura",
        " Ans .B",
        ""
    ],
    [
        "Q.37. Which gas is used for the preparation of Soda water",
        "A. Oxygen B. Ammonia C. Hydrogen D. Carbon Dioxide",
        " Ans .D",
        ""
    ],
    [
        "Q.38. Who among the following appoints the Prime Minister of India?",
        "A. Lok Sabha B. Rajya Sabha C. President of India D. Chief Justice of Supreme Court",
        " Ans .C",
        ""
    ],
    [
        "Q.39. The most important river of Orissa is",
        "A. Bramaputra B. Godaveri C. Mahanadi D. Sharavathi",
        " Ans .C",
        ""
    ],
    [
        "Q.40. The language spoken by the people by Pakistan is",
        "A. Hindi B. Palauan C. Sindhi D. Nauruan",
        " Ans .C",
        ""
    ],
    [
        "Q.41. Gir National Park is situated in",
        "A. Bihar B. Allahabad C. West Bengal D. Gujarat",
        " Ans .D",
        ""
    ],
    [
        "Q.42. Madharasas are the schools of",
        "A. Jain B. Hindus C. Muslims D. Christians",
        " Ans .C",
        ""
    ],
    [
        "Q.43. Shore temple is located at",
        "A. Calicut B. Sanapur C. Patna D. Mahabalipuram",
        " Ans .D",
        ""
    ],
    [
        "Q.44. The highest peak in South India is",
        "A. Everest B. Doddabetta C. Nilgiri hills D. Anaimudi",
        " Ans .D",
        ""
    ],
    [
        "Q.45. Red Cross was founded by",
        "A. A.Cursetji B. Badel Powell C. J.H.Durant D. Trygve Lie",
        " Ans .C",
        ""
    ],
    [
        "Q.46. The gas used to extinguish fire, is ",
        "A. Carbon Monoxide B. Neon C. Nitrogen D. Carbon Dioxide",
        " Ans .D",
        ""
    ],
    [
        "Q.47. The largest part of the human brain is ",
        "A. Cerebellum B. Midbrain C. Cerebrum D. Medulla Oblongata",
        " Ans .C",
        ""
    ],
    [
        "Q.48. The amount of light entering the eye is regulated by ",
        "A. Schlera B. Iris C. Pupil D. Ciliary Body",
        " Ans .B",
        ""
    ],
    [
        "Q.49. The smallest cells in the human body are ",
        "A. Muscle cells B. Nerve cells C. Blood cells D. Brain Stem cells",
        " Ans .C",
        ""
    ],
    [
        "Q.50. The number of ribs in Human Body is ",
        "A. 12 B. 18 C. 20 D. 24",
        "Ans. B "
    ]
]