[
    [
        "Q.1 Which of the following measurements is not a unit of distance? ",
        "(A) Ammeter (B) Cubit (C) Parsec (D) angstrom",
        " Ans .A",
        ""
    ],
    [
        "Q.2 Which one of the following remains constant while throwing a ball upward? ",
        "(A) Displacement (B) Kinetic energy (C) Acceleration (D)  Velocity",
        " Ans .C",
        ""
    ],
    [
        "Q.3 Pure water freezes at what temperature? ",
        "(A) 47 F (B) 32 F (C) 0 F (D)  19 F",
        " Ans .B",
        ""
    ],
    [
        "Q.4 Which vitamin is abundant in citrus fruits? ",
        "(A) Vitamin A (B) Vitamin B (C) Vitamin C (D)  Vitamin D",
        " Ans .C",
        ""
    ],
    [
        "Q.5 Zinc Oxide is ",
        "(A) Acidic (B) Basic (C) Neutral (D)  Amphoteric",
        " Ans .D",
        ""
    ],
    [
        "Q.6 Pure water is a _____________ Conductor of electricity. ",
        "(A) super conductor (B) bad conductor (C) speed conductor (D)  None of these",
        " Ans .B",
        ""
    ],
    [
        "Q.7 What elements three isotopes have different names? ",
        "A. Helium B. Oxygen C. Carbon D. Hydrogen",
        " Ans .D",
        ""
    ],
    [
        "Q.8 On which one of the following conservation laws, does a rocket work? ",
        "(A) Mass (B) Energy (C) Linear momentum (D)  Angular momentum",
        " Ans .C",
        ""
    ],
    [
        "Q.9 Which one among the following radiations carries maximum energy? ",
        "(A) Ultraviolet rays (B) Gamma rays (C) X- rays (D)  Infra red rays",
        " Ans .B",
        ""
    ],
    [
        "Q.10 The Central Arid Zone Research Institute (CAZRI) is located at ",
        "(A) Jaipur (B) Jodhpur (C) Jaisalmer (D)  Jallandhar",
        " Ans .B",
        ""
    ],
    [
        "Q.11 What is the main constituent of coal gas? ",
        "(A) Oxygen (B) Water (C) Nitrogen (D)  Methane",
        " Ans .C",
        ""
    ],
    [
        "Q.12 Recoil of a gun is an example of ",
        "(A) Conservation of mass (B) conservation of energy (C) conservation into KE (D)  conservation of linear momentum",
        " Ans .D",
        ""
    ],
    [
        "Q.13 What is the heaviest of the naturally occurring Noble gases? ",
        "(A) Radon (B) Xenon (C) Helium (D) Argon",
        " Ans .A",
        ""
    ],
    [
        "Q.14 Aviation fuel for Jet aero planes consists of purified ",
        "(A) Petrol (B) Kerosene (C) Gasoline (D) Diesel",
        " Ans .B",
        ""
    ],
    [
        "Q.15 A piece of stone and or iron traveling through space that moves through the earths atmosphere is ",
        "(A) Planet (B) Sun (C) Moon (D) Meteor",
        " Ans .D",
        ""
    ],
    [
        "Q.16 Which one of the following common devices works on the basis of the principle of mutual induction? ",
        "(A) Tube light (B) Transformer (C) Photodiode (D) Led",
        " Ans .B",
        ""
    ],
    [
        "Q.17 Dc current can be controlled by which one of the following components? ",
        "(A) Impedance (B) Resistance (C) Capacitance (D) Inductance",
        " Ans .B",
        ""
    ],
    [
        "Q.18 Mesons are found in ",
        "(A) Alpha -rays (B) Laser beam (C) X  rays (D) Cosmic rays",
        " Ans .D",
        ""
    ],
    [
        "Q.19 A moderator is used in nuclear reactors in order to ",
        "(A) increase the motoneurons (B) decrease the motoneurons (C) slow down the speed of neutrons (D) Anthony S. DMello",
        " Ans .C",
        ""
    ],
    [
        "Q.20 The wavelength of X-rays is of the order of ",
        "(A) 1 cm (B) 1 m (C) 10 micron (D) 1 Angstrom",
        " Ans .D",
        ""
    ],
    [
        "Q.21 In a sitar wire which one of the following types of vibration is produced? ",
        "(A) Progressive longitudinal (B) Stationary longitudinal (C) Progressive transverse (D) Stationary transverse",
        " Ans .A",
        ""
    ],
    [
        "Q.22 Which gas in the atmosphere saves us from the ultra violet rays of the sun? ",
        "(A) Nitrogen (B) Oxygen (C) Ozone (D) Carbon Monoxide",
        " Ans .C",
        ""
    ],
    [
        "Q.23 What is the study of plants called? ",
        "(A) Physics (B) Chemistry (C) Zoology (D) Biology",
        " Ans .D",
        ""
    ],
    [
        "Q.24 The three methods of science are observation, experimentation and ",
        "(A) Hypothesis (B) Measurement (C) Deduction (D) inference",
        " Ans .B",
        ""
    ],
    [
        "Q.25 If two bodies of different masses, initially at rest, are acted upon by the same force for the same time, then both bodies acquire the same.",
        "(A) velocity",
        "(B) kinetic energy",
        "(C) acceleration",
        "(D) momentum",
        " Ans . D",
        ""
    ],
    [
        "Q.26Pick out the scalar quantity",
        "(A) force",
        "(B) pressure",
        "(C) velocity",
        "(D) acceleration",
        " Ans . B",
        ""
    ],
    [
        "Q.27Rectifiers are used to convert",
        "(A) Direct current to alternating current",
        "(B) alternating current to direct current",
        "(C) high voltage to low voltage",
        "(D) low voltage to high voltage",
        " Ans . B",
        ""
    ],
    [
        "Q.28 Of the following properties of a wave, the one that is independent of the other is its.",
        "(A) amplitude",
        "(B) velocity",
        "(C) wavelength",
        "(D) frequency",
        " Ans . A",
        ""
    ],
    [
        "Q.29 Find the maximum velocity for the overturn of a car moving on a circular track of radius 100m. Theco-efficientof friction between the road and tyre is 0.2.",
        "(A) 0.14 m/s",
        "(B) 140 m/s",
        "(C) 1.4 m/s",
        "(D) 14 m/s",
        " Ans . D",
        ""
    ],
    [
        "Q.30 It is more difficult to walk on a sandy road than on a concrete road because",
        "(A) sand is soft andconcreteis hard",
        "(B) the friction between sand and feet is less than that between concrete and feet",
        "(C) the friction between sand and feet is more than that between concrete and feet",
        "(D) the sand is grainy but concrete is smooth",
        " Ans . B",
        ""
    ],
    [
        "Q.31 Magnetism at the centre of a bar magnet is",
        "(A) minimum",
        "(B) maximum",
        "(C) zero",
        "(D) minimum of maximum",
        " Ans . C",
        ""
    ],
    [
        "Q.32 Out of the following which is not emitted by radioactive substance?",
        "(A) Electrons",
        "(B) Electromagnetic radiations",
        "(C) Alpha particles",
        "(D) Neutrons",
        " Ans . D",
        ""
    ],
    [
        "Q.33 Lux is the SI unit of",
        "(A) intensity of illumination",
        "(B) luminous efficiency",
        "(C) luminous flux",
        "(D) luminous intensity",
        " Ans . A",
        ""
    ],
    [
        "Q.34 On a rainy day, small oil films on water show brilliant colours. This is due to",
        "(A) dispersion",
        "(B)interference",
        "(C) diffraction",
        "(D) polarization",
        " Ans . B",
        ""
    ],
    [
        "Q.35 Point A is at a lower electrical potential than point B. An electron between them on the line joining them will.",
        "(A) move towards A",
        "(B) move towards B",
        "(C) move at rightangicesto the line joining A and B",
        "(D) remain at rest",
        " Ans . B",
        ""
    ],
    [
        "Q.36 Material for rain-proof coats and tents owe their water-proof properties to",
        "(A) surface tension",
        "(B) viscosity",
        "(C) specific gravity",
        "(D) elasticity",
        " Ans . A",
        ""
    ],
    [
        "Q.37 RADAR is used for",
        "(A) locating submerged submarines",
        "(B) receiving asignalin a radio receiver",
        "(C) locating geostationarysatellites",
        "(D) detecting and locating the position of objectssuchas airplanes",
        " Ans . D",
        ""
    ],
    [
        "Q.38 Sound of frequency below 20 Hz is called.",
        "(A) audio sounds",
        "(B) infrasonic",
        "(C) ultrasonic",
        "(D) supersonics",
        " Ans . B  "
    ]
]