[
    [
        "Q.1. If thief is called constable, constable is called decoit, decoit is called judge, judge is called robber, robber is called lawyer &amp; lawyer is called teacher, then who will give the judgement in the court?",
        "(A) Judge      ",
        "(B) Robber     ",
        "(C) Decoit     ",
        "(D) Teacher",
        "Ans (B) :The robber will give the judgment in the court.",
        ""
    ],
    [
        "Q.2. If rain is called pink, pink is called cloud, cloud is called water, water is called bridge, what will you drink when you are thirsty?",
        "(A) Cloud      ",
        "(B) Water      ",
        "(C) Bridge     ",
        "(D) Pink",
        "Ans (C) :Bridge will be drunk when we feel thirst, because water is called as bridge in his code language.",
        ""
    ],
    [
        "Q.3. If code for green pink dress is skw nip xtp &amp; code for beautiful cotton dress is mbv xtp rib &amp; code for beautiful pink button is tsu rib skw, then what is mentioned by mbv?",
        "(A) pink       ",
        "(B) cotton     ",
        "(C) beautiful          ",
        "(D) button",
        "Ans (B) :green pink dress skw nip xtp beautiful cottondress mbv xtp ribbeautiful pink button  tsu ribskw",
        ""
    ],
    [
        "Q.4. In a code language, PAWAN is written as QBXBO, then how JAMUN will be written in the same language?",
        "Ans:       P A W A N  then  J A M U N",
        ""
    ],
    [
        "Q.5. In a certain code language, LONDON is written as 1015441514, then how FAUSTO will be written?",
        "(A) 10121452           ",
        "(B) 6121192015         ",
        "(C) 152019216         ",
        "(D) 1467325",
        "Ans: (B)Here, the letters of a given word are coded with their sequence no. in the alphabet.",
        ""
    ],
    [
        "Q.6. Which letter is a code for E ?",
        "(A) c           ",
        "(B) m          ",
        "(C) r           ",
        "(D) n",
        ""
    ],
    [
        "Q.7. Which letter is a code for L ?",
        "(A) n          ",
        "(B) c           ",
        "(C) k           ",
        "(D) p",
        ""
    ],
    [
        "Q.8. Which letter is a code for O ?",
        "(A) x           ",
        "(B) c           ",
        "(C) m          ",
        "(D) r",
        ""
    ],
    [
        "Q.9. Which letter is a code for F ?",
        "(A) p           ",
        "(B) c           ",
        "(C) a           ",
        "(D) x",
        ""
    ],
    [
        "Q.10. Which letter is a code for P ?",
        "(A) k           ",
        "(B) s           ",
        "(C) c           ",
        "(D) d",
        "Ans:           I                       II",
        "Ans.6.(C) as per the given conditions, E = r",
        "Ans.7.(D) as per the given conditions, L = p",
        "Ans.8.(B) as per the given conditions, O = c",
        "Ans.9.(C) as per the given conditions, F = a",
        "Ans.10. (D) as per the given conditions, P = d",
        ""
    ],
    [
        "Q.11. In a certain code, ROAD is written as URDG. How is SWAN written in that code?",
        "(A) VXDQ",
        "(B) VZDQ",
        "(C) VZCP",
        "(D) UXDQ",
        "Ans B",
        ""
    ],
    [
        "Q.12. If in a certain language, MADRAS is coded as NBESBT, how is BOMBAY coded in that language?",
        "(A) CPNCBX",
        "(B) CPNCBZ",
        "(C) CPOCBZ",
        "(D) CQOCBZ",
        "(E) None of these",
        "Ans C",
        ""
    ],
    [
        "Q.13. If in a certain code, LUTE is written as MUTE and FATE is written as GATE, then how will BLUE be written in that code?",
        "(A) CLUE",
        "(B) GLUE",
        "(C) FLUE",
        "(D) SLUE",
        "Ans A",
        ""
    ],
    [
        "Q.14. In a certain code, TWINKLE is written as SVHOJKD, then how would FILTERS be written in the same code?",
        "(A) EHKSDQR",
        "(B) EHKUDQR",
        "(C) EGKUDQR",
        "(D) GJMSFST",
        "(E) None of these",
        "Ans B",
        ""
    ],
    [
        "Q.15. If FISH is written as EHRG in a certain code, how would JUNGLE be written in that code ?",
        "(A) ITMFKD",
        "(B) ITNFKD",
        "(C) KVOHMF",
        "(D) TIMFKD   ",
        "Ans A  "
    ]
]