[
    [
        "Q.1. Ram, Shyam &amp; Mahesh have total 36 balls. Ram says Shyam that I give you 5 balls, you give 2 balls to Mahesh &amp; Mahesh will give me 5 balls, so you will have double balls than Mahesh has &amp; I will have three times of no. of balls you have. How many balls did Ram have in the beginning?",
        "(A) 16",
        "(B) 15",
        "(C) 28",
        "(D) 24",
        " Ans .  D",
        ""
    ],
    [
        "Q.2. A man has a fruit basket, full of 60 fruits. No. of apples is half of the no. of mangoes. Oranges are one fourth of total no. of apples &amp; mangoes. What is the no. of mangoes in the basket?",
        "(A) 30",
        "(B) 32",
        "(C) 16",
        "(D) 12",
        " Ans .  B",
        ""
    ],
    [
        "Q.3. 60 sec. time is taken to fire 11 bullets from a gun, then how much time will be taken to fire 8 bullets?",
        "(A) 30 seconds",
        "(B) 42 seconds",
        "(C) 50 seconds",
        "(D) None of these",
        " Ans .  B",
        ""
    ],
    [
        "Q.4. A pole is 30m. in height. A cockroach climbs 5m. up &amp; slips 1m. in a day. In how many days it will reach to the top?",
        "(A) 10 days",
        "(B) 9 days",
        "(C) ",
        "(D)",
        " Ans .  C",
        ""
    ],
    [
        "Q.5. 15 children or 12 persons can go using a lift. How many children can go with 8 persons?",
        "(A) 5",
        "(B) 6",
        "(C) 7",
        "(D) 8",
        " Ans .  A",
        ""
    ],
    [
        "Q.6. 10 people in a party offered gifts to one another. What was the total no. of gifts?",
        "(A) 35",
        "(B) 60",
        "(C) 40",
        "(D) 90",
        " Ans .  D",
        ""
    ],
    [
        "Q.7. A groups of animals contains some deer &amp; some hens. Total no. of their heads is 15 &amp; total no. of their legs is 50. Find no. of deer in the group.",
        "(A) 5",
        "(B) 8",
        "(C) 7",
        "(D) 10",
        " Ans .  D",
        ""
    ],
    [
        "Q.8. In an examination, a candidate gets 2 marks for the right answer &amp; loose 1 marks for the wrong answer. He got 80 marks by answering 100 questions. How many of his answer were right ?",
        "(A) 30",
        "(B) 35",
        "(C) 40",
        "(D) 60",
        " Ans .  D",
        ""
    ],
    [
        "Q.9. A light at traffic signal gets on at the interval of every 15 sec. It gets on at 4.20 hours for the first time &amp; at 5.10 hours for the last time. For how many times it was on?",
        "(A) 120 times",
        "(B) 121 times",
        "(C) 400 times",
        "(D) None",
        " Ans .  D",
        ""
    ],
    [
        "Q.10. A great-grandfather, two grandfathers, three father, three sons, two grandsons &amp; a great-grandson are the members of a family. All the males. How many members are in this group?",
        "(A) 12",
        "(B) 11",
        "(C) 8",
        "(D) 4",
        " Ans .  D",
        ""
    ],
    [
        "Q.11. When I reached to the station, I came to know than I was exactly half an hour earlier than the arrival of train. If the train was late by 1 hours, 20 min. &amp; it will come at 4.45 hours, then at what time I reached to the station?",
        "(A) 3.55",
        "(B) 3.25",
        "(C) 2.30",
        "(D) 2.55",
        " Ans .  D",
        ""
    ],
    [
        "Q.12. If m. cloth is required to make a shirt, then how long cloth will be required to make 30 shirts?",
        "(A) 30 m.",
        "(B) 60 m.",
        "(C) 75 m.",
        "(D) 80 m.",
        " Ans .  C",
        ""
    ],
    [
        "Q.13. if two cows eat 18 baskets of grass then how many baskets of grass will 18 cows eat?",
        "(A) 60",
        "(B) 162",
        "(C) 170",
        "(D) None",
        " Ans .  B",
        ""
    ],
    [
        "Q.14. A monkey climbs 10m. up in first minute on a slippery pole &amp; falls down 1m. in the next minute. How much time will he take to climb up the 92m. height pole?",
        "(A) 20 min.",
        "(B) 19 min.",
        "(C) 18 min.",
        "(D) ",
        " Ans .  D",
        ""
    ],
    [
        "Q.15. A 40 pages book has 10 lines in each page &amp; each line contains 5 words. Total no. of words in the book are ",
        "(A) 2000",
        "(B) 6000",
        "(C) 4550",
        "(D) 1368",
        " Ans .  A",
        ""
    ],
    [
        "Q.16. Quantity of water in a pound is doubled every hour. It becomes full in 10 hours, then in how much time it will be filled half?",
        "(A) 5 hrs.",
        "(B) 6 hrs.",
        "(C) 9 hrs.",
        "(D) 4 hrs.",
        " Ans .  C",
        ""
    ],
    [
        "Q.17. Santosh was travelling by a train. He met there a man &amp; five woman. Each woman was having a child in her arms. What was total no. of persons in the compartment?",
        "(A) 9",
        "(B) 10",
        "(C) 11",
        "(D) 12",
        " Ans .  D",
        ""
    ],
    [
        "Q.18. A man, his wife, their 4 sons &amp; their wives are the members of a family. Each son has three sons &amp; a daughters. Find the total no. of male members in the family.",
        "(A) 10",
        "(B) 12",
        "(C) 14",
        "(D) 17",
        " Ans .  D",
        ""
    ],
    [
        "Q.19. A cat was trying to climb a ladder. She was climbing four steps &amp; falling down one step for every time. How many actual steps she climbed when she reached 9 steps up?",
        "(A) 10",
        "(B) 12",
        "(C) 14",
        "(D) 9",
        " Ans .  A",
        ""
    ],
    [
        "Q.20. In joint family, father, mother, 3 married sons &amp; an unmarried daughter are the members. Two sons have 2-2 daughters &amp; one son has a son. What is the total no. of female members in this family?",
        "(A) 2",
        "(B) 3",
        "(C) 6",
        "(D) 9",
        " Ans .  D",
        ""
    ],
    [
        "Q.21. Ashoks mothers age before five years was three times of Ashoks age. She will be two elder than Ashok after five years. What is Ashoks age at present?",
        "(A) 10 years",
        "(B) 15 years",
        "(C) 20 years",
        "(D) 25 years",
        " Ans .  B",
        ""
    ],
    [
        "Q.22. There were certain no. of passengers in a bus when it started. Half of no. of passengers got down at the first stoppage &amp; 35 new passengers got in to the bus. passengers got down at the second stoppage &amp; 40 new passengers got into the bus. Then the total no. of passengers in the bus was 80 &amp; the bus reached to the destination without any more stoppage. How many passengers were in the beginning?",
        "(A) 25",
        "(B) 30",
        "(C) 40",
        "(D) 50",
        " Ans .  B",
        ""
    ],
    [
        "Q.23. Haris age is two times of Johnnys age, who is 3 years elder than Rahuls age, then what is Johnnys age ?",
        "(A) 2 years",
        "(B) 4 years",
        "(C) 5 years",
        "(D) 8 years",
        " Ans .  C",
        ""
    ],
    [
        "Q.24. My age is 2 years less than the double of my brothers age. If I am 16, then how old is my brother?",
        "(A) 7 years",
        "(B) 9 years",
        "(C) 10 years",
        "(D) 14 years",
        " Ans .  B",
        ""
    ],
    [
        "Q.25. Hema was two times elder than Gita before 10 years. If Hemas age after 10 years from now will be 40 years, then what is Gitas current age?",
        "(A) 45 years",
        "(B) 20 years",
        "(C) 15 years",
        "(D) 35 years",
        " Ans .  B",
        ""
    ],
    [
        "Q.26. There are 12 dozen apples in a basket. 2 dozen apples are added in it. Then 10 apples got rotten, so they were thrown out. The remaining apples are kept equally in 2 baskets. How many apples in each basket?",
        "(A) 89",
        "(B) 168",
        "(C) 158",
        "(D) 79",
        " Ans .  D",
        ""
    ],
    [
        "Q.27. How many poles will be required to construct a 300m. bridge if each pole is at the distance of m.?",
        "(A) 24",
        "(B) 22",
        "(C) 25",
        "(D) 23",
        " Ans .  C",
        ""
    ],
    [
        "Q.28. A man had two jute bags &amp; each jute bag contains 50-50 pieces of cloths. He is taking them to the other city. 50 octroi centres in the way. He cleverly gave 1-1 piece from each bag at every octroi centres as a tax. How many pieces would he have when he reaches to the city?",
        "(A) 0",
        "(B) 20",
        "(C) 25",
        "(D) None",
        " Ans .  C",
        ""
    ],
    [
        "Q.29. If a gun fires 7 bullets in 9 min. then how many bullets will be fired form it in 1 hour?",
        "(A) 45",
        "(B) 46",
        "(C) 47",
        "(D) 41",
        " Ans .  D",
        ""
    ],
    [
        "Q.30. Four friends A, B, C, D deposit some amount of money. A deposited two times money of the money deposited by C &amp; B deposits half of the amount deposited by A. As amount is half of the amount deposited by D. Which two have deposited the equal amount?",
        "(A) B, D",
        "(B) A, D",
        "(C) A, B",
        "(D) B, C",
        " Ans .  D",
        ""
    ],
    [
        "Q.31. A monkey climbs 15m. up &amp; slips 6m. in a day on a 100m. height pole. In how many days will he climb up?",
        "(A) 22 days",
        "(B) 40 days",
        "(C) 18 days",
        "(D)",
        " Ans .  D",
        ""
    ],
    [
        "Q.32. There were 18 people in a group. They shaked hands with one another. What is the total no. of hands they shaked?",
        "(A) 153",
        "(B) 402",
        "(C) 306",
        "(D) None",
        " Ans .  C",
        ""
    ],
    [
        "Q.33. Some teams played matches with one another in a sports series. Total no. of matches played was 120. How many teams played?",
        "(A) 14",
        "(B) 15",
        "(C) 16",
        "(D) 18",
        " Ans .  C",
        ""
    ],
    [
        "Q.34. A farmer has some cows &amp; some hens. No. of their heads is 38 &amp; no. of their legs is 100, then find the ratio of cows &amp; hens he has.",
        "(A) 2: 1",
        "(B) 1: 2",
        "(C) 6: 13",
        "(D) 13: 6",
        " Ans .  C",
        ""
    ],
    [
        "Q.35. In a class of 60 students, each boy gave as equal rupees as the no. of girls in the class &amp; each girl gave as equal rupees as the no. of boys in the class. If the total amount collected was Rs. 1600, then what is the no. of boys in the class?",
        "(A) 30",
        "(B) 35",
        "(C) 50",
        "(D) 40",
        " Ans .  D",
        ""
    ],
    [
        "Q.36. Two artists are in a film, from which one is a father of second actors son. What is their relation with each other?",
        "(A) Father  Son",
        "(B) Son  Mother",
        "(C) Husband  Wife",
        "(D) Grandfather  Grandson",
        " Ans .  C",
        ""
    ],
    [
        "Q.37. A clock for once at oclock, for twice at two oclock &amp; so on. For how many times will it ring in a day?",
        "(A) 60 times",
        "(B) 78 times",
        "(C) 156 times",
        "(D) 150 times",
        " Ans .  C",
        ""
    ],
    [
        "Q.38.10 cows can graze 10 bags of grass in 10 days, then in how many days 20 cows will graze 20 bags of grass?",
        "(A) 20 days",
        "(B) 1 days",
        "(C) 10 days",
        "(D) None of these",
        " Ans .  C",
        ""
    ],
    [
        "Q.39. 16 horses eat as much grass as 12 bullocks eat, then how many bullocks will eat the grass as much as 20 horses eat?",
        "(A) 10",
        "(B) 12",
        "(C) 15",
        "(D) 16",
        " Ans .  C",
        ""
    ],
    [
        "Q.40. A boy earns Rs. 2 for targeting perfectly &amp; looses 50 paise for losing the target. He lost his target for 3 times in a game of targeting. How much money did he get?",
        "(A) Rs. 8.50",
        "(B) Rs. 7",
        "(C) Rs. 6.50",
        "(D) Rs. 9.50",
        " Ans .  A",
        ""
    ],
    [
        "Q.41. 5 cats eat 5 mice in 5 minute, then in how many minutes 2 cat will eat 2 mice?",
        "(A) 2 min",
        "(B) 1 min",
        "(C) 5 min",
        "(D) 10 min",
        " Ans .  C",
        ""
    ],
    [
        "Q.42. A vegetable merchant is asked how many vegetable he is having in his bag, then he replied that all are brinjal except eight, all are tomatoes except eight, then how many vegetables he is having in his bag ",
        "(A) 8",
        "(B) 12",
        "(C) 24",
        "(D) 16",
        " Ans .  B",
        ""
    ],
    [
        "Q.43. A shepherd had 15 sheep, all sheep died except 9, then how many sheep he had?",
        "(A) 6",
        "(B) 9",
        "(C) 10",
        "(D) 12",
        " Ans .  B",
        ""
    ],
    [
        "Q.44. Mr. &amp; Mrs. Gopal have three daughters. Each daughter has brother. How many members are in the family?",
        "(A) 5",
        "(B) 6",
        "(C) 7",
        "(D) 8",
        " Ans .  B",
        ""
    ],
    [
        "Q.45. In a group of friends, two have wives, one is unmarried, wife of another one is no more and other two are divorces. They have gone to a picnic with four kids. How many members have gone to the picnic?",
        "(A) 12",
        "(B) 10",
        "(C) 14",
        "(D) 13",
        " Ans .  A",
        ""
    ],
    [
        "Q.46. Girdharilal has his wife Radha, 3 sons &amp; 2 daughter in his family. One daughter is unmarried &amp; one daughter has a son. Two sons are having 2-2 kids &amp; the third son has 3 kids. An elderly aunt &amp; a son-in-law are also staying with them. What is the total no. of members in Girdharilals family?",
        "(A) 20",
        "(B) 19",
        "(C) 18",
        "(D) 17",
        " Ans .  A",
        ""
    ],
    [
        "Q.47. Population of a city is doubled in every 7 years. If it was 12483 in 2009, then up to which year it will be 49932?",
        "(A) 2016",
        "(B) 2023",
        "(C) 2030",
        "(D) 2037",
        " Ans .  B",
        ""
    ],
    [
        "Q.48. A bus starts from Delhi. Passengers in the bus were some men &amp; some women. No. of women was half of the no. of men. 10 men got down at Meerut &amp; 5 women got into the bus. Now, the no. of men &amp; women equal in the bus. What was the total no of passengers from Delhi in the beginning?",
        "(A) 36",
        "(B) 45",
        "(C) 15",
        "(D) 30",
        " Ans .  B",
        ""
    ],
    [
        "Q.49. A man is 3 years elder than his wife &amp; 4 times elder than his son. If the sons age after 3 years will be 15, then what is the current age of his wife?",
        "(A) 60 years",
        "(B) 51 years",
        "(C) 48 years",
        "(D) 45 years",
        " Ans .  D",
        ""
    ],
    [
        "Q.50. One third of Rameshs marks in Arithmetic is equal to half of his marks in English. If he got 150 marks total in both subjects, then what is his score in English?",
        "(A) 60",
        "(B) 120",
        "(C) 30",
        "(D) 50",
        " Ans .  A",
        ""
    ],
    [
        "Q.51. Fathers age is 1 more than 5 time of his sons age. After 3 years, fathers age will be 2 less than the 4 times of his sons age. Find fathers current age.",
        "(A) 30 years",
        "(B) 40 years",
        "(C) 31 years",
        "(D) 29 years",
        " Ans .  C",
        ""
    ],
    [
        "Q.52. A man was 32 years old at the time of his first sons birth. His wife was 35 when his son was 7. Difference between age of that man &amp; his wife is ",
        "(A) 7 years",
        "(B) 3 years",
        "(C) 5 years",
        "(D) 4 years",
        " Ans .  D",
        ""
    ],
    [
        "Q.53. Average age of a husband, his wife &amp; their child before 3 years was 27 years. The average age of a wife &amp; child before 5 years was 20 years. What is the current age of husband?",
        "(A) 35 Years",
        "(B) 40 Years",
        "(C) 50 Years",
        "(D) 45 years",
        " Ans .  B",
        ""
    ],
    [
        "Q.54. A monkey climbs 6m. &amp; slip down 4m. in on a 20m. height pole in a day. In how many days he will reach to the top of the pole?",
        "(A) 14",
        "(B) 10",
        "(C) 8",
        "(D) 12",
        " Ans .  C",
        ""
    ],
    [
        "Q.55. A man has some cows &amp; some hens. No. of their heads is 48 &amp; no. of their legs is 140. Then what is the no. hens?",
        "(A) 28",
        "(B) 26",
        "(C) 30",
        "(D) 41",
        " Ans .  B",
        ""
    ],
    [
        "Q.56. 15 people in a group shaked their hands with one another. How many hands were shaked ?",
        "(A) 220",
        "(B) 240",
        "(C) 210",
        "(D) 230",
        " Ans .  C",
        "(A) 6",
        "(B) 8",
        "(C) 5",
        "(D)10",
        " Ans .  A",
        "Q.58. There were 20 presents in a party. They gave gifts to one another. How many gifts were given in the party?",
        "(A) 240",
        "(B) 350",
        "(C) 180",
        "(D) 380",
        " Ans .  D",
        "Q.59. Some students of a class shaked hands with one another for 600 times. How many students were in the class?",
        "(A) 25",
        "(B) 35",
        "(C) 65",
        "(D) 75",
        " Ans .  A",
        "Q.60. Some people shaked hands with one another for 110 times. How many people were in the group?",
        "(A) 21",
        "(B) 110",
        "(C) 11",
        "(D) 10",
        " Ans .  C "
    ],
    [
        ""
    ],
    [
        "Q.58. There were 20 presents in a party. They gave gifts to one another. How many gifts were given in the party?",
        "(A) 240",
        "(B) 350",
        "(C) 180",
        "(D) 380",
        " Ans .  D",
        ""
    ],
    [
        "Q.59. Some students of a class shaked hands with one another for 600 times. How many students were in the class?",
        "(A) 25",
        "(B) 35",
        "(C) 65",
        "(D) 75",
        " Ans .  A",
        ""
    ],
    [
        "Q.60. Some people shaked hands with one another for 110 times. How many people were in the group?",
        "(A) 21",
        "(B) 110",
        "(C) 11",
        "(D) 10",
        " Ans .  C "
    ]
]