[
    [
        "Q.1. Statement: Most of the college students are found more interested in fashion than the study.",
        "I. The colleges should ban the use of fashionable clothes &amp; other products.",
        "II. The college students should be busy in study so that they will not have the extra time for fashion &amp; other things.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  C",
        ""
    ],
    [
        "Q.2. Statement: Recently the counting of a leopard was done &amp; found that some of the leopards are missing from the leopard reserve.",
        "I. The government should arrange strictly for saving the remaining leopards.",
        "II. The government should immediately find the criminals responsible for the missing of leopards.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  C",
        ""
    ],
    [
        "Q.3. Statement:No. of malaria cases in the city is increased since last few months.",
        "I. The municipal officials should take an immediate action to destroy the mosquito breeding places &amp; improve the cleanliness.",
        "II. The mission should be started to train the people with the help of local media &amp; social workers for the measures of prevention of the disease.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  C",
        ""
    ],
    [
        "Q.4. The victim of imbalance in the industrial development is generally illiterate &amp; economically weaker people.",
        "I. The industrial development in India is mainly according to the political thinking.",
        "II. The scheduled tribe people are always adversely affected by the industrial development.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  D",
        ""
    ],
    [
        "Q.5. Statement:Rich people are very commonly suffering from heart attack.",
        "I. Most of the deaths of rich people are due to heart attack.",
        "II. Poor people do not suffer the heart attack.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  A",
        ""
    ],
    [
        "Q.6. Consider the statement true: There are books in each library. Which of the following statements is definitely true?",
        "(A) Books are only in the libraries.",
        "(B) None of a library is without books.",
        "(C) There are no readers in some libraries.",
        "(D) Libraries are for books only.",
        " Ans .  B",
        ""
    ],
    [
        "Q.7. Statement:Our digest system gets affects because of the difficulties &amp; fast life.",
        "I. Life is full of difficulties.",
        "II. We do not have the security system of ancient time.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  A",
        ""
    ],
    [
        "Q.8. Statement:Quality of life is lowered in India because of the population bombardment.",
        "I. Population &amp; quality of life are related to each other.",
        "II. Quality of life in India is not related to the population.",
        "(A) Only II is correct.",
        "(B) I &amp; II  both are correct.",
        "(C) Only I is correct.",
        "(D) I &amp; II  both are not correct.",
        " Ans .  C",
        ""
    ],
    [
        "Q.9. Statement:The life is collapsed in the state because of the heavy rain in the odd season since last two days. Five persons are killed in that, but there is a relief in the scarcity of water in the state.",
        "I. The state government should form a committee to review on this situation.",
        "II. The government should end all the bans related to the use of drinking water in all major cities of the state.",
        "(A) None",
        "(B) Only I.",
        "(C) I &amp; II  both",
        "(D) Only II",
        " Ans .  C",
        ""
    ],
    [
        "Q.10. Statement: The management institutes of the city, which are not approved for running this type of courses by the local university or technical education board, have admitted so many students.",
        "I. The university &amp; the technical education board should immediately cancel the approval of these management institutes.",
        "II. The institutes should be asked to return the fees to the students &amp; to admit the students for only granted courses.",
        "(A) Only I is followed.",
        "(B) Only II is followed.",
        "(C) Only III is followed.",
        "(D) II &amp; III  both are followed.",
        "(D) None of the above.",
        " Ans .  A",
        ""
    ],
    [
        "Q.11. Statement: So many teachers summitted their resignations to the head master in the protest of managements decisions of not to implement the revised pay scale.",
        "I. The school management should accept the resignations &amp; appoint new teachers.",
        "II. The school management should give assurance of thinking on the matter &amp; convince the teacher to continue their job.",
        "(A) None is followed",
        "(B) I or II is followed",
        "(C) Only III is followed.",
        "(D) Only I is followed.",
        "(E) Only II is followed.",
        " Ans .  C",
        ""
    ],
    [
        "Q.12. Statement:So many African tourists coming to India are arrested at various airports in the offense of smuggling of prohibited drugs.",
        "I. India should immediately stop to issue the visa to the Africans.",
        "II. The airport authority &amp; the enforcement agencies should be intimated to know about this type of smuggling.",
        "(A) I &amp; II  both are followed.",
        "(B) I &amp; III  both are followed.",
        "(C) Only III is followed.",
        "(D) II &amp; III  both are followed.",
        "(E) All are followed.",
        " Ans .  D",
        ""
    ],
    [
        "Q.13. Statement: Population is the major pollution factor.",
        "I. The increased population is the major resource.",
        "II. Illiterate population is the creator of poverty &amp; dirtiness.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  B",
        ""
    ],
    [
        "Q.14. Statement:If sports are encouraged more, the Indians will win more gold medals in the Olympic games.",
        "I. Indian do not win the gold medals.",
        "II. The output will be improved because of the encouragement of sports.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  B",
        ""
    ],
    [
        "Q.15. Statement: If the people are intelligent. They should be creative.",
        "I. Creativity &amp; intelligence are correlated. ",
        "II. Creative people are intelligent.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  A",
        ""
    ],
    [
        "Q.16. Statement: Most of the villagers are illiterate &amp; so they are superstitious.",
        "I. The logical thinking increases due to the education. ",
        "II. The villagers do not go to the schools.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  B",
        ""
    ],
    [
        "Q.17. Statement:Television effects in the development of teen age children.",
        "(A) Parents should control the TV watching children.",
        "(B) The teen age children should not watch the TV programs.",
        "(C) TV effects badly on the educational progress of teen age children.",
        "(D) Childrens educational, development related &amp; ethical sides should be considering while making the TV programs.",
        " Ans .  A",
        ""
    ],
    [
        "Q.18. Statement: All the children like ice-cream &amp; some children like chocolates.",
        "I. The children who like chocolates, they like ice-cream too.",
        "II. Pinki doesnt like chocolate but likes ice-cream.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  C",
        "Direction: (Q-19-20) In each of the following question, a statement is given &amp; then two assumptions  I &amp; II are given. You have to consider the statement as true though it seems to be different from the actual facts, then determine which of the assumption/s can be definitely correct. Select the option as your answer.",
        ""
    ],
    [
        "Q.19. Statement:So many people became sick after they had a food in a marriage ceremony &amp; they were immediately admitted to the government &amp; private hospitals nearby.",
        "I. The relatives of affected people were denying from admitting them to the government hospitals.",
        "II. The nearest hospital could provide the treatment to the victims.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  B",
        ""
    ],
    [
        "Q.20. Statement:So many institutes have adapted the online system for examination.",
        "I. It is possible that the people from all the regions of India are expert in computers.",
        "II. Online system is helpful to appoint the more suitable candidates.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  D",
        ""
    ],
    [
        "Q.21. Statement:The politicians become rich due to the public votes.",
        "I. The people vote to make the politicians rich.",
        "II. The politicians become rich because of their skill/virtue.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans .  D",
        ""
    ],
    [
        "Q.22. Statement:Economical progress is not achieved from the theoretical education &amp; it continuously leads to the loss of confidence &amp; money in the country.",
        "I. Confidence development &amp; economical development are deeply related.",
        "II. There is a great contribution of theoretical education in the development of confidence.",
        "(A) Only assumption I is correct.",
        "(B) Only assumption II is correct.",
        "(C) Assumption I &amp; II  both are correct.",
        "(D) None of assumption I &amp; II is correct.",
        " Ans . D   ",
        " "
    ]
]