[
    [
        "Q:1. If MADRAS can be written as ARSARS, how can ARKONAM be written in that code?",
        "A. ROAAKNM B. ROAKANM C. ROAKNNM D. ROKANAM",
        " Ans . A",
        ""
    ],
    [
        "Q:2. In a certain code, COMPUTER is written as RFUVQNPC. How is MEDICINE written in the same code?",
        "A. EOJDEJFM B. MFEJDJOE C. MFEDJJOE D. EOJDJEFM",
        " Ans . D",
        ""
    ],
    [
        "Q:3. If in a certain language FASHION is coded as FOIHSAN, how is PROBLEM coded in that code?",
        "A. PELBROM B. PRBOELM C. PELBORM D. RPBOELM",
        " Ans . C",
        ""
    ],
    [
        "Q:4. Choose the word which is least like the others word in a group?",
        "A. Moon B. Sun C. Universe D. Star",
        " Ans . C",
        ""
    ],
    [
        "Q:5. Choose the word which is least like the others word in a group",
        "A. Chemistry B. Geography C. Zoology D. Botany",
        " Ans . B",
        ""
    ],
    [
        "Q:6. Choose the word which is least like the others word in a group?",
        "A. Mechanic B. Engineer C. Mason D. Blacksmith E. Architect",
        " Ans . A",
        ""
    ],
    [
        "Q:7. Today is Wednesday, What will be the day after 94 days?",
        "A. Monday B. Wednesday C. Friday D. Sunday",
        " Ans . B",
        ""
    ],
    [
        "Q:8. If 1st October is Sunday, then 1st November will be",
        "A. Wednesday B. Friday C. Sunday D. Monday",
        " Ans . A",
        ""
    ],
    [
        "Q:9. Suganya went to the movies nine days ago. She goes to the movies only on Thursday. What day of the week is today?",
        "A. Friday B. Saturday C. Tuesday D. Thursday",
        " Ans . B",
        ""
    ],
    [
        "Q:10. Kanmani ranked sixteenth from the top and twenty ninth from the bottom among those who passed an examination. Six boys did not participate in the competition and five failed in it. How many boys were there in the class?",
        "A. 35 B. 45 C. 50 D. 55",
        " Ans . D",
        ""
    ],
    [
        "Q:11. Murugan is sixth from the left end and Prasanna is tenth from the right end in a row of boys. If there are eight boys between Murugan and Prasanna, how many boys are there in the row?",
        "A. 21 B. 23 C. 24 D. 25",
        " Ans . C",
        ""
    ],
    [
        "Q:12. In a row of girls, Nithya and Suganya occupy the ninth place from the right end and tenth place from the left end, respectively. If they interchange their places, then Nithya and Suganya occupy seventeenth place from the right and eighteenth place from the left respectively. How many girls are there in the row?",
        "A. 22 B. 24 C. 26 D. 28",
        " Ans . C",
        ""
    ],
    [
        "Q:13. Prasanna said, This girl is the wife of the grandson of my mother. Who is Prasanna to the girl?",
        "A. Husband B. Father C. Fatherinlaw D. Grandfather",
        " Ans . A",
        ""
    ],
    [
        "Q:14. If Arun says, Vimal mother is the only daughter of my mother, how is Arum related to Ravi?",
        "A. Father B. Brother C. Grandfather D. None of these",
        " Ans . D",
        ""
    ],
    [
        "Q:15. Pointing to a man in a photograph. Asha said. His mothers only daughter is my mother. How is Asha related to that man?",
        "A. Wife B. Sister C. Niece D. Nephew",
        " Ans . C",
        "Direction (16-18) Eight friends  P, Q, R, S, T, U, V &amp; W are sitting around a circle facing the center. V is third to the right of Q &amp; second to the left of R. Q is second to the left of T &amp; immediate right of S. U is between Q &amp; T. P is not at the left of R.",
        ""
    ],
    [
        "Q:16. Who is exactly at left of S?",
        "(A) Q",
        "(B) P",
        "(C) U",
        "(D) V",
        " Ans . B",
        ""
    ],
    [
        "Q:17. Who is second to right of T?",
        "(A) R",
        "(B) P",
        "(C) W",
        "(D)V",
        " Ans . C",
        ""
    ],
    [
        "Q:18. In which of the following pairs the first person sits exactly at the right of second person?",
        "(A) UT",
        "(B) WR",
        "(C) WT",
        "(D) VT",
        " Ans . D",
        "(A) If only conclusion I is followed.",
        "(B) If only conclusion II is followed.",
        "(C) If both the conclusions are followed.",
        "(D) If both the conclusions are not followed.",
        ""
    ],
    [
        "Q:19. Statement:",
        "I. Some fans are not radio.",
        "II. All of radio are not fans.",
        " Ans . D",
        ""
    ],
    [
        "Q:20. Statement:",
        " Ans . A",
        ""
    ],
    [
        "Q:21. Statement",
        "I. Some pillows are cups.",
        "II. Some pen are cups.",
        " Ans . A",
        ""
    ],
    [
        "Q:22. Total no. of villagers is ",
        "(A) 20",
        "(B) 43",
        "(C) 30",
        "(D) 24",
        " Ans . B",
        ""
    ],
    [
        "Q:23. Total no. of literate urban unemployed people is ",
        "(A) 8",
        "(B) 4",
        "(C) 12",
        "(D) 10",
        " Ans . C",
        ""
    ],
    [
        "Q:24. No. of villagers which are illiterate &amp; unemployed is ",
        "(A) 8",
        "(B) 4",
        "(C) 10",
        "(D) 9",
        " Ans . C",
        ""
    ],
    [
        "Q:25. Lotus, Flower, Rose",
        " Ans . C",
        ""
    ],
    [
        "Q:26. Triangle, Quadrilateral, Square",
        " Ans . D",
        ""
    ],
    [
        "Q:27. Dog, Cat, Animal",
        " Ans . A",
        ""
    ],
    [
        "Q:28. How many students are in the class?",
        "I. Nishas rank in the class from the top is 10th &amp; from the bottom is 23rd.",
        "II. Nandita is 10 rank above Roopa, who is 18thform the top.",
        " Ans . A",
        ""
    ],
    [
        "Q:29. Who is the tallest among P, T, J, L, &amp; F having different heights?",
        "I. P is taller than only J &amp; F.",
        "II. T is not the tallest one.",
        " Ans . D",
        ""
    ],
    [
        "Q:30. In which direction is village P with respect to village Q?",
        "I. Village H is in the East of P &amp; in the South of Q.",
        "II. Village F is in the North of P &amp; in the west of Q.",
        " Ans . E",
        ""
    ],
    [
        "Q:31. In a certain code, PAPER is written as SCTGW, How is MOTHER written in that code?",
        "(A) ORVLGW (B) PQVJGT (C) PQXJJT (D) PQXKJV",
        " Ans . C",
        ""
    ],
    [
        "Q:32. In a certain code, DISTANCE is written as IDTUBECN ad DOCUMENT is written as ODDVNTNE. How is THURSDAY written in that language?",
        "(A) DTVSTEYA (B) HTTQRYAD (C) HTVSTYDA (D) HTVSTYAD",
        " Ans . D",
        ""
    ],
    [
        "Q:33. In a certain code, SUBSTITUTION is written as ITBUSNOITUT. How is DISTRIBUTION written in that code?",
        "(A) ITTSIDNOITUB (B) IRTSIDNOIBUT (C) IRTDISNOITUB (D) IRTDISNOIUTR",
        " Ans . A",
        ""
    ],
    [
        "Q:34. Ship is related to Captain in the same way as Newspaper is related to",
        "A. Publisher B. Reader C. Editor D. Printer E. None of these",
        " Ans . C",
        ""
    ],
    [
        "Q:35. Marriage is to Divorce as true is to",
        "A. False B. Truth C. Story D. Fiction E. None of these",
        " Ans . A",
        ""
    ],
    [
        "Q:36. Fish is related to Water in the same way as Bird is related to",
        "A. Water B. Sky C. Food D. Air E. None of these",
        " Ans . B",
        ""
    ],
    [
        "Q:37. Rahul ranked ninth from the top and thirty eighth from the bottom in a class. How many students are there in the class ? ",
        "A.45 B.46 C.47 D.48",
        " Ans . B",
        ""
    ],
    [
        "Q:38 A. 64 B. 65 C. 66 D. Cannot be determined",
        " Ans . A",
        ""
    ],
    [
        "Q:39. Three persons A, B and C are standing in a queue. There are five persons between A and B and eight persons between B and C. If there be three persons ahead of C and 21 persons behind A, what could be the minimum number of persons in the queue ? ",
        "A. 41 B. 40 C. 28 D. 27",
        " Ans . C",
        ""
    ],
    [
        "Q:40 A. 213549 B. 203448 C. 163044 D. 62034",
        " Ans . A",
        ""
    ],
    [
        "Q:41. 42 : 56 : : 110 : ? ",
        "A.18 B.126 C.132 D.140",
        " Ans . C",
        ""
    ],
    [
        "Q:42 A. 6 B. 7 C. 8 D. 9",
        " Ans . C",
        ""
    ],
    [
        "Q:43. Car : Garage : : Aeroplane : ? ",
        "A.  Hangar B.  Depot C. Port D. Harbour",
        " Ans . A",
        ""
    ],
    [
        "Q:44. Monday : Saturday : : Thursday : ? ",
        "A.  Sunday B.  Tuesday C.  Friday D.  Wednesday",
        " Ans . B",
        ""
    ],
    [
        "Q:45. Push :Pull : : Throw : ? ",
        "A. Pick B. Jump C. Collect D. Game",
        " Ans . A",
        ""
    ],
    [
        "Q:46. Cat is related to Kitten in the same way as Fish is related to ",
        "A.  Fry B.  Fawn C.  Fin D.  Foal",
        " Ans . A",
        ""
    ],
    [
        "Q:47. Distil is related to Whiskey in the same way as Brew is related to ",
        "A.  Sugar B.  Gin C.  Beer D.  Ferment",
        " Ans . C",
        ""
    ],
    [
        "Q:48 A.  Amristar B.  Martyrdom C.  War D.  Punjab",
        " Ans . B",
        ""
    ],
    [
        "Q:49. You go North, turn right, then right again and then go the left. In which direction are you now? ",
        "A. North B. South C. East D. West",
        " Ans . C",
        ""
    ],
    [
        "Q:50. Namita walks 14 metres towards west, then turns to her right and walks 14 metres and then turns to her left and walks 10 metres. Again turning to her left she walks 14 metres. What is the shortest distance between her starting point and the present position? ",
        "A. 10 B. 24 C. 28 D. 38",
        " Ans . B",
        ""
    ],
    [
        "Q:51. A man is facing north-west. He turns 90 in the clockwise direction and then 135 in the anti clockwise direction. Which direction is he facing now? ",
        "A. East B. West C. North D. South",
        " Ans . B",
        ""
    ],
    [
        "Q:52. 1.Cut 2.Put on 3.Mark 4.Measure 5.Tailor",
        "A. 3,1,5,4,2 B. 1,3,2,4,5 C. 2,4,3,1,5 D. 4,3,1,5,2",
        " Ans . D",
        ""
    ],
    [
        "Q:53. 1.Yarn 2.Plant 3.Saree 4.Cotton 5.Cloth",
        "A. 2,4,1,5,3 B. 2,4,5,1,3 C. 2,4,5,3,1 D. 2,4,3,5,1",
        " Ans . A",
        ""
    ],
    [
        "Q:54. 1.Rainbow 2.Rain 3.Sun 4.Happy 5.Child",
        "A. 4,2,3,5,1 B. 4,5,1,2,3 C. 2,1,4,3,5 D. 2,3,1,5,4",
        " Ans . D",
        ""
    ],
    [
        "Q:55. If + means,  means,  means  &amp;means +, then, 6 36  4 2+ 2 =?",
        "(A) 6",
        "(B) 8",
        "(C) 11",
        "(D) 17",
        " Ans . C",
        ""
    ],
    [
        "Q:56. If + means Multiply, means Divide,  means Add &amp; means Subtract, then, 20  8 4  3+ 2 =?",
        "(A) 16",
        "(B) 20",
        "(C) 18",
        "(D) 31",
        " Ans . A",
        ""
    ],
    [
        "Q:57. If P means, Q means, Rmeans + &amp; S means , then what is the value of 154 Q 14 S 7 P 3 R 25?",
        "(A) 35",
        "(B) 57",
        "(C) 42",
        "(D) 15",
        " Ans . D",
        ""
    ],
    [
        "Q:58. If B says that his mother is the only daughter of As mother, how is A related to B?",
        "(A) Son",
        "(B) Grandfather",
        "(C) Uncle",
        "(D) Brother",
        " Ans . C",
        ""
    ],
    [
        "Q:59. A is Bs wife and C is As sister. D is the father of C, while E is Ds son. What is the relation of E to B?",
        "(A) Brother",
        "(B) Brother-in-law",
        "(C) Cousin",
        "(D) Father-in-law",
        " Ans . B",
        ""
    ],
    [
        "Q:60. Pointing to a photograph, a man said, I have no brother or sister but that mans father is my fathers son. Whose photograph was it?",
        "(A) His sons",
        "(B) His father's",
        "(C) His nephews",
        "(D) His own",
        " Ans . A",
        ""
    ],
    [
        "Q:61. 1. Rain 2. Vaporization 3. Water 4. Condensation 5. Clouds",
        "(A) 1, 3, 2, 4, 5",
        "(B) 3, 2, 4, 5, 1",
        "(C) 3, 2, 5, 4, 1",
        "(D) 2, 3, 5, 4, 1",
        " Ans . A",
        ""
    ],
    [
        "Q:62. 1. Digestion 2. Cooking 3. Chewing 4. Swallowing 5. Testing",
        "(A) 5, 2, 3, 4, 1",
        "(B) 2, 5, 3, 4, 1",
        "(C) 3, 5, 2, 4, 1",
        "(D) 2, 5, 4, 3, 1",
        " Ans . A",
        ""
    ],
    [
        "Q:63. 1. Plant 2. Food 3. Seed 4. Leaf 5. Flower",
        "(A) 1, 3, 4, 5, 2",
        "(B) 3, 1, 4, 5, 2",
        "(C) 3, 2, 4, 5, 1",
        "(D) 5, 4, 3, 2, 1",
        " Ans . A   "
    ]
]