[
    [
        "Q.1.Ram said to me, I am going to Jaipur.",
        "(A) Ram told me that he was going to Jaipur.",
        "(B) Ram told me that I was going to Jaipur.",
        "(C) Ram told me that he is going to Jaipur.",
        "(D) Ram told me that he were going to Jaipur.",
        " Ans . A",
        ""
    ],
    [
        "Q.2.Mohan Said to her, You have completed your work.",
        "(A) Mohan told her that She had completed her work.",
        "(B) Mohan told her that She has completed her work.",
        "(C) Mohan told her that She was completed her work.",
        "(D) Mohan told her that She had completed his work.",
        " Ans . A",
        ""
    ],
    [
        "Q.3. Radha said to us, You will get your salary from your office tomorrow.",
        "(A) Radha told us that we would get our salary from our office the next day.",
        "(B) Radha told us that we will get our salary from our office the next day.",
        "(C) Radha told us that we would get our salary from your office the next day.",
        "(D) Radha told us that we shall get our salary from our office the next day.",
        " Ans . A",
        ""
    ],
    [
        "Q.4.Maya Said to him, You can do this work.",
        "(A) Maya told him that he could do that work.",
        "(B) Maya told him that he could do this work.",
        "(C) Maya told him that he can do that work.",
        "(D) Maya told him that he would do that work.",
        " Ans . A",
    ],
    [
        "Q.6. \"If you don't keep quiet I shall shoot you\", he said to her in a calm voice.",
        "(A)He warned her to shoot if she didnt",
        "(B) He said calmly that I shall shoot you if you don",
        "(C) He warned her calmly that he would shoot her if she didn",
        "(D) Calmly he warned her that be quiet or else he will have to shoot her.",
        " Ans . C",
        ""
    ],
    [
        "Q.7. I told him that he was not working hard.",
        "(A) I said to him, \"You are not working hard.\"",
        "(B) I told to him, \"You are not working hard.\"",
        "(C) I said, \"You are not working hard.\"",
        "(D) I said to him, \"He is not working hard.\"",
        " Ans . A",
        ""
    ],
    [
        "Q.8. His father ordered him to go to his room and study.",
        "(A) His father said, \"Go to your room and study.\"",
        "(B) His father said to him, \"Go and study in your room.\"",
        "(C) His father shouted, \"Go right now to your study room\"",
        "(D) His father said firmly, \"Go and study in your room.\"",
        " Ans . A",
        ""
    ],
    [
        "Q.9. He said to his father, \"Please increase my pocket-money.\"",
        "(A) He told his father, \"Please increase the pocket-money\"",
        "(B) He pleaded his father to please increase my pocket money.",
        "(C) He requested his father to increase his pocket-money.",
        "(D) He asked his father to increase his pocket-money.",
        " Ans . C",
        ""
    ],
    [
        "Q.10. She said that her brother was getting married.",
        "(A) She said, \"Her brother is getting married.\"",
        "(B) She told, \"Her brother is getting married.\"",
        "(C) She said, \"My brother is getting married.\"",
        "(D) She said, \"My brother was getting married.\"",
        " Ans . C",
        ""
    ],
    [
        "Q.11. The boy said, \"Who dare call you a thief?\"",
        "(A) The boy enquired who dared call him a thief.",
        "(B) The boy asked who called him a thief.",
        "(C) The boy told that who dared call him a thief.",
        "(D) The boy wondered who dared call a thief.",
        " Ans . A",
        ""
    ],
    [
        "Q.12. She exclaimed with sorrow that was a very miserable plight.",
        "(A) She said with sorrow, \"What a pity it is.\"",
        "(B) She said, \"What a mystery it is.\"",
        "(C) She said, \"What a miserable sight it is.\"",
        "(D) She said, \"What a miserable plight it is.\"",
        " Ans . D",
        ""
    ],
    [
        "Q.13. Dhruv said that he was sick and tired of working for that company.",
        "(A) Dhruv said, \"I am sick and tired of working for this company.\"",
        "(B) Dhruv said, \"He was tired of that company.\"",
        "(C) Dhruv said to me, \"I am sick and tired of working for this company.\"",
        "(D) Dhruv said, \"I will be tired of working for that company.\"",
        " Ans . A",
        ""
    ],
    [
        "Q.14. \"Are you alone, my son?\" asked a soft voice close behind me.",
        "(A) A soft voice asked that what I was doing there alone.",
        "(B) A soft voice said to me are you alone son.",
        "(C) A soft voice from my back asked If I was alone.",
        "(D) A soft voice behind me asked If I was alone.",
        " Ans . D",
        ""
    ],
    [
        "Q.15. She said to him, \"Why don't you go today?\"",
        "(A) She asked him why he did not go that day.",
        "(B) She said to him why he don",
        "(C) She asked him not to go that day.",
        "(D) She asked him why he did not go today.",
        " Ans . A",
        ""
    ],
    [
        "Q.16. He exclaimed with joy that India had won the Sahara Cup.",
        "(A) He said, \"India has won the Sahara Cup\"",
        "(B) He said, \"India won the Sahara Cup\"",
        "(C) He said, \"How! India will win the Sahara Cup\"",
        "(D) He said, \"Hurrah! India has won the Sahara Cup\"",
        " Ans . D",
        ""
    ],
    [
        "Q.17. The little girl said to her mother, \"Did the sun rise in the East?\"",
        "(A) The little girl said to her mother that the sun rose in the East.",
        "(B) The little girl asked her mother if the sun rose in the East.",
        "(C) The little girl said to her mother if the sun rises in the East.",
        "(D) The little girl asked her mother if the sun is in the East.",
        " Ans . B",
        ""
    ],
    [
        "Q.18. The man said, \"No, I refused to confers guilt.\"",
        "(A) The man emphatically refused to confers guilt.",
        "(B) The man refused to confers his guilt.",
        "(C) The man told that he did not confers guilt.",
        "(D) The man was stubborn enough to confers guilt.",
        " Ans . A",
        ""
    ],
    [
        "Q.19. Nita ordered her servant to bring her cup of tea.",
        "(A) Nita told her servant, \"Bring a cup of tea.\"",
        "(B) Nita said, \"Bring me a cup of tea.\"",
        "(C) Nita said to her servant, \"Bring me a cup of tea.\"",
        "(D) Nita told her servant, \"Bring her that cup of tea.\"",
        " Ans . C",
        ""
    ],
    [
        "Q.20.My cousin said, \"My room-mate had snored throughout the night.\"",
        "(A) my cousin said that her room-mate snored throughout the night.",
        "(B) my cousin told me that her room-mate snored throughout the night.",
        "(C) my cousin complained to me that her room-mate is snoring throughout the night.",
        "(D) my cousin felt that her room-mate may be snoring throughout the night.",
        " Ans . A",
        ""
    ],
    [
        "Q.21. \"Please don't go away\", she said.",
        "(A) She said to please her and not go away.",
        "(B) She told me to go away.",
        "(C) She begged me not to go away.",
        "(D) She begged that I not go away.",
        " Ans . C",
        ""
    ],
    [
        "Q.22. \"Please don't go away\", she said.",
        "(A) She said to please her and not go away.",
        "(B) She told me to go away.",
        "(D) She begged that I not go away.",
        " Ans . C",
        ""
    ],
    [
        "Q.23. She said to her friend, \"I know where is everyone\"",
        "(A) She told that she knew where was everyone.",
        "(B) She told her friend that she knew where was everyone.",
        "(C) She told her friend that she knew where is everyone.",
        "(D) She told her friend that she knows where was everyone.",
        " Ans . B",
        ""
    ],
    [
        "Q.24. \"Please don't go away\", she said.",
        "(A) She said to please her and not go away.",
        "(B) She told me to go away.",
        "(C) She begged me not to go away.",
        "(D) She begged that I not go away.",
        " Ans . C "
    ]
]