[
    [
        "Q.1. Out of 10 teachers of a school, one teacher retires and in place of him a new teacher 25 yrs. old joins. As a result of it average age of the teachers reduces by 3 yrs. Age of the retired teacher (in yrs.) is.",
        "(A) 55",
        "(B) 65",
        "(C) 45",
        "(D) 75",
        " Ans .  A",
        ""
    ],
    [
        "Q.2. The average weight of 20 students in a class is increased by 0.75 kg when one student of 35 kg replaced by a new student weight of the new student (in kg) is:",
        "(A) 35",
        "(B) 40",
        "(C) 45",
        " Ans .  D",
        ""
    ],
    [
        "Q.3. In a class, three are 40 boys and their age is 16 years. One boy, aged 17 years, leaving the class and another joining, the average age becomes 15.875 years. The age of the new boy is :",
        "(A) 12 years",
        "(B) 14.5 years",
        "(C) 15 years",
        " Ans .  A",
        ""
    ],
    [
        "Q.4. The average age of 8 men is increased by 2 years when two of them whose age are 21 and 23 years replaced by two new men. The age of the two new men is :",
        "(A) 22 years",
        "(B) 24 years",
        "(C) 28 years",
        " Ans .  D",
        ""
    ],
    [
        "Q.5. The average age of 30 boys in a class is 15 years. One boy, aged 20 years, left the class, but two new boys came in his place whose age differs by 5 years. If the average of all the boys now in the class becomes 15 years, the age of the younger newcomer is:",
        "(A) 20 years",
        "(B) 15 years",
        "(C) 10 years",
        " Ans .  B",
        ""
    ],
    [
        "Q.6. The average marks of 32 boys of section A of class X is 60 whereas the average marks of 40 boys of section B of class X is 33. The average marks for both the sections combined together is",
        "(A) 44",
        "(B) 45",
        "(C) 46",
        "(D) 45",
        " Ans .  B",
        ""
    ],
    [
        "Q.7. A man bought 13 articles at Rs. 70 each, 15 at Rs. 60 each and 12 at Rs. 65 each. The average price per article is",
        "(A) Rs. 60.25",
        "(B) Rs. 64.75",
        "(C) Rs. 65.75",
        "(D) Rs. 62.25",
        " Ans .  B",
        ""
    ],
    [
        "Q.8. A fruit seller sold big, medium and small sized apples for Rs. 15, Rs. 10, and Rs. 5 respectively. The total number of apples sold were in the ratio 3 : 2 : 5. Find the average cost of an apple.",
        "(A) 8",
        "(B) 10",
        "(C) 9",
        "(D) 7",
        " Ans .  C",
        ""
    ],
    [
        "Q.9. A man purchased 7 bags of rice at the rate of Rs. 800 each, 8 bags of rice at Rs. 1000 each and 5 bag of rice at the rate of Rs. 1200 each. What is the average cost of one bag of rice?",
        "(A) Rs. 1000",
        "(B) Rs. 980",
        "(C) Rs. 1120",
        "(D) Rs. 1050",
        " Ans .  B",
        ""
    ],
    [
        "Q.10. Three Science classes A, B and C take a Life Science test. The average score of class B is 76. The average score of class A and B is 79 and average score of class B and C is 81, Then the average score of class A, B and C is",
        "(A) 80",
        "(B) 81",
        "(C) 80.5",
        "(D) 81.5",
        " Ans .  D",
        ""
    ],
    [
        "Q.11. The average of marks scored by the students of a class is 68. The average of marks of the girls in the class is 80 and that of the boys is 60. What is the percentage of boys in the class?",
        "(A) 40%",
        "(B) 60%",
        "(C) 65%",
        "(D) 70%",
        " Ans .  B",
        ""
    ],
    [
        "Q.12. The average weight of 15 students in a class increases by 1.5 kg when one of the student weighing 40 kg is replaced by new student. What is the weight (in kg) of the new student?",
        "(A) 64.5kg.",
        "(B) 56 kg.",
        "(C) 60 kg.",
        "(D) 62.5 kg.",
        " Ans .  D",
        ""
    ],
    [
        "Q.13. There are 50 students in a class. There average weight is 45 kg. When one student leaves the class the average weight reduces by 100g. What is the weight of the student who left the class ?",
        "(A) 45 kg.",
        "(B) 47.9 kg.",
        "(C) 49.9 kg.",
        "(D) 50.1 kg.",
        " Ans .  C",
        ""
    ],
    [
        "Q.14. The average weight of 12 crewmen in a boat is increased by $${1\\over 3}$$kg, when one of the crewmen whose weight is 55 kg is replaced by new man. What is the weight of that new man?",
        "(A) 58 kg",
        "(B) 60 kg",
        "(C) 57 kg",
        "(D) 59 kg",
        " Ans .  D",
        ""
    ],
    [
        "Q.15. Average age of 8 men is increased by 3 years when two of them whose age are 30 and 34 years are replaced by 2 persons. What is the average age of the 2 persons?",
        "(A) 24 years",
        "(B) 32 years",
        "(C) 44 years",
        "(D) 48 years",
        " Ans . C "
    ]
]