[
    [
        "Q1. When a discount of 20% is given on a pizza, the profit is 32%. If the discount is 18%, then the profit is:</p>",
        " (A) 35.3% ",
        " (B) 20.6% ",
        " (C) 50% ",
        " (D) 64.7%  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q2. During a month-long annual sale, a shopkeeper sells his goods at a discount of 50%. But in the last week, he offers an additional discount of 40%. If the original price of a shirt is  x, then the price (in rupees) during the last week of the sale will be</p>",
        " (A) 30 % of x ",
        " (B) 10 % of x",
        " (C) 90 % of x ",
        " (D) 70 % of x ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q3. A shopkeeper marks the price of an item keeping 20% profit. If he offers a discount of $$12{1\\over 2}\\%$$ on the marked price, his gain percent will be</p>",
        " (A) 7.5% ",
        " (B) 8%",
        " (C) 4.5% ",
        " (D) 5%  ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q4. An article is listed at Rs 2375 A man purchases it at two successive discounts of 50 % and 25 % spends Rs 165 on repairing of article. If he sells the articles at a profit a of 62.5 % then what is the selling price (in Rs) of the article?</p>",
        " (A) Rs. 1715.39 ",
        " (B) Rs. 1464.6",
        " (C) Rs. 1467.6 ",
        " (D) Rs. 1492.6  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q5. The marked price of a watch was  720. A man bought the same for   550.80 after getting two successive discounts. the first being 10 %. then the second discount rate is</p>",
        " (A) 15% ",
        " (B) 18%",
        " (C) 12% ",
        " (D) 14%  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q6. A dozen pairs of socks quoted at  80 are available at a discount of 10%. How many pairs of socks can be bought for 24?</p>",
        " (A) 3",
        " (B) 6",
        " (C) 4",
        " (D) 5 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q7. A shopkeeper sells at a discount of 20% and earns a profit of 60%. If he sells the same table at 40% discount, then what will be his new profit percent?</p>",
        " (A) 35% ",
        " (B) 40%",
        " (C) 20% ",
        " (D) 30%  ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q8. Arvind purchased a wrist watch with 30% discount on the labelled price. He sold it with 40 % profit on the price he bought, what was his percent loss on the labelled price?</p>",
        " (A) 4 ",
        " (B) 8",
        " (C) 2 ",
        " (D) 6",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q9. The difference between a discount of 30% on  2,000 and two successive discounts of 25% and 5% on the same amount is</p>",
        " (A)  25 ",
        " (B)  40",
        " (C)  30 ",
        " (D)  35  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q10. A shopkeeper sold an item at a 10% loss after giving a discount equal to half the marked price. Then the cost price is</p>",
        " (A) $${5\\over 9}th$$ of marked price",
        " (B) $${7\\over 9}th$$ of marked price",
        " (C) $${1\\over 9}th$$ of marked price",
        " (D) $${4\\over 9}th$$ of marked price",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q11. While selling to the retailer, a company allows 30% discount on the marked price of their products. If the retailer sells those products at marked price, his profit % will be:</p>",
        " (A) 40% ",
        " (B) $$42{6\\over 7}\\%$$ ",
        " (C) 30% ",
        " (D) $${17\\over 2}\\%$$  ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q12. Rita bought a television set with 20% discount on the labeled price. She made a profit of Rs. 800 by selling it for Rs. 16,800. The labeled price of the set was</p>",
        " (A) Rs.20,800 ",
        " (B) Rs.24,000 ",
        " (C) Rs.18,000 ",
        " (D) Rs.20,000  ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q13. A shopkeeper allows a discount of 10% on the marked price of an item but charges a sales tax of 8% on the discounted price. If the customer pays  3,402 as the price including the sales tax, then the marked price is</p>",
        " (A)  3,600 ",
        " (B)  3,800",
        " (C)  3,400 ",
        " (D)  3,500  ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q14. A fan s listed at  150 with a discount of 20%. What additional discount must be offered to the customer to bring the net price to  108</p>",
        " (A) 15% ",
        " (B) 8% ",
        " (C) $$11{1\\over 9}\\%$$",
        " (D) None of these ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q15. A tradesman allows a discount of 15 % on the marked price. How much above the cost price must he mark his goods as to gain 19 %?</p>",
        " (A) 25% ",
        " (B) 30%",
        " (C) 34% ",
        " (D) 40%  ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q16. A double bed is marked at  7,5000. The shopkeeper allows successive discounts of 8 %, 5 % and 2 % on it. What is the net selling price?</p>",
        " (A)  6,4239  ",
        " (B)  6,500.50",
        " (C)  6,500 ",
        " (D)  6,000  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q17. A trader allows a trade of 20% and a cash discount of $$6{1\\over 4}\\%$$% on the marked price of the goods and gets a net gain of 20% of the cost. By how much above the cost should the goods be marked for the sale?</p>",
        " (A) 60% ",
        " (B) 70%",
        " (C) 40% ",
        " (D) 50%  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q18. The marked price of a shirt and trousers are in the ratio 1 : 2. The shopkeeper gives 40 % discount on the shirt. If the total discount on the shirt and trousers is 30 %, the discount offered on the trousers is</p>",
        " (A) 25% ",
        " (B) 30% ",
        " (C) 15% ",
        " (D) 20%  ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q19. A machine is marked at  6,800 and available at a discount of 10%. The shopkeeper gives another off-season discount to the buyer and sells the machine for  5,202. Find the offseason discount.</p>",
        " (A) 15% ",
        " (B) 18%  ",
        " (C) 10% ",
        " (D) 12% ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q20. How much percent above the cost price should a shopkeeper mark his goods so as to earn a profit of 32% after allowing a discount of 12% on the marked price?</p>",
        " (A) 60% ",
        " (B) 45%",
        " (C) 50% ",
        " (D) 40%  ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q21. A dealer buys an article marked at  25,000 with 20 % and 5% off. He spends 1,000 for its repair and sells it for  25,000 what is his gain or loss percent?</p>",
        " (A) Gain of 10 % ",
        " (B) Loss of 10 % ",
        " (C) Loss of 25 % ",
        " (D) Gain of 25 % ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q22. The marked price of an article is  100. A discount series of 5%, 10% successively reduces the price of an article by</p>",
        " (A)  24.5 ",
        " (B)  4.5 ",
        " (C)  14.5  ",
        " (D) None of these ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q23. A shopkeeper list the price of an article as  500. But he gives a certain discount which allows the buyer to pay  500 for the article including 10% sales tax. The rate of discount is</p>",
        " (A) $$9{1\\over 11}\\%$$",
        " (B) 11%",
        " (C) 10%",
        " (D) $$10{1\\over 11}\\%$$ ",
        "Correct Answer : A",
        "",
        ""
    ],
    [
        "Q24. A trader sells his goods at a discount of 20 %. He still makes a profit of 25 %. If he sells the goods at the marked price only. His profit will be</p>",
        " (A) 50.25% ",
        " (B) 54.25% ",
        " (C) 56.25% ",
        " (D) 25.56%  ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q25. A dealer buys a table listed at  1,500 and gets successive discounts of 20% and 10%. He spends  20 on transportation and sells at a profit of 20%. Find the selling price of the table (in rupee).</p>",
        " (A) 1200 ",
        " (B) 1230",
        " (C) 1320 ",
        " (D)  1080  ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q26. Rahim bought a T.V. with 20% discount on list price. Had he bought it with 25% discount he would have saved  500. At what price did he buy the T.V? </p>",
        " (A)  10,000 ",
        " (B)  8,000",
        " (C)  16,000 ",
        " (D)  12,000  ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q27. Two people, Savita and Karan, get their sales commissions based on the number of items sold each month. Their total sales commission amounts to Rs. 56,100 in a particular month. If savita got her commission 12 % higher than Karan, how much commission did Karan earn?</p>",
        " (A) Rs.29,500 ",
        " (B) Rs.22,805.45",
        " (C) Rs.26462.26 ",
        " (D) Rs.25,500.28 ",
        "Correct Answer : C",
        "",
        ""
    ],
    [
        "Q28. The Banker's discount on a bill due 6 months hence at 16% per annum is  216. The true discount is:</p>",
        " (A)  210 ",
        " (B)  200",
        " (C)  212 ",
        " (D)  180  ",
        "Correct Answer : B",
        "",
        ""
    ],
    [
        "Q29. In a shop shirt are usually sold at 40% above the cost price. During a sale, the shopkeeper offers a discount of 10% off the usual selling price. If he man ages to sell 72 shirts for  13,608 then his cost price per shirt, ( in ) is</p>",
        " (A) 149",
        " (B) 125",
        " (C) 210 ",
        " (D) 150 ",
        "Correct Answer : D",
        "",
        ""
    ],
    [
        "Q30. A person paid  17,000 for a motor - car after a single discount of 15 %. If he is given successive discounts of 5% and 10% then how much he would pay?</p>",
        " (A)  17,100 ",
        " (B)  18,900 ",
        " (C)  17,000 ",
        " (D)  17,010",
        "Correct Answer : A   "
    ]
]