[
    [
        "Q.1. A sum of Rs. 312 was divided among 100 boys and girls in such a way that each boy gets Rs. 3.60 and each girl Rs. 2.40. The number of girls is:",
        "(A) 35",
        "(B) 40",
        "(C) 60",
        "(D) 65",
        " Ans .  B",
        "3.60x + 2.40 (100  x) = 312 1.20x = 312  240 = 72  x = 15.",
        "",
        ""
    ],
    [
        "Q.2. Each boy contributed rupees equal to the number of girls and each girl contributed rupees equal to the number of boys in a class of 60 students. If the total contribution thus collected is Rs. 1600, how many boys are there in the class?",
        "",
        "(A) 25",
        "(B) 30",
        "(C) 50",
        "(D) Data inadequate",
        " Ans .  D",
        ""
    ],
    [
        "Q.3. In an examination, a student scores 4 marks for every correct answer and loses 1 marks for every wrong answer. If he attempts all 60 question and secure 130 marks, the number of question he attempts correctly is:",
        "",
        "(A) 35",
        "(B) 38",
        "(C) 40",
        "(D) 42",
        " Ans .  B",
        ""
    ],
    [
        "Q.4. A cricket team won 3 matches more than they lost. If a win gives them 2 points and loss (-1) point, how many matches, in all, have they played if their score is 23?",
        "",
        "(A) 17",
        "(B) 20",
        "(C) 37",
        "(D) 40",
        " Ans .  C",
        ""
    ],
    [
        "Q.5. On childrens Day, sweets were to be equally distributed among 175 children in a school. Actually, on the childrens Day, 35 children were absent and therefore each child got 4 sweets extra. Total how many sweets were available for distribution?",
        "",
        "(A) 2400",
        "(B) 2480",
        "(C) 2680",
        "(D) 2750",
        "(E) None of these",
        " Ans .  E",
        ""
    ],
    [
        "Q.6. A certain number of tennis balls were purchased for Rs. 450. Five more balls could have been purchased in the same amount if each ball was cheaper by Rs. 15. The number of balls purchased was:",
        "",
        "(A) 10",
        "(B) 15",
        "(C) 20",
        "(D) 25",
        " Ans .  A",
        ""
    ],
    [
        "Q.7. The price of 10 chairs is qual to that of 4 tables. The price of 15 chairs and 2 tables together is Rs. 4000. The total price of 12 chairs and 3 tables is:",
        "",
        "(A) Rs. 3500",
        "(B) Rs. 3750",
        "(C) Rs. 3840",
        "(D) Rs. 3900",
        " Ans .  D",
        ""
    ],
    [
        "Q.8. The price of 2 sarees and 4 shirts is Rs. 1600. With the same money one can buy 1 saree and 6 shirts. If one wants to buy 12 shirts, how much shall he have to pay?",
        "",
        "(A) Rs. 1200",
        "(B) Rs. 2400",
        "(C) Rs. 4800",
        "(D) cannot be determined",
        "(E) None of these",
        " Ans .  B",
        ""
    ],
    [
        "Q.9. In a classroom, if 6 students per bench are assigned to accommodate all student, one more bench will be required. However, if 7 students are accommodated per bench, there would be space left for 5 students. What is the number of students in the class?",
        "",
        "(A) 30",
        "(B) 42",
        "(C) 72",
        "(D) None of these",
        " Ans .  C",
        ""
    ],
    [
        "Q.10. In a group of buffaloes and ducks, the number of legs are 24 more than twice the number of heads. What is the number of buffaloes in the group?",
        "(A) 6",
        "(B) 8",
        "(C) 10",
        "(D) 12",
        " Ans .  D "
    ]
]